[
  {
    "name": "Access Group",
    "link": "https://hgcapital.com/portfolio/access",
    "summary": "The Access Group is a leading provider of fully-integrated business management software to UK mid-market organisations.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/7IC2PJBq30SoZJthLDS1Wa/ae8ea91f4ca611fce48c88006ec9365e/access-logo.png",
    "description": "Founded in 1991, the Access Group ('Access') is a leading Enterprise Resource Planning (\"ERP\") business, providing a range of horizontal and industry-specific software solutions to SME and mid-market customers in Australia, Ireland and the UK. With its portfolio spanning Finance, HR, and Payroll, as well as Recruiting, Hospitality, Health & Social Care, Legal, Not for Profit, and Education sectors, Access’ software helps over 60,000 businesses and not-for-profit organizations to work efficiently. \n\nHg initially partnered with Access in 2018, and further invested in 2020 and 2022, to continue supporting them in their geographical and product portfolio expansion, as well as their cloud strategy",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/7IC2PJBq30SoZJthLDS1Wa/ae8ea91f4ca611fce48c88006ec9365e/access-logo.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/uq6y8SteNHSAT0pLyhh0x/9366d69212781ce1189ad812cb4409d5/Accessinvest-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://www.theaccessgroup.com/en-gb/",
    "linkedin": "https://www.linkedin.com/company/accessgroup",
    "twitter": "https://twitter.com/theaccessgroup"
  },
  {
    "name": "AMDT",
    "link": "https://hgcapital.com/portfolio/AMDT",
    "summary": "AMDT is a provider of version control software for smart production machinery and other industrial Internet of Things devices.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/4iNb9kmi2bz1uYTcizjcAi/95e9405309617ac050cae0f3b764b48f/AMDT_logo.png",
    "description": "Founded in 2007 and headquartered in Germany, AMDT is the global market and technology leader for versioning and backup solutions in industrial automation with more than 2,500 customers around the globe. The company secures automation through strong end-point management that consistently captures and monitors changes to configurations, programming, and project statuses of operational technology in manufacturing. In doing so, it closes the gap that still exists between operational technology systems and information technology systems. The advantage of this is that automated production is much more robustly secured and can be better controlled. \n\nTheir octoplant software solution succeeds in integrating different automation technologies - from PLCs to HMIs, CNCs, SCADA systems and robots - regardless of the manufacturer. It enables traceability of changes, compliance as well as transparency of security gaps, e.g. in the form of due software updates. This gives industrial companies a comprehensive overview of all automation backups and the current status of the plant. Management teams therefore have a better basis for decision-making to increase the reliability of production facilities, avoid or at least minimize production downtimes, and significantly increase manufacturing efficiency and cybersecurity.\n\nThe company was formed from the merger of AUVESY and US-based MDT Software.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/4iNb9kmi2bz1uYTcizjcAi/95e9405309617ac050cae0f3b764b48f/AMDT_logo.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/6jlXsJLelAWpCuAt9nsrxU/00c8d2e6ba16a7429cb2de60fc65ceff/MDT-1-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2bIStz1cKfdl9lIuhiYA7j/752f2091c45caddda1c454c18f072a0f/Auvesyweb-1024x512.png"
    ],
    "website": "https://amdt.com/en/",
    "linkedin": "https://www.linkedin.com/company/auvesy-gmbh/",
    "twitter": "https://twitter.com/AUVESY_MDT"
  },
  {
    "name": "Ascendia Gruppe",
    "link": "https://hgcapital.com/portfolio/ascendia-gruppe",
    "summary": "Ascendia Gruppe is an association of leading private line insurance brokers, MGAs, and financial advisors focusing on private customers and small businesses.",
    "logo": "",
    "description": "Ascendia Gruppe is an association of leading private line insurance brokers, MGAs, and financial advisors focusing on private customers and small businesses, combining their strengths and shaping the insurance industry for the benefit of their customers. \n\nFounded in 2024 by Florian Brokamp, the best, long-term-oriented companies will be brought together and further developed in the coming years. ",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/Q2QDD2q8F502Qck9wDQig/8e189b2983dd405f247f62bf9f444301/Picture1_1.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1hhgZBho0QpokpuigAmEmp/2025676c3353336d177d956231f35453/Group_489.png"
    ],
    "website": "https://www.ascendia-gruppe.de/",
    "linkedin": "https://www.linkedin.com/company/ascendia-gruppe/",
    "twitter": ""
  },
  {
    "name": "Athletic Sport Sponsoring",
    "link": "https://hgcapital.com/portfolio/athletic-sport-sponsoring",
    "summary": "Athletics Sport Sponsoring is a leading B2C online platform for car and mobility subscriptions.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/1wQHhY2PvUkf9ISUrOfKeN/13ae83f425561af6019ff5999d0a0471/ass_ibda_logo_black_cyan.webp",
    "description": "Founded in 1997, Athletic Sport Sponsoring (ASS) is a flat-rate car subscription provider to members of closed user groups. ASS was acquired by MeinAuto Group in 2018, joining the Hg portfolio of companies. Following the partial sale of the MeinAuto and Mobility Concept Online Leasing business in 2024, Hg retained their ownership of ASS.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1wQHhY2PvUkf9ISUrOfKeN/13ae83f425561af6019ff5999d0a0471/ass_ibda_logo_black_cyan.webp"
    ],
    "website": "https://ichbindeinauto.de/",
    "linkedin": "https://www.linkedin.com/company/athleticsportsponsoring/",
    "twitter": ""
  },
  {
    "name": "AuditBoard",
    "link": "https://hgcapital.com/portfolio/auditboard",
    "summary": "AuditBoard is a leading connected risk platform transforming audit, risk, compliance and ESG management.",
    "logo": "",
    "description": "Founded in 2014, AuditBoard is a leading connected risk platform transforming audit, risk, compliance and ESG management.\n\nAuditBoard’s sets itself apart with a customer-centric approach and the potent combination of innovative technology and domain expertise. The company serves more than 2,000 enterprises, including nearly 50% of the Fortune 500.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/37Ik9JLDKRRitICEdrieft/ca0e2eb23da6e073b63c5fa1f0da891a/AuditBoard.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ZL2GgzXIbIE2C7bRNG1qg/20ac8a3ed7a63258401c16492a0d5c2f/Group_500.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3HvswBks8bvMDblRB5jst9/6c892e71b6e0cefa78442b88dfe2ceec/Business_insider_auditboard.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7hJsQNFlxYXxG87OOwNZxg/c61c615110a0fe631a8d65e47bf78a71/Group_264.jpg"
    ],
    "website": "http://www.auditboard.com",
    "linkedin": "https://www.linkedin.com/company/auditboard/",
    "twitter": ""
  },
  {
    "name": "Azets",
    "link": "https://hgcapital.com/portfolio/azets",
    "summary": "Azets is an international accounting, tax, audit, advisory and business services group.",
    "logo": "",
    "description": "Azets is an international accounting, tax, audit, advisory and business services group that delivers a personal experience, both digitally and in person. With an extensive Northern European office network, they help companies and organisations of all shapes and sizes, public sector enterprises and high net-worth private clients achieve their personal and business ambitions. Azets achieves this through its dedicated, collaborative and dynamic staff of over 9,000 people – blending a local presence with an international outlook. \n\nHg has been supporting the Azets team since 2016. In 2023, we welcomed PAI Partners as a like-minded shareholder for our next phase of growth. ",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1TFq4VtLccqOljEzciZzlI/3ac222dcc51dc3919babdfb765356c7b/Azets.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/358YLRrmbajqGkZlVjabxd/a99c688da32b4f5bf411eb64e88b599f/Azets.jpg"
    ],
    "website": "https://www.azets.co.uk/",
    "linkedin": "https://www.linkedin.com/company/azets/",
    "twitter": "https://twitter.com/AzetsUK"
  },
  {
    "name": "Benevity",
    "link": "https://hgcapital.com/portfolio/benevity",
    "summary": "Benevity has helped transform the non-profit sector with automation, aggregation and efficiency.",
    "logo": "",
    "description": "Benevity’s all-in-one, global platform enables purpose-driven brands to engage these stakeholders in supporting the causes and issues they care about through a database of nearly 2 million vetted non-profit organisations worldwide.\n\nThe Benevity platform has driven more than 34 million hours in volunteer time and talent, 275,000 positive actions, over one million grants and more than $6 billion in donations to date. Benevity’s 650 clients and their 19 million employees support issues ranging from food insecurity, human rights, diversity and inclusion, racial equity, mental health — and everything in between. Around half of the businesses named on the  – which recognizes “America’s Most JUST Companies” – use Benevity to power their corporate purpose programs.\n\nBenevity has helped transform the non-profit sector from manual processing, technological lag and fragmentation to automation, aggregation and efficiency. With 90% of all donation funds being sent electronically to non-profits, Benevity boasts the highest payment success rate in the industry, ensuring that more dollars reach those in need, more accurately and reliably than any other software provider.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/13q6RXKtfJ0LzpjRBPONIH/573c5b80e847ce29d64c93fbffa9de6a/Benevity.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/23II0ThxlOLEKDAwE9KWbP/3c212793ad36e5cbe7f9bc974bc94209/Hg_Buergenstock-002.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7w9aBNHPpFRGCAKCpThLYT/1a7c040c6417676dbf0be7e13f89ef2c/Benevity_web-1024x512.png"
    ],
    "website": "https://benevity.com/",
    "linkedin": "https://www.linkedin.com/company/benevity/",
    "twitter": "https://twitter.com/benevity"
  },
  {
    "name": "Blinqx",
    "link": "https://hgcapital.com/portfolio/blinqx",
    "summary": "Blinqx is a provider of mission-critical software to white-collar SMEs and corporates in the Benelux",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/1rJv9lvDHlScJ4gfKxBUrn/512e43083865e16e9cc065851f84ae23/Blinqx_logo_RGB_black.png",
    "description": "Founded in 2019, Blinqx is a provider of mission-critical software to professional service providers as well as HR and finance managers. Blinqx serves more than 100,000 users across 1,500 clients across the Netherlands and Belgium. \n\nHg partnered with the Blinqx founders in 2022 with the aim to support its ambition to build a leader in the Benelux, offering state-of-the-art modern software to help digitise customers across various end markets.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1rJv9lvDHlScJ4gfKxBUrn/512e43083865e16e9cc065851f84ae23/Blinqx_logo_RGB_black.png"
    ],
    "website": "https://blinqx.tech/",
    "linkedin": "https://www.linkedin.com/company/blinqx/",
    "twitter": ""
  },
  {
    "name": "Bright",
    "link": "https://hgcapital.com/portfolio/bright",
    "summary": "Bright develops innovative and intuitive accounting, practice management and payroll software to accounting firms and SMEs in the UK & Ireland.",
    "logo": "",
    "description": "Bright develops and delivers innovative and intuitive accounting, practice management and payroll software to accounting firms and SMEs in the UK & Ireland.\n\nWith a customer-centric approach to its offering, Bright has a core focus on streamlining processes for accountants and businesses, through software solutions that evolve with legislative changes and the needs of accounting firms and their clients. Bright’s software solutions are underpinned by world-class support their customers can rely on.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1aZITrvmBJYyv1uWdG1ESq/1398ea6e775ae8807e1326951ec06db8/Bright.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/41APxhanrwQIjBhT7gYeGV/f17232705a7204378b15283f35264c75/Untitled-design-45-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://brightsg.com/",
    "linkedin": "https://www.linkedin.com/company/brightsg/",
    "twitter": "https://twitter.com/brightsg_"
  },
  {
    "name": "Caseware",
    "link": "https://hgcapital.com/portfolio/caseware",
    "summary": "Caseware develops cutting-edge audit software solutions for accounting firms, corporations and governments.",
    "logo": "",
    "description": "Caseware is based in Toronto, Canada, and develops cutting-edge audit software solutions for accounting firms, corporations and governments. Caseware’s platforms – Working Papers and IDEA – aim to change the future of audit and audit analytics by adopting cloud technology as well as artificial intelligence and machine learning, enabling measurable returns on efficiency, quality and value, for customers and their clients.\n\nFor over 30 years Caseware has been a technology leader in the sector and has grown organically to over 500,000 users in 130 countries today, serving 16 different languages.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/58kCFpcNVR6htRExaAYPL7/e1212a2ac43e2dc1b89a7cad87e563b9/CaseWare.png"
    ],
    "website": "https://www.caseware.com/",
    "linkedin": "https://www.linkedin.com/company/caseware-international-inc/",
    "twitter": "https://twitter.com/Caseware"
  },
  {
    "name": "CINC Systems",
    "link": "https://hgcapital.com/portfolio/cinc-systems",
    "summary": "CINC Systems is one of the largest providers of software in the association management industry and an innovator behind accounting and banking integration.",
    "logo": "",
    "description": " Founded in 2005 by a banker as the industry's first SaaS offering, CINC systems now employs over 200 people with customers throughout the country.  In 2019, Spectrum Equity joined CINC and accelerated the company's growth. The accelerated growth is due to the continued innovation it provides through CINC, its core software platform, and TresRE, the banking and payments solution that underpins the success of real estate management software providers.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1bgLhol96la0joXVsd8PoB/93f53b1073d800dbac56b1fd027b4cb1/CINC.png"
    ],
    "website": "https://cincsystems.com/",
    "linkedin": "https://www.linkedin.com/company/cinc-systems-llc/",
    "twitter": ""
  },
  {
    "name": "CTAIMA",
    "link": "https://hgcapital.com/portfolio/ctaima",
    "summary": "CTAIMA is a leading provider of software and specialized services for contractor management, health & safety, and compliance.",
    "logo": "",
    "description": "CTAIMA is a leading provider of software and specialized services for contractor management, health & safety, and compliance. CTAIMA orchestrates one of the largest global networks of contractors and suppliers, seamlessly connecting over 100 thousand contractors and subcontractors with over a thousand clients worldwide.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/LOLspehQz0No2VGElzzXf/af297d9dc2d1fcdfd22b361b9a7746c5/CTAIMA.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ZL2GgzXIbIE2C7bRNG1qg/20ac8a3ed7a63258401c16492a0d5c2f/Group_500.png"
    ],
    "website": "https://www.ctaima.net/",
    "linkedin": "https://www.linkedin.com/company/ctaima-consulting/",
    "twitter": ""
  },
  {
    "name": "Cube Global",
    "link": "https://hgcapital.com/portfolio/cube-global",
    "summary": "Cube Global is a leading regulatory intelligence software and data provider.",
    "logo": "",
    "description": "Founded in 2011 in London, Cube Global is a regulatory intelligence software provider, primarily serving large financial institutions. The company’s software helps businesses to simplify the complexities of multi-jurisdictional regulatory compliance and change management, allowing them to stay compliant, limit potential fines and automate compliance workflows. \n\nIn 2024, Cube Global announced that it had secured a significant investment from Hg.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1iOMDtTimatV1uttAZvcxB/f18f51c37fb3ec85fd5f30cbb4d9d41c/CUBE-Logo.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ZL2GgzXIbIE2C7bRNG1qg/20ac8a3ed7a63258401c16492a0d5c2f/Group_500.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/LDGdhRVdvbDXAO7kOBgjQ/078abf58a05ec1b8d461e3d25e7f2785/Group_286.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1uFDvDSj2vr6PKc1fr6sDm/a161562a9c0c8f8fa3e26688a6bc8a22/Group_285.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2aWg7U4eXhJrzDRnUgS3zm/be2a05315e412711228085e622358724/Rectangle_176.png"
    ],
    "website": "https://cube.global/",
    "linkedin": "https://www.linkedin.com/company/cube-global/",
    "twitter": "https://twitter.com/CUBEGlobal"
  },
  {
    "name": "Empyrean Solutions",
    "link": "https://hgcapital.com/portfolio/empyrean-solutions",
    "summary": "Empyrean Solutions is a leading provider of risk and performance management solutions for banks and credit unions.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/MI0u1Uo9QnlmRjK37XyoJ/624ebedbaef86e4e212437cd54f8bfe5/logo-color.png",
    "description": "Empyrean Solutions is a leading provider of risk and performance management solutions for banks and credit unions. Empyrean’s software allows financial institutions of all sizes to take control of their balance sheet management, scenario planning, and risk/performance analysis in a single integrated software platform. Through their deployed software and outsource services, Empyrean works with banks and credit unions, ranging from $50 million to $200+ billion in assets.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/MI0u1Uo9QnlmRjK37XyoJ/624ebedbaef86e4e212437cd54f8bfe5/logo-color.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ZL2GgzXIbIE2C7bRNG1qg/20ac8a3ed7a63258401c16492a0d5c2f/Group_500.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/x3VhVqwd5vRrnjoS5CnkP/cb52abe8bce67e3a05662b1f02b2ad3a/Empyrean_insight_page_image.JPG"
    ],
    "website": "https://empyreansolutions.com/",
    "linkedin": "https://www.linkedin.com/company/empyrean-strategic-partners/",
    "twitter": ""
  },
  {
    "name": "FE fundinfo",
    "link": "https://hgcapital.com/portfolio/fe-fundinfo",
    "summary": "FE fundinfo facilitates more efficient investing across the globe through trusted, insightful information.",
    "logo": "",
    "description": "FE fundinfo is a leading provider of data, analytics software and infrastructure for the global funds industry, facilitating the distribution of retail funds and investment decision‑making by banks, asset and wealth managers. The business connects fund managers and fund distributors and enables them to share and act on trusted, insightful data.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/qveJF0ATmwqef9ioAySuG/e08b15ab69c2869e7da985883a027a9d/FEfundinfo.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://www.fefundinfo.com/",
    "linkedin": "https://www.linkedin.com/company/fefundinfo/",
    "twitter": "https://twitter.com/FEfundinfo"
  },
  {
    "name": "Focus Group",
    "link": "https://hgcapital.com/portfolio/focus-group",
    "summary": "Focus Group is one of the UK’s leading providers of essential business technology.",
    "logo": "",
    "description": "Focus Group, established in 2003, is one of the UK’s leading providers of essential business technology. With its vision of connecting communities and creating opportunities in a place that people love to work, Focus Group deliver innovative technology solutions.\r\n\r\nWith a team of nearly 1000 experts who are passionate about what they do, Focus Group provide nearly 30,000 businesses with an extensive range of the latest technology solutions across Telecoms, IT, Cyber, Connectivity and Mobile.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1vEZM6qeLl661kOIWrH4MU/21f99045df331b7a6dc03d82da3a8e31/Focus.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ZL2GgzXIbIE2C7bRNG1qg/20ac8a3ed7a63258401c16492a0d5c2f/Group_500.png"
    ],
    "website": "https://focusgroup.co.uk/company/about-us/",
    "linkedin": "https://www.linkedin.com/company/focus-group-uk/",
    "twitter": "https://twitter.com/focusgrp_uk/"
  },
  {
    "name": "Fonds Finanz",
    "link": "https://hgcapital.com/portfolio/fonds-finanz",
    "summary": "Fonds Finanz is a leading tech-enabled financial intermediary pool focused on the German insurance sector.",
    "logo": "",
    "description": "Fonds Finanz is a leading tech-enabled financial intermediary pool focused on the German insurance sector.\n\nFounded in 1996 and headquartered in Munich, Fonds Finanz serves more than 28,000 customers including brokers, distributors, insureTechs and banks across Germany. With a comprehensive software, advisory and service offering, Fonds Finanz gives customers access to a full-service platform, comprising products from more than 500 insurance and financial product vendors in Life, Health, Property & Casualty and Investment funds.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/4UN4k0kieQozW8goZu9UWv/1ed1232581b652ac9a21ec50048ef687/Fonds_Finanz.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1v0ZczIdq4Vzuvc60NtMiW/9b657a59ea607abf89e9a5ac95dab9c0/Untitled-design-68-1024x512.png"
    ],
    "website": "https://www.fondsfinanz.de/",
    "linkedin": "https://www.linkedin.com/company/fonds-finanz-maklerservice-gmbh/",
    "twitter": "https://twitter.com/fonds_finanz_"
  },
  {
    "name": "Gen II",
    "link": "https://hgcapital.com/portfolio/gen-ii",
    "summary": "Gen II is a leading pure-play provider of alternative asset fund administration services.",
    "logo": "",
    "description": "Led by its three original co-founders – Steven Millner, Steven Alecia and Norman Leben – since 2009, Gen II is a leading pure-play provider of alternative asset fund administration services.  With headquarters in New York and Luxembourg and serving a global client base, the company administers over $375 billion of private capital on behalf of its clients across more than 500 funds and their 25,000 investors, spanning various investment strategies including Buyout, Infrastructure, Energy, Real Estate, Fund of Funds, Credit, and Retail. \n\nGen II is differentiated by providing a leading, tech-enabled platform offering a high-touch, premium service to its clients in fund administration, accounting, reporting and regulatory compliance. Mr. Millner, Mr. Alecia and Mr. Leben have built a strong team providing an industry-leading experience to the Firm’s clients, which has led to consistent, uninterrupted double-digit organic growth over the last 10 years. \n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/3qlqGfhtthDiR5mon8ftq7/fa109e7cf374551dea64a4335811b78d/GenII.png"
    ],
    "website": "https://gen2fund.com/",
    "linkedin": "https://www.linkedin.com/company/gen-ii-fund-services-llc/",
    "twitter": "https://twitter.com/GenIIFund"
  },
  {
    "name": "Geomatikk",
    "link": "https://hgcapital.com/portfolio/Geomatikk",
    "summary": "Geomatikk is a leading tech-enabled services provider managing critical “check-before-you-dig” requests.",
    "logo": "",
    "description": "Founded in 2005, Geomatikk is a leading tech-enabled services provider managing critical “check-before-you-dig” requests in Norway, Sweden and Finland. The core product is a comprehensive mapping of all underground infrastructure in the countries it operates, which underpins an end-to-end technology platform that manages these pre-dig checks and complementary workflows such as site inspection, damage resolution and network monitoring. Geomatikk has become a one-stop source of truth for underground cable management serving network owners and the construction industry across the Nordic region.\n\nGeomatikk is protecting the infrastructure for more than 300 network owners, handling 2 million transactions and more than 250,000 physical field detections annually. Network owners, municipalities, contractors, civil works designers and other stakeholders collaborate and interact on the Geomatikk digital platform to optimize their construction projects and minimize asset strikes.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/5HpmNaZFKJY2zWmzDdwSjQ/b65736d2f9d3256543e771d46c3fb560/Geomatikk.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7MDAgMweKd3crX5JEGJ3XW/dc683471b44223b0a3432944241f904c/Geomatikk-web-1024x512.png"
    ],
    "website": "https://geomatikk.com/",
    "linkedin": "https://www.linkedin.com/company/geomatikk-as/",
    "twitter": ""
  },
  {
    "name": "GGW Group",
    "link": "https://hgcapital.com/portfolio/ggw-group",
    "summary": "GGW Group is a leading European P&C insurance broker and MGA group serving SME customers",
    "logo": "",
    "description": "GGW Group is a leading European P&C insurance broker and MGA group serving SME customers.\n\nThe Group has driven a best-in-class insurance brokerage and MGA platform in Germany over the last four years. Today, more than 60 brokerage companies and MGAs are operating under the roof of GGW Group, advising small and medium-size enterprises in Europe, and employing more than 1,700 people.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/2RHAKNohejxHBmuiZiW0Oh/b69a4deee6f1441a5fbd40fb500fbc73/GGW_Group_Logo_RGB.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/749XegpbHcqRnrJtnctVqQ/9cff72051b35ef4ea008f3912fef52e7/Insurance_1920X800_V1-4__1___1_.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/6J7o73gLgPhBr0Z7Hxm1vz/2e5f5ccd74cf29c09d021ce73ad02725/Group_291.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/78HFcLmqYtl7dcceXCh2oq/6950b622e454b9e8a260b68006eaea51/GGW_Group_Close.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1R0Ht55eSMPhayeOnfaWM7/59c8218f02e50cfc78ff509e37648c4e/MicrosoftTeams-image__33_.png"
    ],
    "website": "https://www.ggwgroup.de/",
    "linkedin": "https://www.linkedin.com/company/gossler-gobert-&-wolters-gruppe/",
    "twitter": ""
  },
  {
    "name": "Group Induver",
    "link": "https://hgcapital.com/portfolio/group-induver",
    "summary": "Group Induver is a leading commercial insurance broker in Belgium",
    "logo": "",
    "description": "Group Induver is a leading commercial insurance broker in Belgium, with presence across the country and strong niches in Trade & Credit, Wealth, Transportation and Employee Benefits. \n\nThe group counts more than €400m gross written premium and more than 400 employees.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/4Mx0qDPhmllhn3tiVA9rsH/a3098d24d3f1dd923689f4137f5eea5f/Induver_new.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ZL2GgzXIbIE2C7bRNG1qg/20ac8a3ed7a63258401c16492a0d5c2f/Group_500.png"
    ],
    "website": "https://www.groupinduver.be/nl",
    "linkedin": "https://www.linkedin.com/company/induver-insurance-partners/?originalSubdomain=be",
    "twitter": ""
  },
  {
    "name": "GTreasury",
    "link": "https://hgcapital.com/portfolio/gtreasury",
    "summary": "GTreasury is a global leader in treasury management systems for organisations worldwide.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/32PqkChcgc7WVRBxniK7P8/955c130a7a05ab59d3614299c6501a70/GTreasury_New_logo.png",
    "description": "GTreasury believes there is opportunity in complexity. By simplifying complexity, teams can unleash their organisation’s potential to gain strategic advantages and grow. GTreasury helps organisations reach that potential by connecting treasury and digital finance operations through a world-class SaaS treasury and risk management platform and integrated ecosystem where cash, debt, investments, and exposures are seamlessly managed within the office of the CFO. GTreasury delivers intelligent insights, while connecting financial value chains and extending workflows to third-party systems, exchanges, portals, and services.\n\nHeadquartered in Chicago, with locations serving EMEA (London) and APAC (Sydney and Manila), GTreasury’s global community includes more than 700 customers and 30+ industries reaching 160+ countries worldwide.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/32PqkChcgc7WVRBxniK7P8/955c130a7a05ab59d3614299c6501a70/GTreasury_New_logo.png"
    ],
    "website": "https://gtreasury.com/",
    "linkedin": "https://www.linkedin.com/company/gtreasury/",
    "twitter": "https://twitter.com/GTreasury"
  },
  {
    "name": "HHAeXchange",
    "link": "https://hgcapital.com/portfolio/HHAeXchange",
    "summary": "HHAeXchange provides homecare management solutions for payers, providers, and state Medicaid agencies.",
    "logo": "",
    "description": "HHAeXchange is the leading provider of homecare management solutions for payers, providers, and state Medicaid agencies. \n\nFounded in 2008, HHAX offers a comprehensive software as a service platform to its customers that improves patient outcomes, drives operational efficiency and increases compliance across the homecare ecosystem. Its solutions are delivered through subscription-based enterprise and mobile tools and facilitate over 125 million annual visits for 650,000 caregivers across more than 44 states.\n\nToday, HHAX has global offices across North America, Europe, and Asia.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/3pCoJzasnFXum9JZvmz31o/886f9b3eb3162a41b316b80867cc82fe/HHAeXchange.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3keNOl917Yy0xGlUW5cHlH/d5074c0f54496af7ff0feca2cfb027f0/HCIT-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/6shjKfIRFJ53yc4u6u1GaR/119ec1844563c2b7a2ef7e13c4b40bc9/Untitled-design-44-1024x512.png"
    ],
    "website": "https://hhaexchange.com/",
    "linkedin": "https://www.linkedin.com/company/hhaexchange/",
    "twitter": "https://twitter.com/HHAeXchange"
  },
  {
    "name": "Howden Group Holdings",
    "link": "https://hgcapital.com/portfolio/howden-group-holdings",
    "summary": "Howden is a leading international insurance distribution group.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/6bIjUFMyBKlic84kWHaG6q/13b1dcdd53e600fc095637d06da005c9/Howden_logo_BLACK.png",
    "description": "Founded in 1994 and headquartered in London, UK, Howden is a global insurance group made up of talented experts that can rise to any challenge. Howden is a tech‑enabled insurance distributor, which facilitates the provision of B2B insurance through its core activities of retail insurance broking, speciality and reinsurance broking and managed agency underwriting.\n\nHowden’s broking arm acquired A-Plan Group from Hg. Hg helped to drive a focus on embedding data and technology in A-Plan Group’s best-in-class service model over its investment period.\n\n \n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/6bIjUFMyBKlic84kWHaG6q/13b1dcdd53e600fc095637d06da005c9/Howden_logo_BLACK.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/749XegpbHcqRnrJtnctVqQ/9cff72051b35ef4ea008f3912fef52e7/Insurance_1920X800_V1-4__1___1_.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5oJQJrFeLc74z8iNmQN5lU/26be0864f35f1997f0ae8bc0082bcd79/Elliot_Richardson.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7iawgjbTZB5lSxF7T2iu5b/a9fb4f4ed30aa213bb188cc23c20e2f0/Howden_TigerRisk.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5l3PWNbGQvWwkWkocOf7o5/3d35d834edb05b4971e29adc9d7d44c8/image.png"
    ],
    "website": "https://www.howdengroupholdings.com/",
    "linkedin": "https://www.linkedin.com/company/howden-group-holdings/",
    "twitter": ""
  },
  {
    "name": "Ideagen",
    "link": "https://hgcapital.com/portfolio/ideagen",
    "summary": "Ideagen provide software and services to organisations operating within highly regulated industries.",
    "logo": "",
    "description": "Founded in 1993 and headquartered in Nottingham, UK, Ideagen’s software helps companies comply with regulation, manage risk and keep people safe. It is a leader in the over $30 billion regulatory and compliance software sector, serving highly regulated industries such as life sciences, healthcare, banking and finance and insurance. Ideagen has a global footprint with hubs across UK, US, Middle East, Australia and Southeast Asia, and its wide portfolio of solutions, including ProcessMAP, are used by over 10,000 customers globally.\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/6SAN4g6Yjcby491xMcwwwr/e6fd9d86cfdc514b586384975814c3c6/IdeagenLogo.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7wpZQPuxTiuRMx29RNIqLc/5c2747be23d908b5773fd4b65f041875/Rectangle_180.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/57zYZs1yjCH409LuQzHgCc/630d555a13de61b69a40a716c7b5b835/Ideagen_ProcessMap.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2aYgk0MCuL6Y9f494U3oz9/d6a5d088947297683c4a03c58c6b3d48/Ideagen.jpg"
    ],
    "website": "https://www.ideagen.com/",
    "linkedin": "https://www.linkedin.com/company/ideagen-plc/",
    "twitter": "https://twitter.com/Ideagen_"
  },
  {
    "name": "IFS",
    "link": "https://hgcapital.com/portfolio/IFS",
    "summary": "IFS is the software vendor for organisations who want to differentiate on service.",
    "logo": "",
    "description": "IFS is a leading provider across multiple sectors including Service Management, Enterprise Asset Management (EAM) and Enterprise Resource Planning (ERP) for five core asset-intensive verticals. WorkWave is a leading provider of Field Service Management solutions to appointment-centric verticals, primarily in North America.\n\nIFS and WorkWave’s suite of products empower service-oriented companies in its target verticals to reach their full potential through scalable, cloud-based software solutions that support every stage of a business life cycle, including marketing, sales, service delivery, customer interaction and financial transactions.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/4P0IB3U4fnjbTV9sDqyg8g/220c960dc50dd567b4bbecd10e243abc/IFS.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7oVcI3FxBw5YlXKxbK5b1u/0d06fc1ac1311c856d7cac0e224548fe/IFS_announcement_insight_oage.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/76f9qDKrGAyhZajjutddWv/b8015acef086c65689abbac956e7d372/Darren_pod_new.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/c1orwkmu58yrZK24ipH7y/4c66e62a9cbad341f83203d87b558d83/IFS.jpg"
    ],
    "website": "http://www.ifs.com/",
    "linkedin": "https://www.linkedin.com/company/ifs/",
    "twitter": "https://twitter.com/IFS"
  },
  {
    "name": "insightsoftware",
    "link": "https://hgcapital.com/portfolio/insightsoftware",
    "summary": "insightsoftware provides financial reporting and EPM software to the 'Office of the CFO'.",
    "logo": "",
    "description": "insightsoftware is a leading provider of financial reporting, analytics and performance management software. Formed in 2018, insightsoftware has built a suite of software products across financial reporting, budgeting and planning, close and consolidation, operations, tax, disclosure and equity management. Today, more than 32,000 customers worldwide rely on these products to provide them with increased productivity, visibility, accuracy and compliance across their organisations in real time.\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/6diCgxCT98jfRvo24vVf3P/c39796d380796399829f5ac97f2b3af0/Insightsoftware_new.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/6nBkkVIhXqvpFj2sKUHdtY/df9c72fb0b0cf44ceacc56afce80bb9f/IS-1024x512.png"
    ],
    "website": "https://insightsoftware.com/",
    "linkedin": "https://www.linkedin.com/company/outcomes-by-insightsoftware/",
    "twitter": "https://twitter.com/insightsoftware"
  },
  {
    "name": "Intelerad",
    "link": "https://hgcapital.com/portfolio/Intelerad",
    "summary": "Intelerad is one of the leading providers of medical imaging software and services for the healthcare industry.",
    "logo": "",
    "description": "Founded in 1999, Intelerad is a leading global provider of enterprise workflow and medical imaging software solutions that enhance productivity and information accessibility for radiologists, enabling faster and more accurate diagnoses.\n\nHeadquartered in Montreal, Canada, Intelerad employs over 700 staff across the globe and serves a customer base of more than 1,500 healthcare organisations, including radiology groups, imaging centres, health systems and life science companies.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/56jJg50PQT18M3IuXneiLH/9b922467f8105b0e1d1ac5fbb9cc8254/Intelerad-Wordmark-Maroon.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2saK2ZtFzK7EbACKkHFEDM/b869040aff949ff4bc46a56e0e32a953/Intelerad2.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3keNOl917Yy0xGlUW5cHlH/d5074c0f54496af7ff0feca2cfb027f0/HCIT-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5udMWwmfWTxrHcE9BzCddM/105be8a0583f59fb31d8ad597112ebc2/Intelerad-3-1024x512.png"
    ],
    "website": "https://www.intelerad.com/",
    "linkedin": "https://www.linkedin.com/company/intelerad-medical-systems/",
    "twitter": "https://twitter.com/intelerad"
  },
  {
    "name": "IRIS",
    "link": "https://hgcapital.com/portfolio/iris",
    "summary": "IRIS' business-critical software & services liberate the time, talent & energy of UK businesses.",
    "logo": "",
    "description": "IRIS serves over 100,000 customers and three million users in the Accountancy, Education, HR and SME payroll/book-keeping segments, across both the UK and North America. The company delivers a suite of established and trusted software solutions which provide business critical systems of record with frequent regulatory and compliance driven updates. Accountants are increasingly the hub looking after their SME clients’ data and interfacing with governments on their behalf. IRIS enables accountants to deliver both regulatory compliance services and value-added ‘Client Accounting Services’ to improve SME’s planning and performance.\n\nHg has been an investor in IRIS since 2004, retaining a minority stake following its sale and merger with CSH in 2007, and becoming a majority investor again in 2011 when we separated the two businesses. IRIS is one of the earliest examples of our focus on business critical software firms operating in attractive, predictable end-markets. IRIS operates a business model with a high level of revenues coming from subscriptions, and high customer retention rates, driven by consistent regulatory updates and additional features as part of their subscription. The investment decision was based on our belief in continuing organic growth potential and acquisition-led consolidation opportunities in the sector.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/6p7K8ZA3UetYMVavtRZWI4/cbb85e8a66a3bac65cea3a28723e52e9/IRIS.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/6ZB1kCputBe9E4NRZO5uAC/3ae93c37c2b35b9a13b22245c9320d86/IrisxDext.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/6A0T0UyBPmqEfyOVDxhIrQ/82e344ffd256b7a1d3f885b1d2fa0815/ElonaPod.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2XUKzvVifWW4a4YqoomAXD/ef871ad2e209fd4b6fd5403f6171355d/Group_91_2.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2QxvA4GAzToESa0P2YctdE/667da0f65340bc8e44992b68556debb7/Elona-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://www.iris.co.uk/",
    "linkedin": "https://www.linkedin.com/company/iris-software-group/?originalSubdomain=uk",
    "twitter": "https://twitter.com/IRISSoftwareGrp"
  },
  {
    "name": "Ivalua",
    "link": "https://hgcapital.com/portfolio/ivalua",
    "summary": "Ivalua offers a modern, organically built and complete source-to-pay platform that is used by over 400 enterprises across the globe.",
    "logo": "",
    "description": "Ivalua is recognised as a leading provider of cloud-based, AI-powered Spend Management software. Their unified Source-to-Pay platform empowers businesses to effectively manage all categories of spend and all suppliers, increasing profitability, improving sustainability, lowering risk and boosting employee productivity. They are trusted by hundreds of the world’s most admired brands and recognized as a leader by Gartner and other analysts. ",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1QNQWc7uQirxtxB03pCYnM/108d52bffccd9381d05f7706eb2abee6/Ivalua.png"
    ],
    "website": "https://www.ivalua.com/",
    "linkedin": "https://www.linkedin.com/company/ivalua/",
    "twitter": "https://x.com/ivalua"
  },
  {
    "name": "JTL",
    "link": "https://hgcapital.com/portfolio/JTL",
    "summary": "Leading ERP software provider specialising in e-commerce enablement solutions for small and medium-sized businesses across Germany",
    "logo": "",
    "description": "Based in Hückelhoven, Germany, and co-founded in 2008 by two brothers, JTL provides ERP software solutions enabling businesses to sell products online and offline. This product suite is the backbone of a merchant’s operations and automates their mission-critical daily workflows, ranging from managing distribution channels, order entry and warehouse management, all the way to fulfillment. \n\nToday, JTL serves around 50,000 German SMBs with a vibrant and unique user community and achieves strong customer advocacy and retention rates. ",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/56Oga17CLR16kymTgvyLSe/68928a8312e09d69cc2087ba508a1c47/jtl-dark-rgb.png"
    ],
    "website": "https://www.jtl-software.de/",
    "linkedin": "https://de.linkedin.com/company/jtl-software",
    "twitter": "https://twitter.com/jtlsoftware"
  },
  {
    "name": "Litera",
    "link": "https://hgcapital.com/portfolio/litera",
    "summary": "Over 2.3 million legal professionals and 98% of the Am Law 100 amplify their impact with Litera's legal technology and AI solutions.",
    "logo": "",
    "description": "Litera has been at the forefront of legal technology innovation for over 25 years, crafting legal software to amplify impact and maximize efficiency. Developed by the best legal minds in the industry, Litera's comprehensive suite of integrated legal tools is both powerful and user-friendly and simplifies the way modern firms manage core legal workflows, secure collaboration, and organize firm knowledge and experience. Every day, Litera helps more than 2.3 million legal professionals focus on their craft.\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/7pLUHezOMrUCd23vhhepFi/ffd755c7813b85a146405e13694f6047/Litera.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1IgyJW0MVYB7dAnRJkENlj/0fb675ae5f98caa8622911e681e67f0d/Thumbail.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1HhbpAKHIIaeiM1X2n4hJE/98e3b1cc0508d10c20835630e1b8e043/Picture1.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1vgfABhw3OUdk6QmXRmF6r/7e65bc631400ab3221c8315cc4719ada/Untitled-design-64-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/4A5bcAIvT2vfRm3NEhlle0/1fcff25d97620c5c2d4cb247582fe069/Litera-1024x512.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3Mwo8QzEdex9in9WBkOFOh/f700172ac2b51a657a831ed436774b89/litera-1024x512.png"
    ],
    "website": "https://www.litera.com/",
    "linkedin": "https://www.linkedin.com/company/literamicrosystems/",
    "twitter": "https://twitter.com/LiteraMicro"
  },
  {
    "name": "LucaNet",
    "link": "https://hgcapital.com/portfolio/lucanet",
    "summary": "LucaNet is a leading provider of end-to-end CPM software solutions simplifying data management, reporting & compliance for finance teams worldwide.",
    "logo": "",
    "description": "LucaNet is a leading provider of end-to-end CPM software solutions simplifying data management, reporting & compliance for finance teams worldwide.\n\nFounded in 1999, LucaNet began with a vision to create a one-stop-shop software solution, bringing together financial control, planning and consolidation. Since then, the company has evolved into a leader in its core segment – the Office of the CFO for mid-sized companies – globally. With a loyal customer base of more than 3,500 organizations in over 50 countries, offices in China, Singapore and the Americas as well as a strong European base, LucaNet employs around 500 people worldwide.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/2EoFoJlP2lM8f7TKzgibjX/7570d25702cab02ad90d026380069729/LucaNet.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3znjfe5b06lQntaMrDGTGa/7463a50f0e37641fbe17ba4aaa6632cb/Lucanet.jpg"
    ],
    "website": "https://www.lucanet.com/",
    "linkedin": "https://www.linkedin.com/company/lucanet-ag/",
    "twitter": ""
  },
  {
    "name": "Mitratech",
    "link": "https://hgcapital.com/portfolio/mitratech",
    "summary": "Mitratech provides Enterprise Legal Management and Compliance software to >1,000 corporate customers across the US & Europe",
    "logo": "",
    "description": "Mitratech provides Enterprise Legal Management and Compliance software to over 1,000 corporate customers across the US and Europe, including over 40% of the Fortune 500.\n\nHg partnered with Mitratech in 2017 to support management’s ambitious plans for further international expansion and entry into adjacent product categories, becoming the leading vendor of solutions to the General Counsel and Chief Compliance Officers of the world’s largest corporations.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/11wp3mg3HtUMsRA63ePtsp/960df4a9e2b9eeaf4103ecb6c2d0faf9/Mitratech.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/63hTV1JVLL5qVV4mxN4Ma1/125065de6e035d19b21b719b94893fd1/MItra-news-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://mitratech.com/en_gb/",
    "linkedin": "https://www.linkedin.com/company/mitratech/",
    "twitter": "https://twitter.com/mitratechlegal"
  },
  {
    "name": "MyUnisoft",
    "link": "https://hgcapital.com/portfolio/myunisoft",
    "summary": "MyUnisoft is a leader in digital transformation in the accounting profession.",
    "logo": "",
    "description": "Founded in 2018, MyUnisoft is a leader in digital transformation in the accounting profession. Its 100% collaborative, shared and Cloud platform simplifies the management of accounting, tax and financial missions, while strengthening collaboration between firms and their SME clients. MyUnisoft is also committed to the MyUnisoft Solidarity program, which supports education and micro-credit projects in French-speaking countries. ",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/6gzOsDWmNVfifFfujsQPNU/7644abcc470884353423348fef864b34/MYUNISOFT_LOGOS_RVB_04.png"
    ],
    "website": "https://myunisoft.fr/",
    "linkedin": "https://www.linkedin.com/company/myunisoft/",
    "twitter": ""
  },
  {
    "name": "Ncontracts",
    "link": "https://hgcapital.com/portfolio/ncontracts",
    "summary": "Ncontracts is a leading provider of integrated compliance, risk, and vendor management solutions to the financial services industry.",
    "logo": "",
    "description": "Ncontracts provides integrated risk, vendor and compliance management software to a rapidly expanding customer base of over 4,000 financial institutions, mortgage companies, and fintech companies in the United States. The company’s powerful combination of software and services enables financial institutions to achieve their risk management and compliance goals with an integrated, user-friendly cloud-based solution suite encompassing vendor, organizational, audit, and compliance risk management.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1c89fE7DrzOrU9FaLxs2NM/511d40801af6448efe2f1a199ff4aa55/NContracts_BLUE_PNG.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ZL2GgzXIbIE2C7bRNG1qg/20ac8a3ed7a63258401c16492a0d5c2f/Group_500.png"
    ],
    "website": "https://www.ncontracts.com/",
    "linkedin": "https://www.linkedin.com/company/ncontracts/",
    "twitter": "https://twitter.com/ncontracts"
  },
  {
    "name": "Nitrogen",
    "link": "https://hgcapital.com/portfolio/Nitrogen",
    "summary": "Nitrogen's risk-centric wealth management platform serves financial advisors, enterprises, and asset managers.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/1SmQZIJ9wVDurc0NbQIE2P/1129597d10889c9d1e1207d8d3047716/nitrogen-logo-full-color-rgb-538px_72ppi.png",
    "description": "Based in Auburn, California, and Atlanta, Georgia, Nitrogen is an industry-leading risk-centric wealth management platform serving financial advisors, enterprises, and asset managers. They are on a mission to empower the world to invest fearlessly.\n\nTheir client and portfolio risk technology is rapidly emerging as an industry standard for advisor, client and portfolio risk analytics across the US wealth management ecosystem.\n\nToday, Nitrogen's platform supports tens of thousands of financial advisors who use it to manage millions of client accounts with over $400 billion in assets.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1SmQZIJ9wVDurc0NbQIE2P/1129597d10889c9d1e1207d8d3047716/nitrogen-logo-full-color-rgb-538px_72ppi.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5ATcDb6DpjrwO6AvSRj5QF/b05e47211a4697dc8de5f86d3ba10e7c/Riskalyze_web.jpg"
    ],
    "website": "https://nitrogenwealth.com/",
    "linkedin": "https://www.linkedin.com/company/nitrogenwealth/",
    "twitter": "https://twitter.com/NitrogenWealth"
  },
  {
    "name": "Nomadia",
    "link": "https://hgcapital.com/portfolio/nomadia",
    "summary": "Nomadia’s mobile applications and SaaS solutions enable companies to plan and optimize their mobile workers’ travel and activity in real-time.",
    "logo": "",
    "description": "Headquartered in France, Nomadia’s mobile applications and SaaS solutions enable companies to plan and optimize their mobile workers’ travel and activity in real-time. Its solutions address the daily needs of mobile professionals such as technicians, sales representatives and delivery drivers. \n\nNomadia delivers tangible ROI to its clients including material productivity gains and can reduce CO2 emissions by up to 30%. It serves over 4,000 clients and more than 200,000 users across 92 countries.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/75BCKxRnYD89M7gVwqaGqi/5be03802012605b861f62f754449637c/Nomadia.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7l7iqLwMcDzltVYoJVZidc/8be97bdb551425bede535bf07d62782e/Hero-livreur-1.png"
    ],
    "website": "https://www.nomadia-group.com/",
    "linkedin": "https://www.linkedin.com/company/nomadia-group/",
    "twitter": "https://twitter.com/NomadiaGroup"
  },
  {
    "name": "Norstella",
    "link": "https://hgcapital.com/portfolio/norstella",
    "summary": "Norstella unites market-leading companies that all have a shared goal of improving patient access.",
    "logo": "",
    "description": "Norstella was formed following the merger of MMIT Evaluate and Pharma Intelligence (Citeline, previously part of Informa). Each of its brands (Evaluate, MMIT, Panalgo, The Dedham Group, Citeline) delivers must-have answers for critical strategic and commercial decision-making. By combining the efforts of each organization under Norstella, they can offer breadth of expertise, cutting-edge data solutions and expert advisory services alongside advanced technologies such as real-world data, machine learning and predictive analytics.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1MPioFEwjPFyku1WatayYV/e06dfaced67fada9a34595c3c9204958/Norstella_color_positive_RGB.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5IajO0ulu3kcQ22TdgwmAb/c656923d3f49c27d2c30166349bee968/Katrhin_podcats_thumbnail.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3Zakq6yfVvSHJkIj4P09M7/9cb7ebe92928f3a20361d9499bd13a8c/Norstella.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5QgDSwZzKaKsWRQNBvCwYd/d626c3134a2e6c1c2cd2038fea9752bd/Evaluate.0404.JPG",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://www.norstella.com/",
    "linkedin": "https://www.linkedin.com/company/norstellacompany/",
    "twitter": "https://twitter.com/NorstellaCo"
  },
  {
    "name": "P&I",
    "link": "https://hgcapital.com/portfolio/p-and-i",
    "summary": "P&I provides software for human resources management to the German and European Mittelstand",
    "logo": "",
    "description": "Founded in 1968, P&I is a leading provider of integrated software solutions for human resources management to the German and European Mittelstand. The business delivers payroll, Core HR. human capital management, time and attendance as well as analytics to 15,000 customers across DACH and 11 further European countries via an integrated and highly automated private cloud based platform.\n\nHg took P&I private via a public takeover offer in 2013, and re-invested into the business in 2016 alongside Permira.\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/3apAdpf7ymQ6RNLwTGLFa5/f7066e208fdececc86b43c3888ab5dee/P_I_Logo_ohne_Rahmen.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1JPe4OkRTv4CwhDCOZ5i1J/37c1f5426d8379187e57be98e61ea549/PI_insight_page.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2ovcDZhGavPNDWGVisErdF/0564be67397ff13f0cfdf7d1a716e348/BIG-DATA.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://www.pi-ag.com/",
    "linkedin": "https://www.linkedin.com/company/pi-ag/?originalSubdomain=uk",
    "twitter": ""
  },
  {
    "name": "Pirum",
    "link": "https://hgcapital.com/portfolio/pirum",
    "summary": "Pirum provides post-trade automation & collateral management technology for the global securities finance industry",
    "logo": "",
    "description": "Pirum was founded in 2000 to provide advanced, centralised and secure reconciliation services for financial market participants. Pirum’s software provides a secure processing hub which seamlessly links industry participants, allowing them to process and verify key transaction details electronically. This delivers significant trade and collateral efficiency, lowers costs and enhances regulatory compliance for its network of clients. Pirum’s products assist 90 of the most prestigious global financial institutions to process over $3 trillion of transactions daily.\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1g8oJfzEXdYPWQgQchZ9Eg/0ffa1182b3266d2f9fcbcd1d247a4a06/Pirum.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2Bheq8mA0bNe7LRUXF6qlh/d2d33957a32025e7b97053b23fed7415/PirumPod.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/4iIwvWEpvbkjkYCG7EJre7/d8ed1a70eb638ed58e02c2cfd59a0504/Pirum_web-1024x512.png"
    ],
    "website": "https://www.pirum.com/",
    "linkedin": "https://www.linkedin.com/company/pirum-systems-ltd/",
    "twitter": "https://twitter.com/pirumsystems"
  },
  {
    "name": "Prophix",
    "link": "https://hgcapital.com/portfolio/Prophix",
    "summary": "Prophix provides planning, budgeting and financial reporting software into the ‘office of the CFO’.",
    "logo": "https://images.ctfassets.net/vjxh3n2vfv4b/5qcq1JgVUa9qdTgZNEoQGF/435c523d2550272b3d642d28ac24016d/prophix-full-logo.svg",
    "description": "Founded in 1987 and based in Ontario, Canada, Prophix is a leading provider of CPM software serving mid-market companies across multiple industries worldwide, providing planning, budgeting and financial reporting software into the ‘office of the CFO’.\n\nProphix’s software allows organisations to improve their financial reporting capabilities, while also standardizing and streamlining the budgeting process to generate significant ROI through a faster time to close, reduction in budgeting errors and an ability to reforecast in a more agile way.\n\nProphix is a leader in its segment with over 1,600 customers, industry-leading retention rates and best-in-class customer NPS.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/5qcq1JgVUa9qdTgZNEoQGF/435c523d2550272b3d642d28ac24016d/prophix-full-logo.svg"
    ],
    "website": "https://www.prophix.com/",
    "linkedin": "https://www.linkedin.com/company/prophix-software/",
    "twitter": "https://twitter.com/prophix"
  },
  {
    "name": "Quantios",
    "link": "https://hgcapital.com/portfolio/Quantios",
    "summary": "Quantios is a leading technology provider to the global trust, corporate and fund services industry.",
    "logo": "",
    "description": "Quantios  provides entity management, client accounting, practice management, compliance and workflow software for trust, fund and corporate service providers around the world.\n\nOver the next phase of growth, Quantios aims to scale further as a global leader by accelerating the digitalisation of this segment, including with the roll-out of Quantios Online, a brand new, sector-leading and feature-rich SaaS offering that will revolutionise how customers operate in this industry.\n\nQuantios serves more than 360 customers and 26,000 users in over 30 jurisdictions, through eleven offices worldwide in key jurisdictions including Australia, Guernsey, Jersey, Luxembourg, Singapore, and the United Kingdom.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/5JeemhXKrPc8T9f8QBO6eK/28f9a9db3569ac02b523fe011f8b55c0/Quantios_Wordmark_RGB_Trust_Green.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3YQl3j7BJBgXsSOJRs3HFA/e342d01df1fc521b316e61df8b44abce/TrustQuay.png"
    ],
    "website": "https://quantios.com/",
    "linkedin": "https://www.linkedin.com/company/quantios/",
    "twitter": "https://x.com/QuantiosGlobal"
  },
  {
    "name": "Revalize",
    "link": "https://hgcapital.com/portfolio/Revalize",
    "summary": "Revalize is a worldwide leader in sector-specific revenue operations software for manufacturers, their distributors, and their specifiers.",
    "logo": "",
    "description": "Revalize is a worldwide leader in sector-specific revenue operations software for manufacturers, their distributors, and their specifiers.\n\nWith over 10,000 customers across North America and Europe, Revalize empowers manufacturers to elevate buying experiences, accelerate sales cycles, and streamline manufacturing through purpose-built software. The company offers a full suite of specialized, mission-critical software solutions built to simplify customer processes and reduce friction throughout the entire revenue operations cycle\n\n\n\n",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1IsTWAEo083dtyAjk27e06/8ac7cddb547e69a81ecceaec90be673d/Revalize.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5WMWqVLjF9EQwUvKhvcRSF/ecbc3484c8d071417d670812d3b2caac/Revalize-1024x512.png"
    ],
    "website": "https://revalizesoftware.com/",
    "linkedin": "https://www.linkedin.com/company/revalize/",
    "twitter": "https://twitter.com/revalize"
  },
  {
    "name": "Rhapsody",
    "link": "https://hgcapital.com/portfolio/Rhapsody",
    "summary": "Rhapsody partners with healthcare organizations around the globe delivering its adaptable Interoperability Suite to reliably connect, classify, and clean data.",
    "logo": "",
    "description": "Rhapsody partners with healthcare organizations around the globe delivering its adaptable Interoperability Suite to reliably connect, classify, and clean data. Rhapsody health solutions connect more than one million data endpoints across more than 1,700 healthcare organizations and over 3,000 applications. ",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/zfK1Gd17OGibX7XjEsDkB/06794ecba487006e3eab95554a089a87/Rhapsody.PNG",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3keNOl917Yy0xGlUW5cHlH/d5074c0f54496af7ff0feca2cfb027f0/HCIT-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/uAyYsgapx8y6nDYtrLI99/8114e0667dcdcca98ace1a0c53c75072/rhapsody-1024x512.png"
    ],
    "website": "https://rhapsody.health/",
    "linkedin": "https://www.linkedin.com/company/lyniate/",
    "twitter": "https://twitter.com/lyniate"
  },
  {
    "name": "Scopevisio",
    "link": "https://hgcapital.com/portfolio/scopevisio",
    "summary": "Scopevisio AG develops and operates a cloud-based business automation platform covering Finance, ERP, CRM, HCM, Payroll, POS, BI, and Organization.",
    "logo": "",
    "description": "Scopevisio AG develops and operates a cloud-based business automation platform covering Finance, ERP, CRM, HCM, Payroll, POS, BI, and Organization. Designed for mid-sized companies across various industries, it simplifies and automates business processes while enabling seamless cross-location and cross-departmental collaboration.\n\nHeadquartered in Bonn, Germany, Scopevisio employs over 300 people in Germany and Austria and serves more than 7,500 customers with its innovative solutions.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/1awpCHAgHT0rcdcyD69usr/fd735bd91e3326e6cda28eaf42dce993/Scopevisio.png"
    ],
    "website": "https://www.scopevisio.com/en-gb/",
    "linkedin": "https://www.linkedin.com/company/scopevisio-ag/?originalSubdomain=de",
    "twitter": ""
  },
  {
    "name": "Septeo",
    "link": "https://hgcapital.com/portfolio/septeo",
    "summary": "Septeo provides software solutions and IT services dedicated to legal, real estate and IT professionals.",
    "logo": "",
    "description": "Septeo is a leading provider of legal software for notaries, law firms, corporate legal and HR departments, bailiffs, real estate professionals and accountants in France, Belgium, Canada and the US. Constituting several complementary companies and founded in 1988, The Septeo Group now has over 22,000 clients and more than 150,000 users, served by over 2,400 employees.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/54NOTVGDi3LqSxbt70FsOK/adb8de17744c33c52844e854c0112131/Logo-septeo-2023-RGB_horiz-blue-orange.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7MjTEoH7geQgTGTwhMyw0S/d8a2e6958736b90e5f20b23c46109f1a/Group_492.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7DAaM1dIlAQex9UYU5uUhB/9f6c18277fbbbae62e7887a92587ba01/Group_449.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5mHzZfVBkFxlz9BU0hw7PT/f49a93119fbb2acb579a58f8f0960e7c/Septeo-1024x512.jpg"
    ],
    "website": "https://www.septeo.fr/",
    "linkedin": "https://www.linkedin.com/company/septeo/?trk=top_nav_home",
    "twitter": "https://twitter.com/SEPTEO_GROUPE"
  },
  {
    "name": "Serrala",
    "link": "https://hgcapital.com/portfolio/serrala",
    "summary": "Serrala enables the ‘Office of the CFO’ to automate and optimize all processes for corporate payments and cash management",
    "logo": "",
    "description": "Founded in 1984 and based in Hamburg, Germany, Serrala provides software solutions for financial automation and B2B payments to medium-sized to large Enterprise customers globally, with a strong footprint across Europe and the US.\n\nSerrala enables the ‘Office of the CFO’ to automate and optimize all processes for corporate payments and cash management to save costs, minimize fraud risks and gain real-time insights into their world of payments. It is a fast-growing company with global offices across North America, Europe and Asia and over 700 employees. Today, Serrala drives innovation for more than 2,800 customers including more than 100 of the S&P500 and around two thirds of companies listed in the DAX.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/21Jmhrv5Ec1D4oIWME8XhD/ff2c4d240ac69bf2cae27df0c873611f/Serrala.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2QUcZsQbJqhlTFuT48syBI/2fbe79d6ca1a3c8739528a74d3370837/Untitled-design-34-1024x512.png"
    ],
    "website": "https://www.serrala.com/",
    "linkedin": "https://www.linkedin.com/company/serrala/",
    "twitter": "https://twitter.com/WeAreSerrala"
  },
  {
    "name": "smartTrade Technologies",
    "link": "https://hgcapital.com/portfolio/smarttrade-technologies",
    "summary": "smartTrade’s liquidity management solutions enable financial institutions to develop and run high-performance trading platforms throughout the world.",
    "logo": "",
    "description": "smartTrade Technologies, pioneer of multi-asset electronic trading solutions, offers innovative technology allowing you to focus on your trading and grow your business while quickly adapting to changing market requirements. \n\nsmartTrade provides agile end-to-end trading solutions supporting Foreign Exchange, Fixed Income, Equities, Derivatives (including Options), Cryptocurrencies and Money Markets.  Our solutions offer connectivity to over 130 liquidity providers, aggregation, smart order routing, order management, pricing, distribution, risk management and fully customizable HTML5 user interface.\n\nsmartTrade works with a variety of clients ranging from banks, brokers and asset managers to corporate firms. LiquidityFX for Foreign Exchange and smartFI for Fixed Income are provided as a fully managed and hosted service, colocated in all the main marketplaces globally.\n\nsmartAnalytics, our multi-asset Big Data analysis solution, allows the creation of historical or real time dashboards and reports to interact more effectively with markets and end customers.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/5hE7uFlv07zzxFiudTPaVx/e83c999c06f869e85571e80eb5ba230c/SmartTrade.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/0D5uvqfXSGDMPsWih3ci5/c278e5fef2603cf1ecaf01440b7493ca/Group_681.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/6qdp9t77GuB8tWZvH0QWfv/f1a3a3b602238a7f4593978f7fc31545/SmartTrade-1024x512.png"
    ],
    "website": "https://smart-trade.net/",
    "linkedin": "https://www.linkedin.com/company/smart-trade-technologies/",
    "twitter": "https://twitter.com/smarttrade_tech"
  },
  {
    "name": "Sovos",
    "link": "https://hgcapital.com/portfolio/sovos",
    "summary": "Sovos' solutions manage all aspects of the tax compliance process, from tax calculation to secure funds transfer.",
    "logo": "",
    "description": "Sovos is a global provider of tax, compliance, and trust solutions and services that enable businesses to navigate an increasingly regulated world with true confidence. Purpose-built for always-on compliance capabilities, our scalable IT-driven solutions meet the demands of an evolving and complex global regulatory landscape. Sovos’ cloud-based software platform provides an unparalleled level of integration with business applications and government compliance processes.   \n\nMore than 100,000 customers in 70 countries - including half the Fortune 500 – trust Sovos for their compliance needs. Sovos annually processes more than three billion transactions across 19,000 global tax jurisdictions. Bolstered by a robust partner program more than 400 strong, Sovos brings to bear an unrivaled global network for companies across industries and geographies. Founded in 1979, Sovos has operations across the Americas and Europe, and is owned by Hg and TA Associates.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/55xaF5SMzms80JQSjeRC37/9f627f9193f3383e1bf23031ad2db258/Sovos-Logo.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1VWeu3YRTiWDtQ0vmNmun1/69d00d95946790bc80c2b466e7c1e4d7/orbit_default.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2FKm7DbdJm1LIK8oCL02IF/d12f82dc226dedafbfdb17e963defb7f/image.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7qsWsHAJNyr730Mb9kqoFX/a0921e8e0fb349c461230740f8d4c497/sovos-press-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://sovos.com/",
    "linkedin": "https://www.linkedin.com/company/sovos/",
    "twitter": "https://twitter.com/SovosCompliance"
  },
  {
    "name": "team.blue",
    "link": "https://hgcapital.com/portfolio/team-blue",
    "summary": "team.blue a leading digital enabler for companies and entrepreneurs across Europe.",
    "logo": "",
    "description": "team.blue was created in 2019 by the merger of Combell Group, TransIP and Register Group and offers digital presence and enablement tools such as domain hosting, email and other adjacent applications such as consent management to over 2.5 million SME, SoHo (‘small offices/home office) and developer customers across Europe.\n\nIn July, Hg announced a further investment in team.blue to fund expansion in its product offering of online solutions, as well as increase its local presence across more countries in Europe via M&A. Reflecting the impact of both continued organic growth and value-accretive M&A, the value of HGT’s investment in team.blue increased by £16.4 million in 2022.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/5Nk0h0OXE4OpEoqvYJre90/009e21ab32832f2c2501e9d8aa8ae285/team.blue-color-rgb.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/AZO1ytzpj2xXSZcwep3Us/b18b8b7cc062569b877eef401b23621f/Group_259.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1e5EfUrOFZro1dW0tMdC9D/41bfdd518b0f0583eec1427e9b1954e6/Group_260.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/8Ehfli505eramkBoKPC0B/c2c037013b8c59a95be336847b72fa1a/team.blue.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/9GPqHBd8a7XYSruhHLBMP/1e30c3f58ae658f744c4eaff86bc3d19/Group_325.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1LvPBXXiZ3UYgGptfYKz1B/fdaaf2433f6cb821588510e6c68de63f/bluenew-1024x512.png"
    ],
    "website": " https://team.blue/",
    "linkedin": "https://www.linkedin.com/company/teamblue/",
    "twitter": "https://twitter.com/teamdotblue"
  },
  {
    "name": "The Citation Group",
    "link": "https://hgcapital.com/portfolio/the-citation-group",
    "summary": "The Citation Group provides long-term, subscription-based Compliance and Quality services to SMEs in the UK and Australia.",
    "logo": "",
    "description": "The Citation Group provides long-term, subscription-based Compliance (HR/Employment Law, Health & Safety) and Quality (ISO certification, supplier verification) solutions to over 70,000 SMEs in the UK and Australia. In doing so, it helps SMEs navigate the critical and complex regulatory environment with which they need to comply through its proprietary ‘Atlas’ technology platform and by providing 24/7 advice from highly-skilled and qualified experts.\n\nHg partnered with Citation’s management team in 2016 to support continued rapid organic growth in its core business, whilst developing new adjacent compliance-related offerings it can provide into its customer base both organically and via M&A.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/7sHcBTNVs6bNbe5TGD7ilk/30bee3e0c11e036ca966d80b2e6d953c/the_citation_Group.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1Bn4WD7xnUlsp9B2Km3jHk/76ca8de4bc01ca566815a24c105e292b/image_50.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2dLkXuHaknfXiKZPUEPuHn/dacd5d5f59e30c6d1ac8f4b37ea6215c/Citation3-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/SRdgzXTX6TteDKKDZq7pg/452763e1e80cc337fb7eecbd86ac5bb3/Citation-news-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://thecitationgroup.com/",
    "linkedin": "https://www.linkedin.com/company/citationgroup/",
    "twitter": "https://twitter.com/CitationGroup"
  },
  {
    "name": "Trackunit",
    "link": "https://hgcapital.com/portfolio/trackunit",
    "summary": "Trackunit is a leading SaaS-based IoT solution and machine insights provider to the global construction equipment industry.",
    "logo": "",
    "description": "Trackunit is a leading SaaS-based IoT solution and machine insights provider to the global construction equipment industry. Trackunit collects and analyzes machine data in real-time to deliver actionable, proactive and predictive information, empowering customers with data-driven foresight.\n\nTrackunit promises to lead the technology engagement to help eliminate downtime. The ambition of this mission is not only to recover from budget and schedule overruns, but also to re-establish the reputation of the industry for innovation and leadership.\n\nFrom operator safety and machine health to business optimization, Trackunit’s industry-leading telematics software, hardware and fleet management services benefit the everyday operations of customers worldwide. Trackunit services its customers directly from its headquarters in Denmark and Chicago, IL and through subsidiaries in Sweden, Norway, France, Holland, Germany and England.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/5sNGe1szIjmqM375unaIcP/e164b1855a4d4f541a154c893ec2fbd1/TrackUnit.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/434runlcE1niwau1msrkoj/4b9cd7968a39cccfdb5350445fd40a13/Group_586__1_.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1IgyJW0MVYB7dAnRJkENlj/0fb675ae5f98caa8622911e681e67f0d/Thumbail.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5Utku58ITHQs3yzu8VAs3u/b6a7d74b8d7cd7f225f25bd7cc42d5a1/Group_329.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3OzVl9IgemO0gRY6stQjvd/912276da16b980acc44ed863ab7d3cdc/help-center-website-1024x482.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5spivv8qD6AklJPIzld55M/30796afa75d5475a59365fde4b2ddca8/help-center-website-1024x482.jpg"
    ],
    "website": "https://trackunit.com/",
    "linkedin": "https://www.linkedin.com/company/trackunit-a-s/",
    "twitter": "https://twitter.com/trackunit"
  },
  {
    "name": "Visma",
    "link": "https://hgcapital.com/portfolio/visma",
    "summary": "Visma is a leading provider of mission-critical business software to SMBs in Northern Europe.",
    "logo": "",
    "description": "Visma is a leading provider of mission-critical business software for a more efficient and resilient society. By simplifying and automating the work of companies and organisations of all sizes, Visma aims to improve people's everyday lives. Visma currently has 14,000 employees, over 1.4 million customers across the Nordics, Benelux, Central and Eastern Europe and Latin America, generating revenues of over EUR 2 billion.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/4e80jRCS8kjVmG3AkL7f4H/d8a81a78f4577943985f6df68080f573/Visma.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5EjUDpo6ERl2FRMInjoakB/6059f4ccf1f8e71a269199cc5695d5e9/Group_498.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/7bAbJPxjFtgBrq5H4lHmQd/a3d4b46b6573c34796711afe42938112/Orbit_41_Square.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1Kts1DbzMF1mRww9wZasSu/c727f0a249c5f53e23d79cee61d1c4a7/Group_271__1_.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/4cwzRR4oq1lOIObG8zizBA/a66496beec8b9abab2ebf19e7b879610/Rectangle_184.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5t3JhY6Lgy5UQvlBUEsXqd/65f81d97afcc7b33925ce147fecf13e0/MicrosoftTeams-image__45_.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3x2WFEgqlmnUKpmaxzfvOX/5220c9ca160f6f10857623a7f6277bc9/43060918-9CA0-4CCC-A8CB-B20CBA5FD5B7.jpeg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VceprphMyKbIqrh6FLxlv/1bea90c12288499a6d7f8e078a83aabd/iStock-1164502175.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3G0VPMOT0XguQNSO4sJLtz/a38b5eb802832682c26dc065fdb935d9/part_2.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2X0CxjQU0NTtENyELWn819/4fd47bd53ef51c75c9d16d1f3346091d/Part_1.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/1VWeu3YRTiWDtQ0vmNmun1/69d00d95946790bc80c2b466e7c1e4d7/orbit_default.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/2r4VSuzztApEPH9nO94aR4/cf551a5967b5168fb3934f21aa302a54/Visma_Building01.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3d4cz4AgrEf3Y7o7p6qCzm/2e13d70345fbd2e152238e9ce1027b59/clh_visma_15.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/3XYKuAu5auxvrIGOYLtum3/4f452aeb51ef8422ac7f2d69b55b4503/visma-software-office-22.jpg",
      "https://images.ctfassets.net/vjxh3n2vfv4b/5RFixav9oMH3yZ3iSNtGJf/785e898221fead27c02c5f357641376d/Visma-1-1024x512.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/F4cNZXwUK1Eyx8gLrGkRe/b35e8a86eb61b8d854fdaf92569a08f6/Visma-1-1024x512__1_.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/VsXNoIIzYTpSB4Z7ApQyr/04f67930878ee8dabc5decd5e4025f78/New_website_News_article_default_images.png"
    ],
    "website": "https://www.visma.com/",
    "linkedin": "https://www.linkedin.com/company/visma/",
    "twitter": "https://twitter.com/visma"
  },
  {
    "name": "Waystone",
    "link": "https://hgcapital.com/portfolio/waystone",
    "summary": "Waystone delivers the tools and expertise to manage their clients' governance and regulatory requirements.",
    "logo": "",
    "description": "Founded in 2000 and based in Dublin, Waystone serves clients with assets under management totalling more than $1 trillion, delivering the tools and expertise to manage their governance and regulatory requirements, enabling them to focus on their core business.\n\nIt has achieved global scale through a series of carefully planned acquisitions, and today provides an extensive range of services and solutions across multiple international jurisdictions.",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/5fh7GjXuekil9S2ghSWUBI/c8439fc24d12b67ec886ea809880b9b2/Waystone.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/47NoSomMbF4kw8niGP6pdY/84ef5ddb2184def81a8894ac63010d48/Waystone.jpg"
    ],
    "website": "https://www.waystone.com/",
    "linkedin": "https://www.linkedin.com/company/waystoneglobal/",
    "twitter": ""
  },
  {
    "name": "Workwave",
    "link": "https://hgcapital.com/portfolio/workwave",
    "summary": "WorkWave solutions empower companies to reach their full potential through scalable, cloud-based software supporting every stage of a business life cycle.",
    "logo": "",
    "description": "For nearly 40 years, WorkWave has been building best practices into its leading field service and last mile software solutions to allow best-in-class companies to grow their business, service their customers and maximize their money.\n\nIts solutions empower service-oriented companies to reach their full potential through scalable, cloud-based software solutions that support every stage of a business life cycle, including marketing, sales, service delivery, customer interaction and financial transactions.\n\nWorkWave is a trusted partner for thousands of customers across a wide variety of industries, including pest control, lawn care, cleaning, security, HVAC, plumbing and electrical, and last mile delivery. WorkWave’s award-winning culture and solutions have been recognized in the SaaS Awards, the Cloud Awards, the American Business Awards, the NJBIZ Best Places to Work Awards, and the Stevie Awards for Great Employers. ",
    "additionalImages": [
      "https://images.ctfassets.net/vjxh3n2vfv4b/53Iu15Zwu7DDxvWHVwAjeJ/f248cf04add52f7bc24790bce57e4f22/WorkWave_IFS.png",
      "https://images.ctfassets.net/vjxh3n2vfv4b/c1orwkmu58yrZK24ipH7y/4c66e62a9cbad341f83203d87b558d83/IFS.jpg"
    ],
    "website": "https://www.workwave.com/",
    "linkedin": "https://www.linkedin.com/company/workwave/",
    "twitter": "https://twitter.com/Workwave"
  }
]