[
  {
    "title": "ACIS",
    "category": "Technology",
    "description": "Traffic and transport information system",
    "url": "https://www.inflexion.com/portfolio/acis",
    "img": "https://www.inflexion.com/media/sbgmbdwu/acis-400x400.png?width=526&height=422&v=133586225618030000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Apr 2005 - Nov 2006",
    "headquarters": "Buckinghamshire, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "We had a rewarding relationship with Inflexion over our 18 months together and found their financial backing and strategic input invaluable during that period, which was reflected in the company’s strong revenue and earnings growth achievements.",
    "quoteAuthor": "Ian Buckley",
    "aboutText": "About\n\nIn 2005 Inflexion led the buyout of real-time passenger information systems ACIS.\n\nProfits doubled rapidly as ACIS expanded into France, the Netherlands and the Middle East. Its sale to the Carlyle Group generated a 3.3x return on investment.",
    "valueAcceleration": "Value acceleration \n\nThe buyout of family-run ACIS (Advanced Communications and Information Systems) in 2005 was followed by its acquisition of Tandata Systems, a business sourced by Inflexion which opened up new complementary markets in Europe and the Middle East. \n\nThe company’s employee numbers grew 27% during the 19-month partnership, and ACIS featured in The Sunday Times’ Tech Track 100 for three consecutive years. The company doubled profits ahead of schedule, allowing Inflexion and management to consider an exit sooner than anticipated. The sale to Carlyle Group in 2006 generated an IRR of 100%.",
    "stats": [
      {
        "label": "profit increase",
        "value": "2x"
      },
      {
        "label": "Headcount growth",
        "value": "27%"
      }
    ]
  },
  {
    "title": "Acorn Group",
    "category": "Financial Services",
    "description": "Specialist motor insurance",
    "url": "https://www.inflexion.com/portfolio/acorn-group",
    "img": "https://www.inflexion.com/media/zznoxh2x/website-logo-acorn.png?cc=0.16142451994050494,0,0.08938698223940565,0.00023691068467193255&width=526&height=422&v=133644793339530000&format=webp",
    "status": "Status: Current",
    "sector": "Financial Services",
    "investmentPeriod": "Dec 2018",
    "headquarters": "Liverpool, UK",
    "contacts": [
      "Chris Wright",
      "Andreas Constantinides",
      "Chris Wright",
      "Andreas Constantinides"
    ],
    "quote": "Our partnership with Inflexion has been critical in enabling us to expand and diversify our market presence. With their support we have more than doubled in size and become the UK’s leading specialist motor insurance business.",
    "quoteAuthor": "Mike Lloyd",
    "aboutText": "About \n\nInflexion has been helping specialist motor insurance business Acorn Group (formally Granite Underwriting) grow market share organically and through M&A since 2018. \n\nLiverpool-based Acorn Group comprises a number of brands which distribute specialist motor insurance, with a market-leading position in specialist vehicle insurance for private car and light commercial vehicles. Acorn’s core strength is its data-driven business model, combined with control of the full value chain through underwriting, distribution, claims handling, premium finance, investment management and vehicle hire.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s industry expertise and experience in digital innovation are helping Acorn to grow market share and increase efficiency organically and through selective M&A to help to broaden Acorn’s offering. Inflexion’s international experts are helping it to achieve cost savings through a presence in India, while the data team is helping to implement machine learning for efficiencies.",
    "stats": []
  },
  {
    "title": "AE Live",
    "category": "Technology",
    "description": "Data driven graphics",
    "url": "https://www.inflexion.com/portfolio/ae-live",
    "img": "https://www.inflexion.com/media/h15hfhvo/aelivev1.png?width=526&height=422&v=133845406402570000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Dec 2017",
    "headquarters": "Hertfordshire, UK",
    "contacts": [
      "Andrew Mainwaring",
      "Richard Wootten",
      "Liam Carmody",
      "Andrew Mainwaring",
      "Richard Wootten",
      "Liam Carmody"
    ],
    "quote": "Having someone in Latin America and China who can set up meetings before your arrival makes a big difference. Before Inflexion, international expansion would have been a daunting prospect.",
    "quoteAuthor": "Nick Baily",
    "aboutText": "About \n\nAE Live (formally Alston Elliot) provides premium data-driven graphics solutions for live sports broadcasts. Inflexion backed the buyout of AE Live in 2017. \n\nLive sport is uniquely appealing to broadcasters and advertisers as many other programmes have moved to catch-up streaming. New technologies are powering the rapid growth of sports viewing through mobile devices, and the business employs over 250 people in London, Johannesburg, New Delhi and Melbourne. Clients include Sky, BBC, ESPN and FIFA.",
    "valueAcceleration": "Value acceleration \n\nAE Live has grown strongly in international markets, with Inflexion providing support in Asia and the US. In the US, the business has established an office and is in commercial discussions with national broadcasters. AE Live acquired APAC based Ignite, which significantly expands the presence in the region and brings additional service offerings. It has also focused on its US expansion, and recently acquired Silver Spoon to bring additional AR services capabilities, alongside its graphic rendering technology, to its US client base having recently successfully done the augmented reality work for the Super Bowl.  \n\nInflexion’s in-house digital team is helping management as it develops its software to improve the quality of its offering, while our talent team has helped to build out the leadership team.",
    "stats": []
  },
  {
    "title": "Alcumus",
    "category": "Business Services",
    "description": "Risk management",
    "url": "https://www.inflexion.com/portfolio/alcumus",
    "img": "https://www.inflexion.com/media/xy5cymhr/alcumus-logo-400x400.png?width=526&height=422&v=133631193629200000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "May 2022",
    "headquarters": "Cardiff, UK",
    "contacts": [
      "Edward Taylor",
      "Edward Taylor"
    ],
    "quote": "The solutions Alcumus provide are trusted around the world. Our past work with Inflexion was extremely successful and we look forward to continuing to work together.",
    "quoteAuthor": "Alyn Franklin",
    "aboutText": "About \n\nInflexion backed the buyout of Alcumus in 2015 before selling it for over £600m to Apax in 2022 to generate a 5.9x return. Inflexion subsequently made a minority re-investment. \n\nAlcumus is a global market leader in technology-led risk management and compliance solutions that allow seamless interactions between enterprises and their contractors and suppliers. Its technology-enabled offering is critical to worker protection and compliance with regulations and international standards.",
    "valueAcceleration": "Value acceleration \n\nUnder Inflexion’s prior ownership from 2015-2022, we used our extensive M&A experience to support Alcumus to complete six strategic acquisitions and successfully expand internationally. Inflexion also helped management to build a scalable software-based platform providing a unified solution to its customers, improve the value proposition and strengthen the company’s ESG offering.   \n\nInflexion continues to support Alcumus’s long-term growth plans which are backed by an ambitious management team, strong market position and growing global demand.",
    "stats": []
  },
  {
    "title": "ANS",
    "category": "Technology",
    "description": "Cloud hosting",
    "url": "https://www.inflexion.com/portfolio/ans",
    "img": "https://www.inflexion.com/media/enalktr2/ansv1.png?width=526&height=422&v=133845406399130000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Dec 2018",
    "headquarters": "Manchester, UK",
    "contacts": [
      "Carl Wormald",
      "Roddy Green",
      "Olivia Craig",
      "Carl Wormald",
      "Roddy Green",
      "Olivia Craig"
    ],
    "quote": "Inflexion has played a pivotal role in ANS's growth journey, providing support that has been instrumental in the company's evolution. Their guidance has been essential in propelling ANS to its current market leadership position within the Cloud and Digital Transformation sector.",
    "quoteAuthor": "Richard Thompson",
    "aboutText": "About \n\nThe ANS Group was created by the combination of two companies to create a leading UK managed services provider. \n\nANS helps customers with their Cloud, Security and Business Application infrastructure through its market-leading suite of products and services.",
    "valueAcceleration": "Value acceleration\n\nOur expertise in value-enhancing M&A played a key role in the 2021 combination of ANS with a complementary business, creating a larger, more dynamic business of scale. Together we are capitalising on the shift from on-premise to hosted services, leveraging the business' private cloud proposition and latest public cloud solution, whilst supporting channel optimisation and digital transformation.",
    "stats": []
  },
  {
    "title": "aosphere",
    "category": "Technology",
    "description": "Legal and compliance subscription platform",
    "url": "https://www.inflexion.com/portfolio/aosphere",
    "img": "https://www.inflexion.com/media/xxhph0si/asosphere-logo.png?width=526&height=422&v=133845406343570000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Feb 2024",
    "headquarters": "London, UK",
    "contacts": [
      "Sergio Ferrarini",
      "Rob Dagger",
      "William An",
      "Sergio Ferrarini",
      "Rob Dagger",
      "William An"
    ],
    "quote": "This partnership creates a significant opportunity for us to accelerate our growth. Inflexion shares our vision of providing clients with the most comprehensive, reliable, and user-friendly legal and regulatory information and services.",
    "quoteAuthor": "Marc-Henri Chamay",
    "aboutText": "About \n\nIn 2024, Inflexion’s Partnership Capital II fund made a strategic investment alongside Allen & Overy (A&O) and US-based investor Endicott Capital.  \n\naosphere serves over 725 blue-chip clients including banks, asset managers and corporates, providing online legal analysis on a subscription basis across a range of key compliance topics in complex areas such as financial derivatives, shareholder disclosure requirements, cross-border marketing, and data privacy. The platform creates efficiencies for users by providing standardised legal analysis on complex and multi-jurisdictional regulatory areas, maintaining up-to-date, high quality information working with local counsel across the globe.",
    "valueAcceleration": "Value acceleration \n\nThe investment will see aosphere create a scaled, global regulatory information business across a range of cross-jurisdictional topics. The business will continue to invest to strengthen and expand its product, while maintaining the high level of service and information quality aosphere is widely known for. In particular, aosphere is looking to further grow the business internationally including in the US and selectively through acquisition.",
    "stats": []
  },
  {
    "title": "Aspen Pumps",
    "category": "Industrials",
    "description": "Manufacturer of specialist pumps",
    "url": "https://www.inflexion.com/portfolio/aspen-pumps",
    "img": "https://www.inflexion.com/media/smyed0sz/asset-9.png?width=526&height=422&v=133631193636900000&format=webp",
    "status": "Status: Current",
    "sector": "Industrials",
    "investmentPeriod": "Jan 2020",
    "headquarters": "East Sussex, UK",
    "contacts": [
      "Malcolm Coffin",
      "Mutsa Mutembwa",
      "Malcolm Coffin",
      "Mutsa Mutembwa"
    ],
    "quote": "Inflexion treats management well, has a real passion for business, and is made up of very smart individuals – common to most private equity firms but Inflexion empowers its people to make decisions.",
    "quoteAuthor": "Adrian Thompson",
    "aboutText": "About  \n\nIn 2007 Inflexion led a buyout of Aspen Pumps and supported its growth, particularly in India and China. Inflexion generated a 22x return on its 2015 sale before re-investing in 2020. \n\nAspen is a global leader designing and manufacturing condensate removal mini-pumps, installation, and maintenance accessories for the air conditioning aftermarket. The business is focused on serving the air conditioning and refrigeration wholesale channel globally, selling to 100+ countries.",
    "valueAcceleration": "Value acceleration \n\nBetween 2007 and 2015 Aspen completed an acquisition, expanded internationally and pursued a digital approach to new product development. Aspen increased its sales distribution from 50 to 100 countries and with the support of Inflexion’s in-country international teams, launched in China and India where pump sales achieved 4x increase.  \n\nSince the reinvestment, 11 acquisitions have been supported in the UK, Italy, Australia Malaysia and the US by Inflexion.",
    "stats": []
  },
  {
    "title": "Astrak",
    "category": "Industrials",
    "description": "Construction equipment parts",
    "url": "https://www.inflexion.com/portfolio/astrak",
    "img": "https://www.inflexion.com/media/ksyhmos2/astrak-4.png?width=526&height=422&v=133631193653200000&format=webp",
    "status": "Status: Current",
    "sector": "Industrials",
    "investmentPeriod": "Mar 2022",
    "headquarters": "Kirkcaldy, Scotland",
    "contacts": [
      "Adam Moss",
      "Martin Voelker",
      "Adam Moss",
      "Martin Voelker"
    ],
    "quote": "From spotting a market opportunity nearly 20 years ago to becoming a leader in the space, we know the business has farther to go. Inflexion’s international presence and track record for sustainable growth make it the right fit for us",
    "quoteAuthor": "Dick Paterson",
    "aboutText": "About \n\nInflexion has been working with Astrak Group’s founding family since its 2022 buyout to expand the business further. \n\nAstrak is a global specialist supplier of undercarriage and wear parts for tracked machinery and earthmoving equipment. Based in Scotland, Astrak employs over 180 people globally serving over 17,000 loyal customers.",
    "valueAcceleration": "Value acceleration \n\nInflexion is working with Astrak to increase its share in its current markets whilst expanding more widely across Europe. Inflexion is using its significant M&A experience to support Astrak to pursue its growth plans through select acquisitions in a fragmented global market as well as organically. Acquisitions have provided additional footholds into the US and Scandinavian markets.",
    "stats": []
  },
  {
    "title": "ATCORE",
    "category": "Technology",
    "description": "Travel technology software",
    "url": "https://www.inflexion.com/portfolio/atcore",
    "img": "https://www.inflexion.com/media/o3bl4uqs/atcore-sq-logo-for-website.png?width=526&height=422&v=133586221104330000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Nov 2017 - Jul 2024",
    "headquarters": "Slough, UK",
    "contacts": [
      "Philip Edmans",
      "Cameron Lenton",
      "Philip Edmans",
      "Cameron Lenton"
    ],
    "quote": "Inflexion’s support and guidance has been instrumental as we have transformed our business and navigated a turbulent market. We are thankful for their partnership which leaves us well placed for future growth.",
    "quoteAuthor": "Dave Cruickshank",
    "aboutText": "About \n\nIn 2017, Inflexion backed the buyout of ATCORE, a leading travel technology company that provides specialist booking software solutions to the travel industry.\n\nThe business was sold to Travelsoft, a French travel software business in 2024.",
    "valueAcceleration": "Value acceleration \n\nUnder Inflexion's ownership, Atcore evolved into a leading software provider for a globally diversified group of leisure travel operators. Investment enabled Atcore to enhance its software platform and develop a highly recurring revenue business model. Inflexion also supported Atcore to secure numerous new clients both in the UK and internationally, transitioning from a traditional tour operator to a dynamic holiday packaging company at the forefront of the travel industry's digital transformation.\n\nFurthermore, during the COVID-19 pandemic, which severely disrupted the global travel industry, Inflexion provided critical support, helping Atcore navigate through unprecedented challenges.",
    "stats": []
  },
  {
    "title": "ATG",
    "category": "Technology",
    "description": "Automotive software",
    "url": "https://www.inflexion.com/portfolio/automotive-transformation-group",
    "img": "https://www.inflexion.com/media/akupgdgj/agt5.png?width=526&height=422&v=133631193665700000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Apr 2019 - May 2024",
    "headquarters": "Kent, UK",
    "contacts": [
      "Tom Pemberton",
      "James Stevens",
      "David Collins",
      "Tom Pemberton",
      "James Stevens",
      "David Collins"
    ],
    "quote": "The investment from Inflexion has enabled us to scale faster through M&A and expand our product and service range. The Inflexion team have helped us navigate the complexity of integrating four businesses while maintaining high service levels. As CEO, having engaged and aligned investors is a major help in delivering our strategy.",
    "quoteAuthor": "Tim Smith",
    "aboutText": "About \n\nAutomotive Transformation Group was created by the Inflexion-led merger of Autofutura and GForces in 2021.  \n\nATG is a leading provider of digital retailing solutions to the automotive sector, was formed when Inflexion merged Autofutura, in which it invested in 2019, with GForces. This strategic move led to the creation of ATG, which Inflexion later sold to Keyloop, a leading global automotive technology company.",
    "valueAcceleration": "Value acceleration \n\nInflexion invested in Autofutura initially in 2019 and subsequently drove the transformational merger with GForces in 2020, followed by the acquisitions of Chrysalis and Salesmaster in 2021. The enlarged group rebranded as ATG and Inflexion supported the integration and global roll-out of its technology to deliver the first truly omnichannel retail solution for the automotive industry. During the ownership period, Inflexion supported an international roll-out strategy across Europe and the Middle East, as well as strengthened and professionalised the management team for the next stage of growth. Inflexion supported the business by providing significant technology enhancement.",
    "stats": [
      {
        "label": "EBITDA Growth",
        "value": "4x"
      },
      {
        "label": "acquisitions",
        "value": "3"
      }
    ]
  },
  {
    "title": "Auxadi",
    "category": "Financial Services",
    "description": "Tech-enabled corporate services",
    "url": "https://www.inflexion.com/portfolio/auxadi",
    "img": "https://www.inflexion.com/media/h1khcyte/low-res-2.jpg?width=526&height=422&v=133631193629500000&format=webp",
    "status": "Status: Current",
    "sector": "Financial Services",
    "investmentPeriod": "Sep 2020",
    "headquarters": "Madrid, Spain",
    "contacts": [
      "Flor Kassai",
      "Marcus Ward",
      "Luca Chiesa",
      "Flor Kassai",
      "Marcus Ward",
      "Luca Chiesa"
    ],
    "quote": "We knew as soon as we met Inflexion that it was the right partner to support our growth due to the team’s impressive sector knowledge and global presence. We felt that we were going to become part of a new family.",
    "quoteAuthor": "Victor Salamanca Jr.",
    "aboutText": "About \n\nIn 2020 Inflexion backed Auxadi with minority capital and is supporting the business’s continued organic growth and international expansion. \n\nAuxadi is the largest independent provider of tech-enabled corporate services operating in the Iberian Peninsula and Latin American markets. It provides tech-enabled solutions including accounting, tax, payroll and related administration. Headquartered in Madrid with a further 16 international subsidiaries across Europe and the Americas, Auxadi has 500 customers, including leading real estate and private equity funds as well as major multinational corporates.",
    "valueAcceleration": "Value acceleration  \n\nInflexion’s deep understanding of the sector is supporting the company’s ambitious growth plans via international expansion, primarily in Iberian and Latin American markets.  \n\nInflexion has been involved in refining Auxadi’s market entry strategy in the US, optimising its commercial strategy and improving margins through automation and supplementing its governance through the addition of an industry veteran non-executive chair. Inflexion has also supported Auxadi’s purchase of Resolve BPO to boost its presence in Latin America and DMS Netherlands, whose Dutch regulatory licence will allow the business to access new opportunities within the European Real Estate and Private Equity markets.",
    "stats": []
  },
  {
    "title": "Avantus",
    "category": "Industrials",
    "description": "Aerospace engineer and manufacturer",
    "url": "https://www.inflexion.com/portfolio/avantus",
    "img": "https://www.inflexion.com/media/13rjy5ct/avantusaerospacev1.jpg?width=526&height=422&v=133845406402670000&format=webp",
    "status": "Status: Current",
    "sector": "Industrials",
    "investmentPeriod": "May 2015",
    "headquarters": "Los Angeles, USA",
    "contacts": [
      "Catherine Richards",
      "Adam Moss",
      "Catherine Richards",
      "Adam Moss"
    ],
    "quote": "Inflexion have been thoroughly supportive on our journey to scale our world-class precision-engineered components business in the aerospace and defence sectors. We are continuing to work with them to grow in the US and internationally.",
    "quoteAuthor": "Dan Strangio",
    "aboutText": "About \n\nInflexion partnered with Auctus Industries to back the secondary buyout of Shimtech in 2015, since renamed Avantus.  \n\nCalifornia-based Avantus is a global leader in C-Class components for the aerospace and defence industry, having evolved since Inflexion’s investment to manufacture a broader range of aerospace related products. Avantus manufactures a wide range of aerospace C-class components such as fasteners, brackets, laminated and solid shims, detailed parts and assemblies and clips.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s investment has enabled Avantus to capitalise on global growth in the aerospace sector by growing its share of wallet with existing customers and acquiring new ones through geographic spread.  \n\nInflexion has supported the company in completing several important operational improvement projects including a factory move and installation of a new ERP system. An experienced Chair was introduced from Inflexion’s network and Avantus has grown through M&A including the acquisitions of Fastener Technology Corporation, Fastener Innovation Technology Inc and California Screw Products Corporation, which expanded the product range.",
    "stats": []
  },
  {
    "title": "Axiom GRC",
    "category": "Business Services",
    "description": "Software and tech-enabled services",
    "url": "https://www.inflexion.com/portfolio/axiom-grc",
    "img": "https://www.inflexion.com/media/xfmpboyz/website-logo-template.png?width=526&height=422&v=133905836298730000&format=webp",
    "status": "",
    "sector": "Business Services",
    "investmentPeriod": "May 2024",
    "headquarters": "",
    "contacts": [
      "Isabelle Pagnotta",
      "Sam McPhail",
      "Olivia Smith",
      "Isabelle Pagnotta",
      "Sam McPhail",
      "Olivia Smith"
    ],
    "quote": "We are excited to be partnering with Inflexion to take our GRC business into its next phase of growth. Inflexion’s strong sector experience will be invaluable as we look to grow the business in both the UK and internationally.",
    "quoteAuthor": "Alex Dacre",
    "aboutText": "About \n\nInflexion carved-out Marlowe's GRC assets in 2024, with the investment made from Buyout Fund VI.  \n\nFounded in 2019, GRC provides software and tech-enabled services to manage business risks and ensure customers remain compliant with legal & regulatory standards. Axiom GRC provides a holistic compliance offering with a range of subscription products with specialist offerings for both SMEs and large global enterprises.",
    "valueAcceleration": "Value acceleration \n\nTogether with Inflexion’s support, the newly carved-out Axiom GRC will pursue an ambitious organic growth strategy through cross-selling of services, launching new software and investment in sales and marketing. This will be complemented by M&A to broaden the product offering and support international growth.",
    "stats": []
  },
  {
    "title": "BES Group",
    "category": "Business Services",
    "description": "Engineering testing",
    "url": "https://www.inflexion.com/portfolio/bes-group",
    "img": "https://www.inflexion.com/media/hcvfy0v5/besgroupv1.png?width=526&height=422&v=133845406400770000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Feb 2021 - Feb 2021",
    "headquarters": "Manchester, UK",
    "contacts": [
      "Flor Kassai",
      "Rob Dunnett",
      "Nick Davies",
      "Flor Kassai",
      "Rob Dunnett",
      "Nick Davies"
    ],
    "quote": "Inflexion’s supportive attitude to our active growth plan has enabled us to take an innovative and forward-thinking approach. From our ESG agenda to our next acquisition, we know they will always give us the support we need.",
    "quoteAuthor": "John Campbell",
    "aboutText": "About  \n\nBES Group’s revenues have quadrupled since Inflexion’s initial 2015 carve-out owing to an impressive strategy of organic growth and strategic acquisitions.  \n\nBES Group is a provider of premium quality inspection, testing, certification and compliance (TICC) services. Inflexion carved the Engineering Inspection & Consultancy division of RSA Plc out in 2015 and reinvested in 2021. Today BES Group has over 1,000 highly trained Engineer Surveyors and Consultant Engineers, strong customer support systems, and a wealth of technical expertise.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s expertise in the TICC sector and M&A experience are valuable as BES Group consolidates its market. The initial five years of partnership with Inflexion transformed BES Group into a unique asset of scale, with significant investment into various areas of the business seeing a fully integrated back office built and the team strengthened. Management also worked with Inflexion’s digital team to create a best-in-class tech-enabled service, while 16 acquisitions expanded BES Group’s offering, including 11 since the 2021 reinvestment.",
    "stats": []
  },
  {
    "title": "Blue Light Card",
    "category": "Consumer",
    "description": "Closed group consumer discount marketplace",
    "url": "https://www.inflexion.com/portfolio/blue-light-card",
    "img": "https://www.inflexion.com/media/d2ldgc4z/blue-light-card.png?width=526&height=422&v=133632871704270000&format=webp",
    "status": "Status: Current",
    "sector": "Consumer",
    "investmentPeriod": "Feb 2022",
    "headquarters": "Leicestershire, UK",
    "contacts": [
      "Tom Pemberton",
      "James Stevens",
      "Jack Weller",
      "Tom Pemberton",
      "James Stevens",
      "Jack Weller"
    ],
    "quote": "Inflexion’s global presence and sector knowledge will help us go even further for our community as we enhance our product offering and allow us to carry out improvements to how we communicate with members. This is an exciting time for all at Blue Light Card and we are very much looking forward to the next stage of growth together.",
    "quoteAuthor": "Alidad Moghaddam",
    "aboutText": "About \n\nIn 2022 Inflexion invested in Blue Light Card, the UK’s leading closed user-group discount marketplace serving the 'Blue Light' community of key workers. \n\nBlue Light Card provides retailer discounts for people that work in the UK’s emergency services, NHS, social care sector and armed forces (together known as 'blue light workers'). The business is an omnichannel consumer marketplace and offers discounts at over 14,000 retailers to its verified closed group audience of over 4.5 million members. The majority of transactions occur through Blue Light Card’s leading app. Over the last year Blue Light Card has saved its members over £350m.",
    "valueAcceleration": "Value acceleration  \n\nInflexion is using its expertise in growing digital-first businesses to support the management team at Blue Light Card to continue to broaden the range of discounts offered, improve member personalisation, and drive even greater savings for its member base. \n\nInflexion has helped BLC evaluate international expansion opportunities and has supported the launch of BLC in Australia.\n\nBLC is working closely with Inflexion’s digital team to further develop its product, user experience and member sign-up and services function.",
    "stats": []
  },
  {
    "title": "Bollington Wilson",
    "category": "Financial Services",
    "description": "Insurance broker",
    "url": "https://www.inflexion.com/portfolio/bollington-wilson",
    "img": "https://www.inflexion.com/media/p0sh13li/bollington-wilson-logo-400x400.png?width=526&height=422&v=133586221143100000&format=webp",
    "status": "Status: Realised",
    "sector": "Financial Services",
    "investmentPeriod": "Oct 2017 - Jan 2021",
    "headquarters": "Manchester, UK",
    "contacts": [
      "Carl Wormald",
      "Carl Wormald"
    ],
    "quote": "On M&A, the team have been worth their weight in gold, helping on origination, financing and execution. Inflexion supported our business every step of the way in ensuring that the merger plan delivered the synergies they had anticipated.",
    "quoteAuthor": "Paul Moors",
    "aboutText": "About \n\nInflexion created the largest independent broker in the North of England with the buyout and simultaneous merger of Bollington Insurance Brokers and F Wilsons Insurance Brokers in 2017 before its sale to a US-listed trade buyer. \n\nThe Group provides a holistic product offering complemented by several niche specialisms operating across a range of distribution channels, leveraging a nationwide team of specialist account managers and a leading digital proposition. At the time of the sale, the Group was operating across seven offices and employing more than 400 people.",
    "valueAcceleration": "Value acceleration \n\nCapitalising on our track record in acquisitive growth, Inflexion supported the business in its successful integration and its subsequent M&A strategy, which saw five add-ons expand its product offering and regional presence. Inflexion also supported investment into digital distribution channels and an improved underwriting capacity.  In 2021, Inflexion sold the company to one of the UK's leading independent insurance brokers, US-listed Arthur J. Gallagher.",
    "stats": [
      {
        "label": "EBITDA Growth",
        "value": "133%"
      },
      {
        "label": "acquisitions",
        "value": "5"
      }
    ]
  },
  {
    "title": "Calco",
    "category": "Business Services",
    "description": "IT recruitment and training",
    "url": "https://www.inflexion.com/portfolio/calco",
    "img": "https://www.inflexion.com/media/wjkbr52a/calcologo.png?width=526&height=422&v=133586220889370000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Jan 2018",
    "headquarters": "Amsterdam, The Netherlands",
    "contacts": [
      "Sander Ruijter",
      "Roddy Green",
      "Daan Gankema",
      "Catherine Richards",
      "Sander Ruijter",
      "Roddy Green",
      "Daan Gankema",
      "Catherine Richards"
    ],
    "quote": "We work closely with Inflexion’s board representatives and value acceleration team to capitalise on the immense opportunity for higher educated talent in scarce labour markets.",
    "quoteAuthor": "Jan-Willem Gelderblom",
    "aboutText": "About \n\nInflexion backed the buyout of Dutch outsourced IT recruitment and training specialist Calco in 2018.  \n\nCalco provides trained junior IT professionals to blue chip clients in multiple industries, with clients including Nationale-Nederlanden, KLM, Rabobank and ING.",
    "valueAcceleration": "Value acceleration  \n\nDemand for higher educated IT trainee hires continues to grow and we have helped Calco successfully scale is recruitment, marketing and sales infrastructure and strengthened its management team.\n\nCalco’s business model, market dynamics and growth opportunities are similar to those of Inflexion’s investment in FDM Group, which was successfully floated on the London Stock Exchange by Inflexion in 2014. Inflexion is using its strong industry experience to support the management team in their growth ambitions.",
    "stats": []
  },
  {
    "title": "Cawood Scientific",
    "category": "Business Services",
    "description": "Laboratory testing services",
    "url": "https://www.inflexion.com/portfolio/cawood-scientific",
    "img": "https://www.inflexion.com/media/jyznhbk5/cawood-logo.png?width=526&height=422&v=133634429234000000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Mar 2017 - Jul 2019",
    "headquarters": "Bracknell, UK",
    "contacts": [
      "Carl Wormald",
      "Nick Davies",
      "Carl Wormald",
      "Nick Davies"
    ],
    "quote": "Together with Inflexion we are pleased to have accelerated growth at Cawood and entered new market sectors. Looking forward, we are extremely well placed to continue to grow within the markets in which we operate.",
    "quoteAuthor": "Nigel Patrick and Linda Radnor",
    "aboutText": "About \n\nCawood Scientific delivers highly accredited analytical services to organisations within the agriculture and renewable energy sectors. Inflexion backed its buyout and three acquisitions before exiting to Waterland Private Equity. \n\nFounded over 25 years ago, Cawood Scientific is the UK’s largest independent provider of analytical laboratory testing services for land-based industries. The business serves over 3,500 customers across three divisions, NRM, Sciantec Analytical Services and Sci-Tech Laboratories, and its approximately 190 employees operate across four laboratories in Berkshire, Yorkshire, Shropshire and Norfolk.",
    "valueAcceleration": "Value acceleration \n\nInflexion understood the sector well, having backed engineering testing, inspection and consultancy business British Engineering Services as well as Kynetec, a provider of data into the agriculture and animal health markets.  \n\nDuring the investment by Inflexion, Cawood continued to develop its offering and established new services. This was supported by the successful acquisition of three businesses which broadened Cawood’s breadth of service into adjacent market sectors and geographies, as well as meaningfully enhancing scale. The business also benefitted from investment in technology and data optimisation leading to an improved customer offering and resourcing efficiency.",
    "stats": [
      {
        "label": "acquisitions",
        "value": "3"
      },
      {
        "label": "samples processed annually",
        "value": "1.5m+"
      }
    ]
  },
  {
    "title": "Celnor",
    "category": "Business Services",
    "description": "TICC platform",
    "url": "https://www.inflexion.com/portfolio/celnor",
    "img": "https://www.inflexion.com/media/avrfrnc0/celnor-orange-logo.jpg?cc=0.24443575198503192,0.2112127014643153,0.24587432553434793,0.2112127014643153&width=526&height=422&v=133586228748770000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Aug 2023",
    "headquarters": "London",
    "contacts": [
      "Dominic Clark",
      "Josh de Wet",
      "Dominic Clark",
      "Josh de Wet"
    ],
    "quote": "We are delighted to be partnering with Inflexion, whose unrivalled expertise as well as proven buy-and-build experience make them the right investor as we create a business where entrepreneurial, founder-led companies can thrive.",
    "quoteAuthor": "Simon Parrington",
    "aboutText": "About\nCelnor was established by Inflexion in 2023 as a platform for testing, inspection, certification and compliance (TICC) businesses.  \n\nCelnor was launched to consolidate the TICC market across four key pillars: Built Environment, Safety and Compliance, Risk Management and Analytical Sciences.",
    "valueAcceleration": "Value acceleration \n\nInflexion has substantial expertise in consolidating the TICC market through a number of successful investments in the sector, including Phenna Group, Alcumus, BES Group and Cawood Scientific. This experience will allow Inflexion to build the business with an ambitious acquisition strategy. At the time of launch, Inflexion supported three acquisitions for Celnor which were followed by 16 acquisitions within first 12 months of ownership.",
    "stats": []
  },
  {
    "title": "Chambers",
    "category": "Business Services",
    "description": "B2B information services provider in the legal sector",
    "url": "https://www.inflexion.com/portfolio/chambers-and-partners",
    "img": "https://www.inflexion.com/media/utoaagji/chambers-web-logo.png?width=526&height=422&v=133935014027100000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Nov 2023",
    "headquarters": "London, UK",
    "contacts": [
      "Edward Taylor",
      "Edward Taylor"
    ],
    "quote": "Inflexion are a very supportive partner and truly understand our growth ambitions. They have the tools to help us in our journey and their international presence and strong digital capabilities are particularly important to us.",
    "quoteAuthor": "Tim Noble",
    "aboutText": "About \n\nChambers transitioned to B2B information services business through Inflexion’s stewardship before a £400m sale to Abry Partners. Inflexion made a minority re-investment into Chambers after the 2023 sale. \n\nChambers and Partners is an independent research, data and analytics company founded in 1990 that operates across 200 jurisdictions to deliver detailed data insights into the world's leading lawyers and law firms.  \n\nRanking individuals and law firms, the business connects them to general counsels and buyers of legal services and supports their marketing, business development and recruitment activities. Chambers also produces firm analytics, business information tools and practice guides, all empowering organisations to make informed decisions when selecting legal services or optimising the management of law firms.",
    "valueAcceleration": "Value acceleration\n\nInflexion supported the buy-in management team to build out the c-suite and develop a digital product portfolio, upgrade its premises, invest in a world-class digital team which embraced AI to drive efficiencies, and develop the sales and marketing proposition. Our international experts worked with the management team to support in-country expansion opportunities in the Americas and Asia.   \n\nInflexion continues to support Chambers’ long-term growth plans which are backed by an ambitious management team, strong market position and increasing global demand for its growing range of new products and services.",
    "stats": []
  },
  {
    "title": "CloserStill Media",
    "category": "Business Services",
    "description": "Media and exhibitions business",
    "url": "https://www.inflexion.com/portfolio/closerstill-media",
    "img": "https://www.inflexion.com/media/qa2pemli/closerstill-800x800.png?width=526&height=422&v=133631193642100000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Mar 2015 - Dec 2018",
    "headquarters": "London, UK",
    "contacts": [
      "David Whileman",
      "David Whileman"
    ],
    "quote": "Inflexion were a tremendous backer, giving us just the right amount of support to grow our business internationally. Their international team were incredibly valuable, with their input enabling us to win our largest order in the history of our Asian business.",
    "quoteAuthor": "Phil Soar",
    "aboutText": "About \n\nInflexion’s minority investment into CloserStill Media, a media and exhibitions business, supported eight acquisitions and organic roll-out to boost international revenues 6x before its sale to Providence Equity Partners in 2018. \n\nFounded in 2008, CloserStill operates content-led exhibitions throughout the UK, Europe, the US and the Far East.",
    "valueAcceleration": "Value acceleration \n\nDuring the investment period the business grew significantly, including successful expansion into Asia, Germany and the US. Inflexion supported the company’s eight acquisitions with funding and expertise, and worked with CloserStill to replicate its exhibitions internationally, with the launch of the first successful shows in the US (New York Vet) and Hong Kong (Cloud Asia). Overall, during Inflexion’s investment the number of exhibitions grew by nearly 50% and the proportion of international revenues grew from 20% to 50%. Inflexion’s Asia Pacific presence was crucial in bringing in Alibaba as a contact.",
    "stats": [
      {
        "label": "acquisitions",
        "value": "876"
      },
      {
        "label": "increase in international revenues",
        "value": "654x"
      }
    ]
  },
  {
    "title": "CMO",
    "category": "Technology",
    "description": "Risk and compliance software",
    "url": "https://www.inflexion.com/portfolio/cmo",
    "img": "https://www.inflexion.com/media/qxsg2aec/cmov2.jpg?width=526&height=422&v=133845406403000000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Oct 2013 - Jun 2016",
    "headquarters": "London, UK",
    "contacts": [],
    "quote": "",
    "quoteAuthor": "",
    "aboutText": "About \n\nIn 2013, Inflexion provided minority funding to compliance software business CMO to drive growth. In 2016, CMO was sold to Mitratech, a US-headquartered global software provider. \n\nCMO provides enterprise health, safety, environment (HSE) and governance, risk, compliance (GRC) software solutions for global corporations and regulators. \n\nCMO serves blue-chip customers including Maersk Group, KPMG, Heathrow Airport and BHP. Operating in a large global market enjoying double-digit annual growth, demand for CMO’s products is driven by an increased need for configurable compliance software, increasing regulation as well as the increasing cost of non-compliance.",
    "valueAcceleration": "Value acceleration \n\nHaving created a best-in-class product suite, CMO sought a partner who could introduce them to skilled individuals to add depth to their team and strengthen their operations to ensure their corporate infrastructure kept pace with their sales growth. They were drawn to Inflexion’s flexible minority solution.",
    "stats": []
  },
  {
    "title": "CMSPI",
    "category": "Business Services",
    "description": "Global payments consultancy",
    "url": "https://www.inflexion.com/portfolio/cmspi",
    "img": "https://www.inflexion.com/media/tkwpi2eo/cmspi-logo-2021-website.jpg?width=526&height=422&v=133631193656430000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services, Financial Services",
    "investmentPeriod": "Mar 2021",
    "headquarters": "Manchester, UK",
    "contacts": [
      "Chris Wright",
      "Maximilian Schneider",
      "Chris Wright",
      "Maximilian Schneider"
    ],
    "quote": "This partnership gives CMSPI the opportunity to further invest in the business and its people to enhance its technology and data capabilities. Our mutual goal is to super-charge CMSPI’s international growth, and Inflexion has added invaluable support to our development.",
    "quoteAuthor": "Brendan Doyle",
    "aboutText": "About \n\nCMS Payments Intelligence (CMSPI) is the go-to-payments adviser for global merchants. It has more than tripled its EBITDA with Inflexion’s minority funding since 2021, with digital enhancement a core focus.  \n\nInflexion originally made a minority investment into the specialist consultancy in 2021 and subsequently increased its shareholding to a majority with the support of the founder.",
    "valueAcceleration": "Value acceleration  \n\nInflexion is supporting management to develop its data strategy/capability and proprietary technology, incorporating machine learning to better help its merchant client base identify and drive improvements within their payments supply chain performance. This enhanced capacity has allowed CMSPI to grow and mature its data lake as the business continues to work with larger, global clients. In parallel, Inflexion has supported the business in building out its C-Suite as the business scales internationally, opening new offices in the US, Germany, and Australia.",
    "stats": []
  },
  {
    "title": "CNX Therapeutics",
    "category": "Healthcare",
    "description": "Pharmaceuticals",
    "url": "https://www.inflexion.com/portfolio/cnx-therapeutics",
    "img": "https://www.inflexion.com/media/tuge122r/cnx.png?width=526&height=422&v=133632872408870000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Aug 2021",
    "headquarters": "London, UK",
    "contacts": [
      "Christian Fellowes",
      "Josh Butterick",
      "Henry Awit",
      "Christian Fellowes",
      "Josh Butterick",
      "Henry Awit"
    ],
    "quote": "Inflexion’s experience in our sector, steering acquisitions and the immense task of carve-outs made them incredibly well suited to our ambitions. They bring substantially more than pure capital to our plans.",
    "quoteAuthor": "Guy Clark",
    "aboutText": "About \n\nCNX Therapeutics was formed in 2021 when Inflexion carved out the European operations of US-based Sunovion Pharmaceuticals.  \n\nCNX supplies essential medicines with a portfolio of speciality brands and hospital products. The carve out included the pan-European licensing rights to a patent-protected medicine used for the treatment of schizophrenia.",
    "valueAcceleration": "Value acceleration  \n\nInflexion’s substantial experience in carve-outs and healthcare helped create CNX as an independent entity. Since then, it’s built up a product portfolio to develop a scaled European platform focused on hospital and central nervous system (“CNS”)  therapies. A year after carve-out, CNX acquired Synchrony Pharma and Inflexion’s digital team is supporting CNX to make the most of automation and data visualisation. In 2023 / 2024 the business acquired two central nervous products from Eisai to treat psychological disorders and Parkinson’s disease, as well as four hospital products from Clinigen and two central nervous products from Sanofi.",
    "stats": []
  },
  {
    "title": "CP Electronics",
    "category": "Industrials",
    "description": "Lighting control systems",
    "url": "https://www.inflexion.com/portfolio/cp-electronics",
    "img": "https://www.inflexion.com/media/ivsgpmrq/cpelectronics.png?width=526&height=422&v=133586224259730000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Jan 2014 - May 2016",
    "headquarters": "London, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "With Inflexion we invested into our people and market-leading capabilities, furthering our leadership position and making us very well poised for future growth.",
    "quoteAuthor": "Marcus Martin",
    "aboutText": "About \n\nInflexion invested in lighting maker CP Electronics in 2014 through its investment in Aspen Pumps, and worked with management for over two years before selling it to French industrial group Legrand in 2016. \n\nCP Electronics is the UK’s leading manufacturer of lighting controls systems. The business assists its blue-chip client base in reducing their operating costs and carbon footprint through an extensive range of innovative lighting control products.",
    "valueAcceleration": "Value acceleration \n\nAfter the initial deal, we invested further to support new product development and the infrastructure of the business to ensure the business had a sustainable platform for its future growth and introduced skilled individuals to add depth to CP’s team. Under our ownership, revenue and profitability grew in excess of 40%, whilst staff numbers increased over 35%.",
    "stats": [
      {
        "label": "headcount growth",
        "value": "35%"
      },
      {
        "label": "increase in revenues and profit",
        "value": "40%"
      }
    ]
  },
  {
    "title": "Creative Car Park",
    "category": "Business Services",
    "description": "Car park management solutions",
    "url": "https://www.inflexion.com/portfolio/creative-car-park",
    "img": "https://www.inflexion.com/media/jwfloc5q/creativecarparkv1.jpg?width=526&height=422&v=133845406403500000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Mar 2019",
    "headquarters": "London, UK",
    "contacts": [
      "Roddy Green",
      "Jack Pearson",
      "Roddy Green",
      "Jack Pearson"
    ],
    "quote": "The team’s hard work has helped build a company with impressive growth rates, and we look forward to accelerating this growth further with Inflexion’s backing. They impressed us with their proven ability to help businesses grow faster, organically and via acquisition.",
    "quoteAuthor": "Simon Abraham",
    "aboutText": "About \n\nInflexion is supporting the transition of Creative Car Park (CCP) from parking enforcement to value-added, data-driven services.  \n\nAs the UK’s leading provider of car park management solutions for small businesses, CCP was one of the first parking service providers to offer a fully automated number plate recognition (”ANPR”) technology enforcement service. Low-cost installation model makes it highly scalable and saves businesses time and money.",
    "valueAcceleration": "Value acceleration  \n\nInflexion is working with management to invest in sales and marketing, leverage the business's ANPR data to build out its data offering, and help roll out services to a wider customer base. A core focus is on the digital infrastructure as the business transitions towards value-added data-driven services designed to ensure clients can maximise the potential of their car park. Our Talent team has provided significant support in helping to add to the leadership team.",
    "stats": []
  },
  {
    "title": "CTC Aviation",
    "category": "Business Services",
    "description": "Aviation training services",
    "url": "https://www.inflexion.com/portfolio/ctc-aviation",
    "img": "https://www.inflexion.com/media/cd5nox5s/ctcavaiationv1.jpg?width=526&height=422&v=133845406403330000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Jun 2012 - May 2015",
    "headquarters": "Southampton, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Our partnership with Inflexion was one of support, presenting us with the right amount of challenge coupled with the investment we needed to achieve our ambitious growth. We have enjoyed a prosperous time with Inflexion.",
    "quoteAuthor": "Rob Clarke",
    "aboutText": "About \n\nInflexion backed the buyout of pilot training company CTC Aviation in 2012, providing capital for expansion as well as a succession solution. The sale to NYSE-listed L-3 Communications generated a 3x return on investment. \n\nCTC Aviation provides fully integrated training for all stages of pilot development; from entry-level cadet training through to the highest level, tailored professional development programmes for pilots as they progress through the ranks.",
    "valueAcceleration": "Value acceleration \n\nManagement was looking for an investor capable of bringing funding as well as expertise to help accelerate their growth, particularly in overseas markets. The buyout also fulfilled the founder’s wishes to transition management of the business to the existing team. \n\nThe Founder was looking to realise some value but retain a share and some involvement, while his son, then COO, wanted to remain fully involved. The business created a plan with Inflexion which allowed the Founder to transition leadership of the business to the core management team, headed by his son. During our partnership, we oversaw multiple new long-term agreements with world-class airlines such as Virgin Atlantic, Oman Air, Dragonair and Wizz Air as well as gaining further regulatory approvals to expand into new territories in Asia and the Gulf region. Inflexion supported a substantial increase in training capacity and customer service infrastructure, overseeing the opening of new Crew Training Centres in the UK and US to grow cadet numbers, and supporting investment into new trainee accommodation in New Zealand.",
    "stats": [
      {
        "label": "return on investment",
        "value": "3x"
      }
    ]
  },
  {
    "title": "Curinos",
    "category": "Technology",
    "description": "Financial data and analytics",
    "url": "https://www.inflexion.com/portfolio/curinos",
    "img": "https://www.inflexion.com/media/cglhh4xu/curinos-for-website.png?width=526&height=422&v=133631193675200000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Jun 2021",
    "headquarters": "New York, USA",
    "contacts": [
      "Sergio Ferrarini",
      "Andreas Constantinides",
      "William An",
      "Sergio Ferrarini",
      "Andreas Constantinides",
      "William An"
    ],
    "quote": "Inflexion are fantastic at listening and don’t read from a playbook and tell us what to do. They took the time to truly understand our business and it’s paying off now.",
    "quoteAuthor": "Al Aguirre,",
    "aboutText": "About \n\nCurinos was born when FTSE 100 Informa PLC partnered with Inflexion’s Partnership Capital to create a US-headquartered leader in financial data and technology in 2021, with continued high growth since then. \n\nAn innovative transaction structure brought together Informa’s Financial Intelligence’s Financial Benchmarking & Omnichannel Experience (FBX) with Novantas Inc. Curinos delivers intelligence to financial institutions globally across consumer and commercial deposits, omnichannel digital experience and real estate lending markets needed to assess a firm’s competitive position and make more profitable and data-drive decisions faster.",
    "valueAcceleration": "Value acceleration \n\nInflexion worked with Informa to support the carve-out and merger of FBX from Informa PLC with Novantas. Inflexion’s digital team has supported the creation of a unified data fabric to boost product integration and cross-selling, while the talent team has helped enhance the management bench to underpin the accelerated growth.",
    "stats": []
  },
  {
    "title": "Cutwel",
    "category": "Industrials",
    "description": "Specialist cutting tool distributor",
    "url": "https://www.inflexion.com/portfolio/cutwel",
    "img": "https://www.inflexion.com/media/up5hahy2/cutwelv1.jpg?width=526&height=422&v=133845406400970000&format=webp",
    "status": "Status: Current",
    "sector": "Industrials",
    "investmentPeriod": "Aug 2024",
    "headquarters": "Yorkshire, UK",
    "contacts": [
      "Rob Dunnett",
      "Toby Lane",
      "Rob Dunnett",
      "Toby Lane"
    ],
    "quote": "Inflexion brings significant experience to Cutwel and we look forward to driving the business forward together with them. We believe Inflexion’s experience in developing market leading businesses is particularly well suited to our plans for building our customer offering further.",
    "quoteAuthor": "Adam Gillard",
    "aboutText": "About \n\nCutwel is the leading UK specialist cutting tool distributor. In 2024, Inflexion’s Enterprise Fund V, alongside the management team led by Adam Gillard, invested in the business to drive growth.\n\nFounded in 1996, Cutwel is the UK’s leading value-added cutting tool distributor to the precision engineering industry. Serving over 13,000 customers across a wide range of sectors through a disruptive sales model, Cutwel provides the largest range of cutting and machine tool accessories stocked in the UK for next day delivery.",
    "valueAcceleration": "Value acceleration \n\nInflexion will support the management team in driving growth, in particular through further scaling its sales team, continuing to leverage data and BI capabilities to drive performance, as well as enhancing its digital marketing offering to expand its customer base and further strengthen relationships with existing customers and suppliers.",
    "stats": []
  },
  {
    "title": "Detectortesters",
    "category": "Industrials",
    "description": "Fire safety products",
    "url": "https://www.inflexion.com/portfolio/detectortesters",
    "img": "https://www.inflexion.com/media/t1hp3tyz/detectortesters-logo-website.png?width=526&height=422&v=133631193657530000&format=webp",
    "status": "Status: Current",
    "sector": "Industrials",
    "investmentPeriod": "Oct 2021",
    "headquarters": "Hertfordshire, UK",
    "contacts": [
      "Chris Wright",
      "Richard Booth",
      "Chris Wright",
      "Richard Booth"
    ],
    "quote": "We see significant growth opportunities ahead in both the UK and internationally and have an exciting roadmap of next generation testing equipment ahead. Inflexion’s international and commercial experience will be invaluable to us as we make our plans reality.",
    "quoteAuthor": "Robert Campbell",
    "aboutText": "About \n\nInflexion supported safety testing specialist Detectortesters to acquire System Distributors in the US as part of its 2021 investment. Two further US based acquisitions have since been completed with further support being provided in developing its digital strategy.\n\nDetectortesters is a global manufacturer of fire detector testing equipment which exports its products to over 130 countries, deriving over 80% of its revenues from outside the UK.",
    "valueAcceleration": "Value acceleration  \n\nInflexion has supported Detectortester's shift to an ‘Internet of Things’ approach, with its new connected product boosting efficiency and creating valuable data records as clients benefit from full ownership of compliance. Inflexion’s on-the-ground expert in India has helped drive an increase in revenue and its commercial team ahs helped on revenue optimisation through enhancing sales effectiveness.",
    "stats": []
  },
  {
    "title": "DR&P",
    "category": "Financial Services",
    "description": "Corporate insurance broker",
    "url": "https://www.inflexion.com/portfolio/drp",
    "img": "https://www.inflexion.com/media/0yvfwy02/davidrobertsv1.jpg?width=526&height=422&v=133845406401200000&format=webp",
    "status": "Status: Realised",
    "sector": "Financial Services",
    "investmentPeriod": "Mar 2021 - Dec 2024",
    "headquarters": "Southport, UK",
    "contacts": [
      "Carl Wormald",
      "Nick Davies",
      "Carl Wormald",
      "Nick Davies"
    ],
    "quote": "We are proud of what has been achieved with the support of Inflexion over the past three years. Their investment has allowed us to build a market-leading business in the UK insurance market. We believe there are significant opportunities for further growth ahead of us.",
    "quoteAuthor": "John Page",
    "aboutText": "About \n\nInflexion invested in David Roberts & Partners (“DR&P”), a leading UK insurance broker initially in 2021 and re-invested in 2023 to support further growth of the business. The business was sold in 2024 to BMS Group, an independent specialist insurance and reinsurance broker.\n\nFounded in 1977, DR&P is firmly established as one of the fastest growing UK brokers, and is listed as one of the UK’s leading independent insurance brokers. DR&P has a team of almost 400 people in 25 offices across the UK and Europe, handling in excess of £620 million GWP for their clients. Inflexion invested in DR&P initially in 2021 and re-invested in 2023 to support further growth of the business.",
    "valueAcceleration": "Value acceleration \n\nTogether with Inflexion’s support, DR&P management successfully pursued an M&A strategy to build a network of strategically aligned businesses in the regional insurance broking market. The business also benefitted from significant investment in its technology infrastructure. DR&P’s industry leading organic growth rate of 23%, combined with its thoughtful approach to M&A with13 acquisitions completed in last three years, has generated a tenfold increase in EBITDA alongside a quadrupling of headcount during Inflexion’s investment. The business enjoys 95% client retention and has active clients in 46 countries worldwide, despite being UK only focussed when Inflexion invested.",
    "stats": [
      {
        "label": "EBITDA growth",
        "value": "10x"
      },
      {
        "label": "acquisitions",
        "value": "14"
      }
    ]
  },
  {
    "title": "dss+",
    "category": "Business Services",
    "description": "Health and safety management consultancy",
    "url": "https://www.inflexion.com/portfolio/dssplus",
    "img": "https://www.inflexion.com/media/u5hlt5wo/dssv1.png?width=526&height=422&v=133845406401330000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Feb 2023",
    "headquarters": "Geneva, Switzerland",
    "contacts": [
      "Isabelle Pagnotta",
      "Henrik Nordman",
      "Umberto Massucco",
      "Isabelle Pagnotta",
      "Henrik Nordman",
      "Umberto Massucco"
    ],
    "quote": "As a result of the Inflexion partnership, dss+ clients will continue to benefit as we help them save lives and create a sustainable future through new solutions development, an expanded footprint and additional talent.",
    "quoteAuthor": "Davide Vassallo",
    "aboutText": "About \n\nInflexion is supporting growth at dss+, a leading provider of operations management consulting services with the purpose of improving workers’ safety, saving lives and creating a sustainable future.\n\ndss+ is a global business that helps clients increase safety standards, reduce risk, transform culture, maximise impact and improve sustainability by operating more responsibly. The business is primarily focused on high-risk industries where safety and sustainability are mission critical. The Switzerland-headquartered firm was carved out of DuPont in 2019 as DuPont Sustainable Solutions in a buy-out and today employs 1,200 consultants in 60 countries.",
    "valueAcceleration": "Value acceleration \n\ndss+ operates in a large market which is growing as firms globally are increasingly focused on safe and sustainable operations and ESG. Inflexion is supporting the business to address this growing demand by enhancing its offering both organically and through M&A in a fragmented market, with 3 acquisitions made in the first year of ownership.",
    "stats": []
  },
  {
    "title": "DWF",
    "category": "Business Services",
    "description": "Global provider of legal services",
    "url": "https://www.inflexion.com/portfolio/dwf",
    "img": "https://www.inflexion.com/media/3e0mujkj/dwfv1.png?width=526&height=422&v=133845406399270000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Oct 2023",
    "headquarters": "Manchester, UK",
    "contacts": [
      "Tom Green",
      "Sam McPhail",
      "Olivia Smith",
      "Tom Green",
      "Sam McPhail",
      "Olivia Smith"
    ],
    "quote": "Inflexion’s experience in building other professional services businesses internationally is invaluable as we execute our strategy to create a global professional services business emanating from the legal sector.",
    "quoteAuthor": "Sir Nigel Knowles",
    "aboutText": "About \n\nInflexion completed the take private of integrated legal and business services provider DWF Group in 2023.\n\nDWF is a global leader in providing end-to-end claims management services to the insurance industry, alongside a leading diversified legal and business advisory practice. DWF has c. 4,000 employees in 30 offices across 18 countries. DWF’s success since it was founded in 1977 has been driven by the quality of its people, the strength of its client relationships and its integrated business model.",
    "valueAcceleration": "Value acceleration \n\nWith Inflexion’s backing, DWF will continue its organic and acquisitive growth journey, including expanding its service capabilities, and pursing a global M&A strategy. Our digital team is supporting DWF to realise the substantial AI opportunity in the legal services sector.",
    "stats": []
  },
  {
    "title": "Easyfairs",
    "category": "Business Services",
    "description": "Easyfairs",
    "url": "https://www.inflexion.com/portfolio/easyfairs",
    "img": "https://www.inflexion.com/media/c0qbc0tg/easyfairsv1.jpg?width=526&height=422&v=133845406400130000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Jul 2024",
    "headquarters": "",
    "contacts": [
      "Tom Green",
      "William An",
      "Tom Green",
      "William An"
    ],
    "quote": "I am thrilled to welcome Cobepa and Inflexion to be part of our success story, not least because they share our culture, values and vision, as well as bringing vast experience and expertise to the table.",
    "quoteAuthor": "Eric Everard",
    "aboutText": "About \n\nIn 2024, Inflexion’s Partnership Capital III fund invested in the business, together with Cobepa, a Brussels-based privately held investment firm, and Eric Everard, Founder. All three parties will be equally represented in the partnership.\n\nEasyfairs is an international events company that organises >110 exhibition titles in >12 countries and >12 industry verticals including packaging & logistics, manufacturing, industrial processing, hospitality and construction.",
    "valueAcceleration": "Value acceleration \n\nThe investment will enable Easyfairs to drive faster organic growth through new event launches and geo-cloning of existing events, extend its geographic and sector footprint, enhance its position as a sector frontrunner in big data and artificial intelligence technologies, and unlock further strategic M&A opportunities. Inflexion brings strong industry experience through its previous successful investment in CloserStill Media which successfully completed eight acquisitions and increased international revenues 6x during Inflexion’s stewardship.",
    "stats": []
  },
  {
    "title": "EcoOnline",
    "category": "Technology",
    "description": "EHS software provider",
    "url": "https://www.inflexion.com/portfolio/ecoonline",
    "img": "https://www.inflexion.com/media/c5dficfn/ecoonlinev1.png?width=526&height=422&v=133845406399500000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Dec 2022",
    "headquarters": "Tønsberg, Norway",
    "contacts": [
      "Martin Thøgersen",
      "Martin Thøgersen"
    ],
    "quote": "EcoOnline is committed to becoming the global leader in middle-market EHS software. Adding the Alcumus technology, customers and team to that effort is a strategic step forward, making us an even stronger partner for customers around the world.",
    "quoteAuthor": "Chris Joseph",
    "aboutText": "About \n\nIn 2023, Inflexion supported the merger of Norway-based EcoOnline with the software division of Alcumus to create a new leader in environmental, health and safety software. \n\nEcoOnline is a Norway-based EHS SaaS market leader which develops software for creating safer and sustainable workplaces while ensuring compliance and environmental sustainability. EcoOnline has a large presence in the UK, Ireland, and the US.",
    "valueAcceleration": "",
    "stats": []
  },
  {
    "title": "enviolo",
    "category": "Industrials",
    "description": "e-bike components",
    "url": "https://www.inflexion.com/portfolio/enviolo",
    "img": "https://www.inflexion.com/media/llbhn2hr/enviolov1.png?width=526&height=422&v=133845406399600000&format=webp",
    "status": "Status: Current",
    "sector": "Industrials",
    "investmentPeriod": "Mar 2022",
    "headquarters": "Netherlands",
    "contacts": [
      "Sander Ruijter",
      "Roddy Green",
      "Beatrijs Goeman Borgesius",
      "Lorin Roobrouck",
      "Sander Ruijter",
      "Roddy Green",
      "Beatrijs Goeman Borgesius",
      "Lorin Roobrouck"
    ],
    "quote": "We are proud and excited to work with bike makers to develop great bikes together which can change rider’s lifestyles and ease congestion in urban areas. Our partnership with Inflexion will help us grow faster as their proximity to our Amsterdam office and presence in the US, China and India are well placed to support our plans.",
    "quoteAuthor": "David Hancock",
    "aboutText": "About \n\nSince 2022 Inflexion has supported e-bike components specialist enviolo to build on the global transition towards smart and sustainable mobility. \n\nEnviolo designs and develops transmission systems for the fast-growing e-bike market. Headquartered in the Netherlands and with additional operations in Austin, Texas, enviolo’s innovative, IP-rich product portfolio and proprietary technology enable cyclists to intuitively adjust the gear ratio, making riding safer and more enjoyable.",
    "valueAcceleration": "Value acceleration \n\nInflexion supported enviolo in refining the go-to-market strategy and with sourcing activities, by leveraging our international network in Asia. We are working to enhance the digital infrastructure and build-out the leadership team, with accelerated investment in new products diversifying its product offering.",
    "stats": []
  },
  {
    "title": "European LifeCare",
    "category": "Healthcare",
    "description": "Vaccination Services",
    "url": "https://www.inflexion.com/portfolio/european-lifecare",
    "img": "https://www.inflexion.com/media/mkjilf4j/eulifecarelogo-preview.jpg?width=526&height=422&v=133656607362770000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Nov 2018",
    "headquarters": "Copenhagen, Denmark",
    "contacts": [
      "Robin Senivassen",
      "Sebastian Sørensen",
      "Andrea Johnson",
      "Jacqueline Phillips",
      "Robin Senivassen",
      "Sebastian Sørensen",
      "Andrea Johnson",
      "Jacqueline Phillips"
    ],
    "quote": "Inflexion’s sector expertise and track record in sourcing and integrating add-on acquisitions make them an invaluable partner for us as we grow our company.",
    "quoteAuthor": "Tanja Sølvkjær Frandsen",
    "aboutText": "About  \n\nFounded in 1998, European LifeCare Group is the largest provider of vaccinations in Europe with operations in Denmark, the UK and the Netherlands.\n\nInflexion has been supporting the business since 2018. Today European LifeCare operates over 77 specialist clinics and is also the preferred partner in delivery of public vaccination programs for the Danish and UK NHS for over 20 years, and more recently to blue-chip pharma companies for vaccine clinical trials.",
    "valueAcceleration": "Value acceleration   \n\nEuropean LifeCare's management team are capitalising on a growing market, benefiting from strong organic growth driven by its D2C marketing and strong reputation with public healthcare systems, alongside pursuing a buy-and-build strategy to increase their number of clinics. Inflexion is leveraging its experience of working with founder-led businesses to source and integrate add-on acquisitions and has helped the business make three material acquisitions within the markets it operates. Inflexion has also introduced an experienced D2C Chair to steer the business and has enhanced the c-suite with new hires.",
    "stats": []
  },
  {
    "title": "FDM Group",
    "category": "Business Services",
    "description": "IT services provider",
    "url": "https://www.inflexion.com/portfolio/fdm-group",
    "img": "https://www.inflexion.com/media/sschqtk0/fdm2v1-1.jpg?width=526&height=422&v=133845406400630000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Dec 2009 - Jun 2014",
    "headquarters": "London, UK",
    "contacts": [],
    "quote": "With Inflexion’s support, we expanded both our geographic reach and breadth of service offering significantly and this strengthened operational platform made FDM Group extremely well-placed to capitalise on the strong growth prospects in the global IT market.",
    "quoteAuthor": "Rod Flavell,",
    "aboutText": "About \n\nThe impressive international growth of family-run IT services company FDM Group following its take-private by Inflexion saw headcount quadruple and profits grow 5x before its LSE flotation generated 16x return.  \n\nFDM Group’s unique business model trains graduates in business and technical pathways at one of FDM Group’s Academies worldwide and then deploys them to clients whilst remaining salaried employees of FDM Group. At the time of the flotation, the company’s list of over 130 multinational blue-chip clients included UBS, Virgin and British Airways.",
    "valueAcceleration": "Value acceleration \n\nManagement wanted a partner to take the business private from London’s Alternative Investment Market, and then work to accelerate growth, particularly in international markets by utilising our international experts. \n\nThroughout our partnership, FDM Group consistently outperformed in its profit growth. This was achieved principally through a significant expansion of the company’s operations and geographic reach, opening new training academies in the US, Canada, China, Hong Kong and Singapore. This expansion drove a significant increase in the number of consultants from 338 at time of investment to in excess of 1,350 across 11 countries at exit. Inflexion also worked closely with the executive team to ensure the business was building solid foundations and the right organisation structure to support such rapid expansion. \n\nThe business floated on the LSE in 2014 with a market capitalisation of over £300m.",
    "stats": [
      {
        "label": "growth in profits",
        "value": "5x"
      },
      {
        "label": "return on investment",
        "value": "16x"
      },
      {
        "label": "growth in headcount",
        "value": "4x"
      }
    ]
  },
  {
    "title": "FDM UK",
    "category": "Technology",
    "description": "Telco data and insights provider",
    "url": "https://www.inflexion.com/portfolio/fdm-uk",
    "img": "https://www.inflexion.com/media/mifnyrsw/fdmv1.png?width=526&height=422&v=133845406400370000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Jul 2024",
    "headquarters": "London",
    "contacts": [
      "Jonathan Ma",
      "Sebastian Sørensen",
      "Molly Hindhaugh",
      "Jonathan Ma",
      "Sebastian Sørensen",
      "Molly Hindhaugh"
    ],
    "quote": "We are excited to start this next phase in FDM’s journey and are thrilled to welcome Inflexion as our new partner. They have proven expertise in scaling data companies which will empower us to expand our market reach, breadth of product offerings, and ability to provide best-in-class datasets, as we continue to deliver unparalleled service for our clients.",
    "quoteAuthor": "Mehul Kotecha",
    "aboutText": "About \n\nFDM UK is the industry leader in providing telecoms market share, pricing and proposition data across Europe. In 2024, Inflexion’s Enterprise Fund V invested in the business to accelerate its global ambitions.\n\nFDM UK has established itself as the industry authority within UK telecoms due to its unrivalled data quality and granularity and at the time of investment was the fastest growing insights agency of its type with 150% growth over the last three years. Its proprietary point-of-sale and real-time pricing datasets provide the most accurate view of market share and brand performance, and are used utilised by every major UK broadband provider, mobile operator and price comparison website, as well as by global manufacturers.",
    "valueAcceleration": "Value acceleration \n\nInflexion will support the continued growth of FDM UK including expanding the company’s geographic reach and product offering, with dedicated investment set aside for strategic M&A and new technologies.",
    "stats": []
  },
  {
    "title": "Finanzen.net",
    "category": "Financial Services",
    "description": "Financial media & neobroker",
    "url": "https://www.inflexion.com/portfolio/finanzennet",
    "img": "https://www.inflexion.com/media/51gfchi1/finanzen-logo-web.png?width=526&height=422&v=133834098793870000&format=webp",
    "status": "Status: Current",
    "sector": "Financial Services",
    "investmentPeriod": "Jan 2025",
    "headquarters": "Karlsruhe, Germany",
    "contacts": [
      "Martin Preuss",
      "Andrea Bertolini",
      "Heng Schiltges",
      "Stefanie Arndt",
      "Martin Preuss",
      "Andrea Bertolini",
      "Heng Schiltges",
      "Stefanie Arndt"
    ],
    "quote": "More than ever, the focus of Finanzen will be on delivering innovative technological solutions for capital markets. I am thrilled that with Inflexion we are partnering with a successful investor who will support us in executing on this strategy with investments in products and technology.",
    "quoteAuthor": "Maximilian von Richthofen",
    "aboutText": "About \n\nIn 2025, Inflexion’s Buyout Fund invested in Finanzen.net, the digital broker and market leading financial information portal in the DACH region, alongside the founders. The business was acquired from Axel Springer, a leading transatlantic media company.\n\nFinanzen.net Group consists of three divisions: high-growth low-cost digital investment platform, also known as a neobroker, called Zero, a capital markets information platform called Finanzen.net, and a trading software platform for semi-professional retail investors called TraderFox.",
    "valueAcceleration": "Value acceleration \n\nInflexion will work with Finanzen.net Group’s founders and management to carve-out the business as a standalone integrated company and drive future growth. In particular, Inflexion will support the launch of additional saver and investing products.",
    "stats": []
  },
  {
    "title": "Flooid",
    "category": "Technology",
    "description": "Unified commerce platform",
    "url": "https://www.inflexion.com/portfolio/flooid",
    "img": "https://www.inflexion.com/media/p2xnnp0p/flooidv1.png?width=526&height=422&v=133845406400030000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Nov 2017 - Jan 2024",
    "headquarters": "Coventry, UK",
    "contacts": [
      "Catherine Richards",
      "Sam McPhail",
      "Olivia Smith",
      "Catherine Richards",
      "Sam McPhail",
      "Olivia Smith"
    ],
    "quote": "Inflexion’s support was very valuable in helping to build our product and software offering as we have scaled the business globally. Joining Glory will help us to reach more retailers with our unified commerce platform.",
    "quoteAuthor": "Diane Palmquist",
    "aboutText": "About \n\nInflexion backed the buyout of Flooid, a market leading cloud-based unified commerce software  provider for retailers. Inflexion supported Flooid's transition to a SaaS business model before it was sold it to a Japanese listed trade buyer in 2023. \n\nFlooid is a global leading cloud-based unified commerce software provider predominantly supporting the retail industry. Inflexion backed the buyout of Flooid in 2017 (then PCMS), before selling its investment in 2023 to Glory Global Solutions (International) Ltd, a wholly-owned subsidiary of Tokyo-listed GLORY Ltd.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s support enabled Flooid to undergo a major period of change with significant investment into the product offering, supporting its successful transition to a SAAS model. A number of new international clients were won with the support of inflexion, enabling Flooid's customer base to expand to over 15 countries across Europe, North America, and South Africa.",
    "stats": []
  },
  {
    "title": "Giacom",
    "category": "Technology",
    "description": "IT, communications and cloud wholesale platform",
    "url": "https://www.inflexion.com/portfolio/giacom",
    "img": "https://www.inflexion.com/media/kd1nnrur/gaicomv1.png?width=526&height=422&v=133845406399770000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Mar 2021",
    "headquarters": "Southampton, UK",
    "contacts": [
      "David Whileman",
      "William An",
      "David Whileman",
      "William An"
    ],
    "quote": "The best PE that I have ever dealt with are the ones that have a bit of emotional intelligence, and that's one of the big things we found with Inflexion. We actually liked the people that we were talking to and they understood what we were trying to achieve.",
    "quoteAuthor": "Matthew Riley",
    "aboutText": "About \n\nInflexion made a minority investment in IT, communications and cloud wholesale platform Giacom to carve it out from Daisy Group in 2021. \n\nGiacom (previously Digital Wholesale Solutions) provides cloud, communications, mobile and IT products and services on a wholesale basis to over 6,000 UK partners from vendors including Vodafone, O2, BT/EE, Microsoft, and Virgin Media Business. Its services are targeted at resellers serving SMEs typically employing 10 to 250 people.",
    "valueAcceleration": "Value acceleration  \n\nInflexion's minority investment allowed Giacom to become an independent entity as it continues to pursue its strategy of being the partner of choice across the industry, providing an integrated platform for resellers to provide the very best solutions to their customers. This is becoming increasingly important as market disruptions such as the move to cloud, 5G, fibre to the premises and the “work from anywhere” trend drive SMEs to invest in digital technology. The initial focus was on integrating pre-investment acquisitions and on creating the clear market-leading platform experience for resellers, with a new CTO brought in to steer the value creation plan. Inflexion sourced an experienced non-exec and has worked on improving the company’s go-to-market strategy and value proposition.",
    "stats": []
  },
  {
    "title": "Glide",
    "category": "Technology",
    "description": "Broadband and digital media provider",
    "url": "https://www.inflexion.com/portfolio/glide",
    "img": "https://www.inflexion.com/media/haam1aat/glide-group-400x400.png?width=526&height=422&v=133631193650930000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Oct 2013 - Jun 2020",
    "headquarters": "London, UK",
    "contacts": [
      "Catherine Richards",
      "Catherine Richards"
    ],
    "quote": "Inflexion’s strong experience in the technology and telecoms sector has been invaluable as we have grown. With their support we were able to successfully complete two transformational strategic acquisitions, making Glide a national leader in our target markets.",
    "quoteAuthor": "Tim Pilcher",
    "aboutText": "About \n\nGlide’s partnership with Inflexion saw it build the UK’s largest private fibre network through organic and acquisitive growth before Alinda Capital bought the business in 2020. \n\nGlide designs, installs and manages fibre networks required to deliver broadband connectivity together with other critical products and services to student accommodation, the private rental sector and SMEs. Inflexion’s investment in 2013 (then CableCom) helped the company to build the UK’s leading network reaching 100,000 premises and approximately 250,000 customers.",
    "valueAcceleration": "Value acceleration \n\nAt the time of investment, the management of Glide (then CalbleCom) were looking for an investor to help extend capacity and improve services.  The partnership saw Glide develop into a unique national asset with a 160% EBITDA boost. Inflexion supported the expansion of the business through two strategic high-growth acquisitions: Glide, expanded the range of services provided, and WarwickNet expanded the customer base into the business sector and provided access to a fibre network installation capability. We also supported significant investment into building a national network and market leading position.",
    "stats": [
      {
        "label": "EBITDA Growth",
        "value": "160%"
      },
      {
        "label": "transformational acquisitions",
        "value": "2x"
      }
    ]
  },
  {
    "title": "Global Reach Group",
    "category": "Financial Services",
    "description": "Payment and hedging services",
    "url": "https://www.inflexion.com/portfolio/global-reach-group",
    "img": "https://www.inflexion.com/media/to1ksf4f/globalreachgroupv1.jpg?width=526&height=422&v=133845406402200000&format=webp",
    "status": "Status: Realised",
    "sector": "Financial Services",
    "investmentPeriod": "Mar 2016 - Jan 2023",
    "headquarters": "London, UK",
    "contacts": [
      "Catherine Richards",
      "Catherine Richards"
    ],
    "quote": "Inflexion’s experience in M&A and internationalisation was key for Global Reach Group, and has helped to grow it into the high quality and international platform that it is today.",
    "quoteAuthor": "Nicholas Fullerton",
    "aboutText": "About \n\nWith Inflexion’s backing between 2016 and 2023, foreign exchange specialist Global Reach Group transformed into a high-quality and international platform capable of scaling rapidly. Inflexion exited the business to US listed FLEETCOR. \n\nGlobal Reach Group provides payments and hedging services to businesses and private individuals. The business helps over 1,500 clients manage their cross-border payments and foreign exchange exposure through a range of product solutions. The firm offers corporate payment solutions in more than 80 currencies and nearly 200 countries.",
    "valueAcceleration": "Value acceleration \n\nInflexion used its internationalisation and M&A expertise to support the expansion of the business. This included the acquisitions of the assets of EncoreFX a Canadian corporate cross-border payments business and an international money transfer and payment solutions provider, as well as the opening of offices in Amsterdam and Madrid.",
    "stats": [
      {
        "label": "new markets entered",
        "value": "2"
      },
      {
        "label": "acquisitions",
        "value": "2x"
      }
    ]
  },
  {
    "title": "GlobalData Healthcare",
    "category": "Technology",
    "description": "A subscription service healthcare data platform",
    "url": "https://www.inflexion.com/portfolio/globaldata-healthcare",
    "img": "https://www.inflexion.com/media/3txmuh5c/globaldatav1.jpg?width=526&height=422&v=133845406401600000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Jun 2024",
    "headquarters": "",
    "contacts": [
      "David Whileman",
      "Sergio Ferrarini",
      "Cameron Lenton",
      "David Whileman",
      "Sergio Ferrarini",
      "Cameron Lenton"
    ],
    "quote": "This is a significant milestone in GlobalData’s evolution and we are delighted to welcome Inflexion as a shareholder in our Healthcare division. This investment highlights the significant value in our unique data platform and gives us the flexibility to launch a more ambitious approach to growth investment across our portfolio. We believe that we can create substantial value for all shareholders and accelerate GlobalData’s profitable growth over the coming years.",
    "quoteAuthor": "Mike Danson",
    "aboutText": "About \n\nInflexion carved-out GlobalData’s healthcare business in 2024, with the investment made from Inflexion’s Partnership Capital Fund III.  \n\nGlobalData Healthcare is a healthcare data platform and the largest division of AIM-listed GlobalData, headquartered in the UK and employing over 1,000 people across 10 countries. Its subscription service offers a one-stop data solution for over 2,000 global customers across large global pharma, pharma & biotech, pharma suppliers, professional services and medical devices manufacturers.\n\nInflexion partnered with GlobalData to carve out its Healthcare division as a standalone entity, allowing GlobalData to retain a majority stake in the business.",
    "valueAcceleration": "Value acceleration \n\nGlobalData and Inflexion are working together to accelerate organic growth primarily through securing new clients globally and further cross-selling to existing clients, continuing to invest in the product and content, as well as pursuing selective M&A. With the addition of a new pricing and packaging initiative and also supporting on talent with new senior leadership hires.",
    "stats": []
  },
  {
    "title": "Goals Soccer Centres",
    "category": "Consumer",
    "description": "Football centre operator",
    "url": "https://www.inflexion.com/portfolio/goals-soccer-centres",
    "img": "https://www.inflexion.com/media/rzzdixi3/goalsv1.jpg?width=526&height=422&v=133845406402430000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Oct 2019 - Jun 2022",
    "headquarters": "Glasgow, UK",
    "contacts": [
      "Rob Dagger",
      "Nick Davies",
      "Rob Dagger",
      "Nick Davies"
    ],
    "quote": "The partnership with Inflexion enabled us to return to the business we love. The business is well placed for future growth and to continue to offer a healthy way of socialising for people across the UK.",
    "quoteAuthor": "Barry and Ian McDermott",
    "aboutText": "About \n\nGoals Soccer Centres is the UK’s leading operator of small-sided football centres, and Inflexion’s backing between 2019 and 2022 allowed the founders to return to the business.  \n\nGlasgow-based Goals was founded in 1987 and operates more than 400 5-a-side and 7-a-side flood-lit football arenas across 44 locations, promoting health, fitness, friendly competition, and community spirit.",
    "valueAcceleration": "Value acceleration \n\nInflexion backed the business’s founders to return to the business they established over thirty years ago. We used our expertise to support the management team to improve the efficiency of the business, invested in their facilities including the installation of the latest ProTurf pitch surfaces and enhance their digital offering by launching a new website and mobile app. We also supported the team during the challenges of COVID ensuring the business continued to perform strongly.",
    "stats": [
      {
        "label": "EBITDA",
        "value": "3x"
      },
      {
        "label": "EBITDA Margin",
        "value": "2x"
      }
    ]
  },
  {
    "title": "Goat Agency",
    "category": "Business Services",
    "description": "Influencer marketing agency",
    "url": "https://www.inflexion.com/portfolio/the-goat-agency",
    "img": "https://www.inflexion.com/media/ijxibgjd/goat-website.png?width=526&height=422&v=133634450861030000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services, Consumer",
    "investmentPeriod": "Mar 2021 - Mar 2023",
    "headquarters": "London, UK",
    "contacts": [
      "Tom Pemberton",
      "James Stevens",
      "David Collins",
      "Tom Pemberton",
      "James Stevens",
      "David Collins"
    ],
    "quote": "Inflexion offered us tremendous support as we scaled the business in the UK and internationally. In particular, their knowledge of the US market and strong digital capabilities added significant value.",
    "quoteAuthor": "Arron Shepherd",
    "aboutText": "About  \n\nInflexion backed the visionary co-founders of influencer and social media marketing agency Goat during a period of incredible growth and internationalisation, with EBITDA and US revenues tripling before its sale to WPP.  \n\nGoat specialises in data-led end-to-end influencer and social media marketing campaigns grounded in performance and measurement. It drives authentic brand engagement while integrating targeted paid media to reach the right audience and achieve industry-leading results. The company's 150+ staff across three global offices have helped to grow some of the biggest brands in the world, including Dell, Beiersdorf, Meta, Tesco, Uber, EA, Natura and Augustinus Bader.",
    "valueAcceleration": "Value acceleration  \n\nInflexion’s significant minority investment supported the business to expand globally, with a core focus on the North American market, as well as benefitting from secular market growth drivers. Inflexion’s digital team worked closely with management to embed the use of technology and data into Goat’s proposition, and Inflexion invested in the sales and marketing functions to drive new customer wins, including the largest telecoms players in the world.  \n\nThe growth saw headcount increase significantly and EBITDA and US revenues both triple before Goat was sold in 2023 to WPP, the world's largest advertising company.",
    "stats": [
      {
        "label": "EBITDA Growth",
        "value": "3x"
      },
      {
        "label": "US revenue growth",
        "value": "150%"
      }
    ]
  },
  {
    "title": "Griffin Global",
    "category": "Business Services",
    "description": "Specialist travel services",
    "url": "https://www.inflexion.com/portfolio/griffin-global",
    "img": "https://www.inflexion.com/media/zqkn1ee5/griffin.png?width=526&height=422&v=133586224802630000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Dec 2009 - Nov 2014",
    "headquarters": "London, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion were a supportive and committed investment partner, assisting in Griffin’s consolidation and international expansion. We created a strong global platform from which to continue to expand the business.",
    "quoteAuthor": "Simon Morse",
    "aboutText": "About \n\nSeeking an active minority investor, marine travel services manager Griffin Global worked with Inflexion for five years to create a multinational company before its sale to ATPI. \n\nGriffin is the global market leader in the provision of specialist travel services to the marine and offshore industries, arranging travel for crews rotating onto merchant ships and oil rigs. The business was founded in 1977 and had 750 staff at exit across 32 offices in 22 countries.",
    "valueAcceleration": "Value acceleration \n\nThe initial focus was on integrating the fragmented structure of the company, including buying in joint venture arrangements in Hong Kong and Manila. We then worked closely with the management team to improve operations, including handling succession issues and helping to create robust, professional management structures to support growth. We also helped Griffin to create a single global IT platform, increase its offshore market share and develop an innovative new service. Together we recruited several new senior members of staff for key regional offices to support growth in new product areas and countries.",
    "stats": [
      {
        "label": "return on investment",
        "value": "2.8x"
      }
    ]
  },
  {
    "title": "Halo",
    "category": "Technology",
    "description": "Supplier of optical transceivers",
    "url": "https://www.inflexion.com/portfolio/halo",
    "img": "https://www.inflexion.com/media/fiflhwnt/halo-400x400.png?width=526&height=422&v=133631193633330000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Jun 2017 - Dec 2021",
    "headquarters": "California, USA",
    "contacts": [
      "Jonathan Ma",
      "Jonathan Ma"
    ],
    "quote": "Inflexion’s expertise and support in international growth and M&A was invaluable, enabling us to grow substantially faster than had we undertaken the ambitious journey ourselves. We’d like to thank Inflexion for being such supportive partners.",
    "quoteAuthor": "Matt McCormick",
    "aboutText": "About \n\nInflexion merged two complementary businesses in the UK and US to create the world’s leading compatible optical networking business, Halo Technology. Strong international growth and M&A generated a 6x return when it was sold for $715m to Amphenol Corporation.   \n\nInflexion created Halo in 2017 with its investment in UK business ProLabs and the transformational acquisition of AddOn Computer Peripherals in the US less than six months later. The firms continued to use their existing brands, operating under the California-headquartered Halo umbrella and benefitting from complementary customer bases, production facilities and sales offices in the US, Europe and Asia.",
    "valueAcceleration": "Value acceleration \n\nThe four-year stewardship saw Inflexion build out the leadership team, and support further M&A and organic expansion in India, China and Brazil. Halo was introduced to India’s number one telco company and landed over $10m of revenue from this within a year, while in China, Halo was supported to build strong relationships with core suppliers. Additional M&A also expanded our geographic presence.",
    "stats": [
      {
        "label": "acquisitions",
        "value": "4"
      },
      {
        "label": "increase in profits",
        "value": "10x"
      },
      {
        "label": "return on investment",
        "value": "6x"
      }
    ]
  },
  {
    "title": "Harrington Brooks",
    "category": "Financial Services",
    "description": "Debt management services",
    "url": "https://www.inflexion.com/portfolio/harrington-brooks",
    "img": "https://www.inflexion.com/media/n0nmusrc/hb3.png?width=526&height=422&v=133631193633730000&format=webp",
    "status": "Status: Realised",
    "sector": "Financial Services",
    "investmentPeriod": "Mar 2005 - Jul 2012",
    "headquarters": "Manchester, UK",
    "contacts": [
      "Tim Smallbone",
      "Andrew Mainwaring",
      "Tim Smallbone",
      "Andrew Mainwaring"
    ],
    "quote": "Inflexion was an ambitious and proactive investor and fully supported the management team in developing the business so effectively over our partnership.",
    "quoteAuthor": "Matthew Cheetham",
    "aboutText": "About \n\nInflexion invested in debt management business Harrington Brooks and helped it expand its offering and make five acquisitions before it was sold for 3.2x money. \n\nHarrington Brooks (All Clear Finance when we originally invested) was one of the UK’s largest providers of debt management and consolidation services. The company was founded in 1998 and employed over 400 staff by the time Inflexion exited. Harrington Brooks helped clients with a variety of debt management services, including debt consolidation, re-mortgaging and IVA services, and was sold to RJD Partners in 2012.",
    "valueAcceleration": "Value acceleration \n\nHarrington Brooks’ management team were looking for a partner to help them capitalise on a fast-changing market to help them grow market share. Under Inflexion’s ownership, Harrington Brooks made five acquisitions and entered the IVA market, becoming one of the leading providers of IVAs in the UK. \n\nThe business further broadened its income streams through service lines including utility bills assistance, right-to-buy for council tenants, loan consolidation and financial claims for victims of mis-selling. Inflexion also backed the company in the creation of an innovative B2B model offering back-office administrative services to other debt solution providers.",
    "stats": [
      {
        "label": "customer growth",
        "value": "4x"
      },
      {
        "label": "Return on investment",
        "value": "3.2X"
      }
    ]
  },
  {
    "title": "HKI",
    "category": "Healthcare",
    "description": "Healthcare information services",
    "url": "https://www.inflexion.com/portfolio/hki",
    "img": "https://www.inflexion.com/media/vamosemy/hki.png?width=526&height=422&v=133586225354700000&format=webp",
    "status": "Status: Realised",
    "sector": "Healthcare",
    "investmentPeriod": "Apr 2004 - Jul 2009",
    "headquarters": "Warwickshire, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "We are proud that throughout the period of our ownership HKI has not only grown, but has doubled the number of employees organically. It is now in a position to move forward into its next stage of development and we wish the team every success in the future.",
    "quoteAuthor": "John Hartz,",
    "aboutText": "About \n\nInflexion’s stewardship of public health performance analytics business HKI saw headcount double before it was sold in two parts to Capita Group Plc and UBM for an overall return of 2.6x. \n\nEstablished in 1989, Healthcare Knowledge International (HKI) provides benchmarking and other performance-analytical information to European public health services in order to maximise efficiency and reduce overall costs.",
    "valueAcceleration": "Value acceleration \n\nDuring our ownership, we worked closely with the team to source new markets and clients, optimise tax structuring and introduce formal KPI monitoring. Revenue grew by 110% while employee numbers doubled. We also helped to execute complementary in-fill acquisitions, adding a health audit business, HQS and a pharma data business, CRC.",
    "stats": [
      {
        "label": "revenue growth",
        "value": "110%"
      },
      {
        "label": "headcount growth",
        "value": "2x"
      }
    ]
  },
  {
    "title": "Huws Gray",
    "category": "Industrials",
    "description": "Builders merchants",
    "url": "https://www.inflexion.com/portfolio/huws-gray",
    "img": "https://www.inflexion.com/media/uprpn5gt/huwsgrayv2.jpg?width=526&height=422&v=133845406403830000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Apr 2018 - Jun 2021",
    "headquarters": "Holyhead, Anglesey, UK",
    "contacts": [
      "Richard Booth",
      "Adam Moss",
      "Heng Schiltges",
      "Richard Booth",
      "Adam Moss",
      "Heng Schiltges"
    ],
    "quote": "Inflexion has taken the time to understand our business and how we envisage its future. Had we remained independent, we’d not have achieved what we have. Inflexion gave us the confidence and support to pursue our ambitions.",
    "quoteAuthor": "Terry Owen",
    "aboutText": "About \n\nInflexion’s minority investment supported the transformational growth of Huws Gray to become the largest independent builders merchants in the UK, doubling headcount and profits before its sale to Blackstone.  \n\nHuws Gray was founded in 1990 in Anglesey, Wales, and at the time of the 2021 sale was operating from over 100 trading locations across Wales, East Anglia, the North West of England, the Midlands and Yorkshire, with over 1,800 staff. The business is a one-stop shop for small contractors or independent builders, offering comprehensively stocked branches to ensure that customers can get what they need when they need it.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s extensive M&A experience supported management's buy-and-build strategy. Within six months of the original investment, Inflexion originated and executed the transformational acquisition of Ridgeons to double Huws Gray's revenues. This was followed by a further 15 acquisitions. Ultimately the partnership saw the footprint of the business nearly double to over 100 branches with a significantly broadened geographical footprint. Headcount more than doubled from 800 to 1,800.  \n\nThroughout the entire hold period, Huws Gray remained majority owned and led by the existing founder-led management team.",
    "stats": [
      {
        "label": "increase in profits",
        "value": "2.5x"
      },
      {
        "label": "increase in stores",
        "value": "2x"
      }
    ]
  },
  {
    "title": "ICS",
    "category": "Healthcare",
    "description": "Temporary staffing solutions",
    "url": "https://www.inflexion.com/portfolio/ics",
    "img": "https://www.inflexion.com/media/xtyjsz0y/ics-website.png?width=526&height=422&v=133634602496030000&format=webp",
    "status": "Status: Realised",
    "sector": "Healthcare",
    "investmentPeriod": "Aug 2008 - Jun 2010",
    "headquarters": "Bristol, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion impressed us with their strong commitment to this deal and straightforward, open and honest approach.",
    "quoteAuthor": "Gary Spellins",
    "aboutText": "About \n\nTemporary healthcare staffing business ICS partnered with Inflexion to expand across the UK. A return of 2.9x was generated in under two years when it was sold to Blackstone. \n\nICS is the leading provider of temporary healthcare staff in the UK, specialising in placing scarce senior and high-grade nurses, while the business’ complex community care business also provides nursing services to patients in their homes.",
    "valueAcceleration": "Value acceleration \n\nFollowing the transaction, we worked closely with ICS to refocus the business on complex care, largely owing to the sector’s potential for high recurring revenue, strong demand and protection from government cuts. During our ownership, the high-value complex care business grew by around 40%. \n\nWith our support, management continued to enhance the performance of the business incrementally, delivering significant growth and continued margin enhancement.",
    "stats": [
      {
        "label": "IRR",
        "value": "78%"
      },
      {
        "label": "growth in complex care business",
        "value": "40%"
      }
    ]
  },
  {
    "title": "Ideal Shopping Direct",
    "category": "Consumer",
    "description": "Multi-channel retailer",
    "url": "https://www.inflexion.com/portfolio/ideal-shopping-direct",
    "img": "https://www.inflexion.com/media/02ufpwuz/ideal-shopping-400x400.png?width=526&height=422&v=133631193634070000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Jun 2011 - Nov 2015",
    "headquarters": "Peterborough, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "I would like to thank Inflexion for its support and commitment to our business over our four-year partnership, during which time we expanded our offering both in the UK and overseas.",
    "quoteAuthor": "Mike Hancox",
    "aboutText": "About \n\nWishing to come off London’s AIM and focus on its IT infrastructure, Ideal Shopping Direct (ISD) partnered with Inflexion. The partnership saw the company grow and establish a presence in the US before being sold to Blackstone. \n\nISD is one of the UK’s leading multi-channel home shopping retailers, selling via TV and online. Ideal Shopping Direct operates in two distinct and growing markets, TV shopping and the craft and hobbyist market, selling a variety of popular lifestyle products through its channels as well as multiple websites.",
    "valueAcceleration": "Value acceleration \n\nOur strategy focused on accelerating growth through targeted acquisitions and international expansion. Deramores and Craft Channel Productions were both acquired and integrated into the business, extending Ideal Shopping Direct’s offering. During our ownership, craft club members increased from 55,000 to 90,000.  \n\nInflexion also helped ISD establish its presence in the US through a partnership with a local distributor and the launch of a dedicated US TV channel, helping it to access c. 40 million US households. ISD also undertook a digital audit to inform the development of the company’s websites and trading platforms and enhance its multi-channel offering. \n\nDuring our stewardship, employee numbers grew from over 580 at investment to more than 820 at exit. Inflexion generated a total realised return on investment of 2.6x.",
    "stats": [
      {
        "label": "return on investment",
        "value": "2.6x"
      },
      {
        "label": "headcount growth",
        "value": "42%"
      }
    ]
  },
  {
    "title": "Ilchester Cheese",
    "category": "Consumer",
    "description": "Specialist cheese manufacturer",
    "url": "https://www.inflexion.com/portfolio/ilchester-cheese",
    "img": "https://www.inflexion.com/media/xhfbqfgf/cheesev1.png?width=526&height=422&v=133845406404130000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Dec 2004 - Nov 2008",
    "headquarters": "Somerset, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion were consistently ready to invest in developing the business and this put Ilchester in very good shape for the next phase of its growth. Inflexion are quick and non-bureaucratic in making decisions – great when running a fast-moving business.",
    "quoteAuthor": "Jonathan Smith,",
    "aboutText": "About \n\nInflexion worked closely with Ilchester Cheese Company management to grow exports before it was bought by Tine, Norway’s largest Norwegian milk co-operative and makers of Jarlsberg cheese, generating 2.7x money.  \n\nIlchester Cheese is the leading producer of blended cheese in the UK. Founded in 1962, Ilchester was the first British cheese company to blend cheeses with other ingredients. Having created the market, Ilchester has continued to innovate selling some 50 products within the UK and exporting to over 20 countries around the world.",
    "valueAcceleration": "Value acceleration \n\nWe partnered with the management team to source and recruit a number of senior staff with the skills and experience required to take the business forward. We also supported Ilchester’s investment in exporting and new product development, helping to ensure the company was ideally positioned to attract an international buyer. \n\nUnder our ownership, Ilchester cemented its position as market leader in the UK blended cheese market, with the company achieving an 11% sales CAGR over the investment period. \n\nWe realised our investment in Ilchester in November 2008, selling the business to Tine, Norway’s largest milk cooperative, generating a 2.7x return on investment.",
    "stats": [
      {
        "label": "return on investment",
        "value": "2.7x"
      },
      {
        "label": "revenue growth",
        "value": "40%"
      }
    ]
  },
  {
    "title": "Infront",
    "category": "Technology",
    "description": "Financial market data and software",
    "url": "https://www.inflexion.com/portfolio/infront",
    "img": "https://www.inflexion.com/media/0qyj2dbj/inf_mark_rgb_col-crop.png?width=526&height=422&v=133637839681500000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Jun 2021",
    "headquarters": "Oslo, Norway",
    "contacts": [
      "Sergio Ferrarini",
      "Rob Dagger",
      "Daan de Bruin",
      "Sergio Ferrarini",
      "Rob Dagger",
      "Daan de Bruin"
    ],
    "quote": "With Inflexion we know we can focus on both organic growth opportunities including product development and investments, but also M&A, and that we have the right partner on board. It really made a lot of sense.",
    "quoteAuthor": "Zlatko Vucetic",
    "aboutText": "About \n\nInflexion delisted financial data software provider Infront from the Oslo Stock Exchange in 2021, and since then has supported with talent and tech build-out as well as M&A.  \n\nInfront provides a suite of data and software solutions that allow financial institutions to manage investment decisions, reduce costs and comply with changing market requirements. The company serves more than 3,500 customers with over 70,000 professional users and employs 450+ people across 9 countries in Europe.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s talent team has substantially built out the leadership team, including the appointment of an experienced Chair. Additionally, Inflexion’s digital and commercial teams are involved with a significant technology integration project and a commercial review of product portfolio and value proposition strategies respectively. Inflexion’s M&A experience has also supported inorganic growth, with the acquisition of Assetmax in Switzerland strengthening Infront’s DACH WealthTech position.",
    "stats": []
  },
  {
    "title": "ITM",
    "category": "Business Services",
    "description": "Pensions and financial services data",
    "url": "https://www.inflexion.com/portfolio/itm",
    "img": "https://www.inflexion.com/media/fqbckvga/itm.png?width=526&height=422&v=133631193628870000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services, Financial Services",
    "investmentPeriod": "May 2018 - Jul 2024",
    "headquarters": "London, UK",
    "contacts": [
      "Andrew Mainwaring",
      "Andrew Mainwaring"
    ],
    "quote": "We are a stronger and more agile organisation after our work with Inflexion, with their value acceleration and international teams a real support.",
    "quoteAuthor": "Mark Lecompte",
    "aboutText": "About \n\nInflexion backed the buyout of ITM, a data services and technology specialist for the pensions market in 2018 and has created a platform of scale in the life & pensions market.\n\nITM specialises in technology-led data audit, management, administration and migration services, working with pension funds, providers, trusts and administrators as well as other financial institutions. The company utilises proprietary software and specialist expertise to provide critical and complex data services for its blue-chip clients.",
    "valueAcceleration": "Value acceleration \n\nITM’s partnership with Inflexion saw it strengthen its offering in the life & pensions market, providing proprietary software and technology-enabled services including data audit, management, administration and migration to its blue-chip client base. In response to a changing regulatory market, Inflexion supported ITM to complete three acquisitions and launch new services and software products.  Inflexion’s local expert supported the business to expand its back office operations into India.",
    "stats": []
  },
  {
    "title": "Jack Wills",
    "category": "Consumer",
    "description": "Premium clothing retailer",
    "url": "https://www.inflexion.com/portfolio/jack-wills",
    "img": "https://www.inflexion.com/media/okqmxjw5/jackwills.png?width=526&height=422&v=133586224148630000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Jul 2007 - Sep 2016",
    "headquarters": "London, UK",
    "contacts": [
      "David Whileman",
      "David Whileman"
    ],
    "quote": "",
    "quoteAuthor": "",
    "aboutText": "About \n\nInflexion’s minority backing of fashion retailer Jack Wills helped it to expand across four continents and quadruple its number of shops. \n\nJack Wills is a premium fashion retailer of ‘Fabulously British’ casual wear, homeware and accessories for the 16-to-24-year-old market.",
    "valueAcceleration": "Value acceleration \n\nFollowing our investment, we introduced the team to a number of retail entrepreneurs with strong international credentials. In addition, we worked closely with the company’s founders to build out the management team to support future growth.  \n\nWe helped to establish the brand’s presence in the US and Hong Kong as well as through franchises in the Middle East, with the store numbers growing from 21 in the UK to over 80 across four continents. This expansion meant headcount grew significantly, increasing 13x to reach 1,900 FTEs across four continents. Having professionalised the business, we also put in place the right infrastructure for growth and helped accelerate the brand’s digital evolution.",
    "stats": [
      {
        "label": "store growth from 21",
        "value": "81%"
      },
      {
        "label": "headcount growth",
        "value": "13x"
      }
    ]
  },
  {
    "title": "K2 Partnering",
    "category": "Business Services",
    "description": "Global resourcing specialists",
    "url": "https://www.inflexion.com/portfolio/k2-partnering-solutions",
    "img": "https://www.inflexion.com/media/4wiixhdn/k2v1.png?width=526&height=422&v=133845406404230000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Jul 2022",
    "headquarters": "London, UK",
    "contacts": [
      "Isabelle Pagnotta",
      "Sam McPhail",
      "Umberto Massucco",
      "Maximilian Schneider",
      "Isabelle Pagnotta",
      "Sam McPhail",
      "Umberto Massucco",
      "Maximilian Schneider"
    ],
    "quote": "We’ve taken our business to the next level with Inflexion’s support, deep sector knowledge and international presence invaluable to our growth. K2’s expertise, passion and ambition combined with Inflexion’s support has created a best-in-class provider of human capital solutions in the Enterprise applications space.",
    "quoteAuthor": "Antonio Gulino",
    "aboutText": "About \n\nInflexion has helped enterprise software specialist K2 develop an international offering of scale since 2017, supporting two international acquisitions as a minority partner before reinvesting in 2022.  \n\nK2 Partnering Solutions is a global leader in the enterprise software market, providing specialist advisory and resource solutions to clients seeking to transform the businesses through use of the latest technology. The firm’s long-standing reputation in enterprise software consulting builds on deep in-house expertise and leverages a network of over 1m subject matter experts to support 500+ clients across 29 offices around the world.",
    "valueAcceleration": "Value acceleration \n\nInflexion has worked with K2 to develop an international offering of scale, completing acquisitions in the US, Asia, and Europe to broaden its product and geographic offering. \n\nInflexion also supported significant investment into talent, pricing, technology, and infrastructure, while Inflexion’s local teams provided strong on-the-ground expertise in North America and Latin America. Inflexion’s Latin America team also provided significant support to K2 which helped grow the business in this key market. \n\nInflexion is continuing to support K2's ambitious growth plans in a fast-growing international market. Furthermore, our AI team are engaged in supporting the business to capture the opportunity presented by AI in the global technology market.",
    "stats": []
  },
  {
    "title": "Kynetec",
    "category": "Business Services",
    "description": "Agricultural data and market information",
    "url": "https://www.inflexion.com/portfolio/kynetec",
    "img": "https://www.inflexion.com/media/tuejjoxb/kynetec.png?width=526&height=422&v=133631193638370000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "May 2016 - Mar 2021",
    "headquarters": "Newbury, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion’s support made the acquisition of Kleffmann Group possible as part of our journey to become a global market leader of data and insights in agriculture and animal health.",
    "quoteAuthor": "Daniel Wirth",
    "aboutText": "About \n\nInflexion carved Kynetec out of its listed German parent GfK and supported international expansion and acquisition-led growth, including the transformational purchase of Germany-based Kleffmann.  \n\nKynetec delivers innovative data-driven market information to the agriculture and animal health markets, providing detailed insight into their customers’ end markets and strategic opportunities. The business serves a wide range of long-standing blue-chip customers and in 2021 was sold to a US investor.",
    "valueAcceleration": "Value acceleration \n\nWe used our carve-out experience, internationalisation and M&A expertise to drive growth for Kynetec. After a complex carve-out from a German corporate, Inflexion established Kynetec as an independent standalone company and strengthened the firm’s operations in North and South America, Asia and Europe, resulting in a global business operating in 30 countries.  \n\nOur M&A experience helped Kynetec to complete the transformational purchase of Germany-based Kleffmann, its largest competitor, as well as four additional complementary acquisitions to add new geographies and products, while our international expert in Brazil supported the opening of Kynetec's Latin American business.",
    "stats": [
      {
        "label": "EBITDA growth",
        "value": "200%"
      },
      {
        "label": "acquisitions",
        "value": "5"
      }
    ]
  },
  {
    "title": "Lane Clark & Peacock",
    "category": "Business Services",
    "description": "Financial and business consultants",
    "url": "https://www.inflexion.com/portfolio/lane-clark-peacock",
    "img": "https://www.inflexion.com/media/4weo1dtw/lane-400x400.png?width=526&height=422&v=133586222530330000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Dec 2016 - Jan 2021",
    "headquarters": "London, UK",
    "contacts": [
      "David Whileman",
      "Philip Edmans",
      "Adam Moss",
      "David Whileman",
      "Philip Edmans",
      "Adam Moss"
    ],
    "quote": "Inflexion gave us just the right amount of support during our successful four-year partnership, enabling us to regain majority ownership of the business and letting us run our business while they acted as a sounding board.",
    "quoteAuthor": "Aaron Punwani",
    "aboutText": "About \n\nInflexion’s Partnership Capital enabled the partners of financial consultancy Lane Clark & Peacock to return the business to independence and grow revenues by 50% before a sale to Charterhouse Capital Partners.  \n\nFounded in 1947, Lane Clark & Peacock (LCP) provides expert investment and general consulting advice to c. 650 corporate and pension trustee clients that include almost half of the FTSE 100 as well as insurance companies and charities. It was formerly part of Alexander Forbes, a large pan-African financial services group. We exited in 2021 to another investor, which facilitated the partners in enabling them to further increase their majority stake.",
    "valueAcceleration": "Value acceleration \n\nDuring the partnership, LCP consolidated its market position as the leading independent provider of pension and investment consulting services. Inflexion then helped the business through providing access to the Inflexion network and supporting initiatives such as new business development and investment into organic growth, as well as assisting them with evaluating acquisition opportunities. Expert headcount increased from c. 600 to nearly 800. LCP also increased its investments into broader revenue streams such as insurance, energy and analytics. Four years of strong growth together resulted in revenues increasing by over 50% and pension scheme assets under advice increasing from c. £100bn to c. £245bn.",
    "stats": [
      {
        "label": "revenue growth",
        "value": "50%"
      },
      {
        "label": "increase in assets under advice",
        "value": "150%"
      }
    ]
  },
  {
    "title": "Lintbells",
    "category": "Healthcare",
    "description": "Nutritional supplements for pets",
    "url": "https://www.inflexion.com/portfolio/lintbells",
    "img": "https://www.inflexion.com/media/imeo5gey/lintbellsv1.png?width=526&height=422&v=133845406404700000&format=webp",
    "status": "Status: Realised",
    "sector": "Healthcare, Consumer",
    "investmentPeriod": "Dec 2017 - Jul 2024",
    "headquarters": "Weston, UK",
    "contacts": [
      "Tom Pemberton",
      "Robin Senivassen",
      "Toby Lane",
      "Tom Pemberton",
      "Robin Senivassen",
      "Toby Lane"
    ],
    "quote": "Inflexion’s backing and partnership enabled us not only to achieve our goals more quickly but to aspire to even greater ones. Their network was invaluable in expanding our digital capabilities and bringing our supplements to the US.",
    "quoteAuthor": "Fiona Hope",
    "aboutText": "About  \n\nInflexion invested in Lintbells, a globally recognised leader in pet supplements in 2017, before selling it in 2024 to Vetnique Labs, backed by Gryphon Investors.   \n\nHertfordshire, UK-based Lintbells was founded almost two decades ago by Dr John Howie DL and John Davies, to provide pets and their owners with scientifically supported supplements to support chronic health conditions. Lintbells’ products are sold under the YuMOVE brand umbrella, encompassing the UK’s number one joint mobility supplement for dogs and cats, as well as supplements to support digestive health, anxiety, skin & coat and dental.",
    "valueAcceleration": "Value acceleration   \n\nSince the 2017 investment, Inflexion has supported Lintbells in several key areas, including expanding its direct-to-consumer channel and facilitating its entry into the US market, both organically and through acquiring Walkin’ Pets.\n\nInflexion also assisted Lintbells in achieving B Corp accreditation, highlighting its ESG accomplishments. Additionally, they facilitated the planned succession of Co-founder John Howie, with Fiona Hope joining as Chief Commercial Officer and becoming CEO in 2022.",
    "stats": []
  },
  {
    "title": "Marley",
    "category": "Industrials",
    "description": "Roofing materials",
    "url": "https://www.inflexion.com/portfolio/marley",
    "img": "https://www.inflexion.com/media/43ris30c/marleyv1.png?width=526&height=422&v=133845406404600000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Aug 2019 - May 2022",
    "headquarters": "Staffordshire, UK",
    "contacts": [
      "Richard Booth",
      "Adam Moss",
      "Richard Booth",
      "Adam Moss"
    ],
    "quote": "Inflexion have been a tremendous partner and we’ve achieved so much together in under three years, helping us establish as a standalone business and strengthen our product offering. We are incredibly grateful for their support.",
    "quoteAuthor": "David Speakman",
    "aboutText": "About \n\nInflexion led the carve-out of roofing specialist Marley before nearly doubling EBITDA and supporting its ESG journey. The business was sold to FTSE 250 Marshalls plc, generating 3.5x money. \n\nMarley is the UK leading manufacturer and supplier of roofing system products, including concrete and clay tiles as well as associated roofing accessories employing 500 people across five manufacturing sites and two distribution centres.",
    "valueAcceleration": "Value acceleration \n\nInflexion used its extensive industry experience with builders merchants Huws Gray to successfully drive growth for Marley. During Inflexion’s stewardship, Marley was established as an independent business, with Inflexion driving the transition to a standalone IT system, building out the talent, and driving EBITDA by optimising Marley’s commercial strategy and supporting investment into a new tile line.  \n\nInflexion enhanced Marley’s ESG credentials, with carbon emissions intensity significantly reduced, 100% of production waste recycled and all manufacturing energy sourced from renewable sources. We supported Marley’s entry into solar panels with the acquisition of Viridian Solar.",
    "stats": [
      {
        "label": "return on investment",
        "value": "3.5x"
      },
      {
        "label": "IRR",
        "value": "58%"
      },
      {
        "label": "renewably sourced energy",
        "value": "100%"
      }
    ]
  },
  {
    "title": "Mecenat",
    "category": "Technology",
    "description": "Closed user group consumer marketplace",
    "url": "https://www.inflexion.com/portfolio/mecenat",
    "img": "https://www.inflexion.com/media/wqhf3iqz/mecenat-logo-web.png?width=526&height=422&v=133834134785970000&format=webp",
    "status": "Status: Current",
    "sector": "Technology, Consumer",
    "investmentPeriod": "Dec 2024",
    "headquarters": "Stockholm",
    "contacts": [
      "James Stevens",
      "Sebastian Sørensen",
      "John Persson",
      "James Stevens",
      "Sebastian Sørensen",
      "John Persson"
    ],
    "quote": "Mecenat has experienced tremendous growth over the past few years. We look forward to the next chapter in our development and partnering with the team at Inflexion.",
    "quoteAuthor": "Jonas Odéhn",
    "aboutText": "About\n\nMecenat is a leading closed user group consumer loyalty platform, headquartered in Sweden. In 2024, Inflexion's Enterprise Fund invested in Mecenat to accelerate the business's growth. \n\nMecenat is a digitally-led, omni-channel marketplace which connects students, alumni, young professionals and seniors with well-known brands by providing access to exclusive offers, career services and relevant events. Operating across five main business areas in Sweden and Finland, the Group takes pride in connecting almost three million members with more than 700 local and global brands, creating savings for key consumer groups, who are in turn early in their loyalty and lifetime journey with brands.\n\nMecenat’s platform spans diverse industries, including Technology, Fashion, Travel and Entertainment and includes key partners such as Apple, Hotels.com and H&M. Its services are primarily digital, allowing for a two-way exchange between brands and members through Mecenat’s apps and websites. In recent years, Mecenat has expanded through the acquisitions of Seniordays, Frank Students and Traineeguiden, adding both geographic and demographic reach as well as a new vertical within career services.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s digital team will work with the business to advance its technology, data and product offering, which will improve the user experience for members and unlock more value for consumers and brands alike. Inflexion’s significant M&A experience will allow the business to continue with this successful growth strategy, and its international offices will help to identify attractive targets in new markets.",
    "stats": []
  },
  {
    "title": "Medik8",
    "category": "Consumer",
    "description": "Premium skincare products",
    "url": "https://www.inflexion.com/portfolio/medik8",
    "img": "https://www.inflexion.com/media/h0mpptkj/medik8-logo.png?width=526&height=422&v=133631193666000000&format=webp",
    "status": "Status: Current",
    "sector": "Consumer",
    "investmentPeriod": "Feb 2021",
    "headquarters": "Hertfordshire, UK",
    "contacts": [
      "Tom Pemberton",
      "Jack Weller",
      "Francesca Farrell",
      "Tom Pemberton",
      "Jack Weller",
      "Francesca Farrell"
    ],
    "quote": "We are thrilled to partner with Inflexion who have the passion and expertise to help us accelerate the brand’s international ambitions.",
    "quoteAuthor": "Elliot Isaacs",
    "aboutText": "About \n\nSince its 2021 investment, Inflexion has supported premium science-backed skincare brand Medik8 to boost its D2C proposition, launch a new innovation centre and enter the US.",
    "valueAcceleration": "Value acceleration \n\nInflexion is working with the Medik8 management team to scale the business further through enhancing their digital routes to market, with a data lake improving analytics and boosting the high growth D2C channel. Inflexion's international experts have supported launches in the US, with a new team built out to drive Amazon and D2C sales. Inflexion’s talent team sourced an NED, Chair and CEO and supported an organisational redesign to support the founder’s succession plan. \n\nInflexion supported significant investment into a new innovation centre built by a net zero construction company in 2022, and Inflexion’s ESG team supported Medik8’s successful B Corp certification.",
    "stats": []
  },
  {
    "title": "Medivet",
    "category": "Healthcare",
    "description": "Veterinary services",
    "url": "https://www.inflexion.com/portfolio/medivet",
    "img": "https://www.inflexion.com/media/0nxnjbej/medivetv1.png?width=526&height=422&v=133845406404370000&format=webp",
    "status": "Status: Realised",
    "sector": "Healthcare",
    "investmentPeriod": "Dec 2016 - Sep 2021",
    "headquarters": "London, UK",
    "contacts": [
      "Andrew Neville",
      "Andrew Neville"
    ],
    "quote": "Inflexion was the perfect partner for Medivet as it accelerated its UK expansion both organically and via acquisition, and expanded overseas into Germany and Spain.",
    "quoteAuthor": "Deirdre Burns",
    "aboutText": "About \n\nInflexion’s Partnership Capital minority funding helped double the number of staff and sites at Medivet, a veterinary business, before it was sold to CVC Capital Partners. \n\nMedivet is a highly regarded pet-care business comprised of a community of vets, nurses and other related professionals operating a hub-and-spoke model of 18 main centres and over 300 first opinion practices.  \n\nThe business has capitalised on industry deregulation that stimulated market consolidation, successfully expanding by acquiring practices across the UK.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s understanding of the market gleaned through its investment in Kynetec combined with its extensive buy-and-build experience made it a good fit for Medivet. \n\nDuring the partnership, Inflexion helped strengthen the leadership team and provided marketing and digital expertise to drive customer experience and develop new branch software. \n\nMedivet significantly increased its number of sites and employees through an ambitious programme of organic and M&A growth. Inflexion supported the expansion of Medivet into Europe with the acquisition of over 40 practices in Germany and Spain. Overall sites doubled to more than 350 across the UK and Europe with headcount doubling to over 3,000.",
    "stats": [
      {
        "label": "increase in sites",
        "value": "2x"
      },
      {
        "label": "increase in headcount",
        "value": "2x"
      }
    ]
  },
  {
    "title": "Mobica",
    "category": "Technology",
    "description": "Software development",
    "url": "https://www.inflexion.com/portfolio/mobica",
    "img": "https://www.inflexion.com/media/g5vdur0r/mobica.png?width=526&height=422&v=133631193645700000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Sep 2015 - Mar 2023",
    "headquarters": "Wilmslow, UK",
    "contacts": [
      "Catherine Richards",
      "Olivia Craig",
      "Catherine Richards",
      "Olivia Craig"
    ],
    "quote": "Inflexion have great industry expertise, geographic reach and capital for further acquisitions, as well as a strong understanding of the importance of maintaining a business' vision and culture. They are not just an investor but a partner.",
    "quoteAuthor": "Sam Kingston",
    "aboutText": "About \n\nGlobal software development and integration services specialist Mobica grew through minority investment from Inflexion with the sale to NASDAQ-listed Cognizant generating 5.6x money.  \n\nMobica provides Talent as a Service across the full software development cycle, with core competencies in development, implementation, testing and deployment of embedded software, and a specialisation in clients' strategic internal research and development projects. The Manchester-based firm operates out of the UK, Europe and the US and counts blue-chip clients among its customer base including Google, Arm, Dyson, Meta, BMW, Samsung and Vodafone.",
    "valueAcceleration": "Value acceleration \n\nInflexion invested in the founder-owned business to support its growth, primarily through entering into new industry verticals and internationalisation. We supported investment into sales and software engineering to help drive global operational efficiencies and further accelerate multi-site scalability. The transformation included a significant build-out of the leadership team as well as expansion into Germany, enabling the business to become a European leader within the automotive embedded software sector.",
    "stats": [
      {
        "label": "return on investment",
        "value": "5.6x"
      },
      {
        "label": "new market entry (Germany)",
        "value": "1"
      }
    ]
  },
  {
    "title": "Mountain Warehouse",
    "category": "Consumer",
    "description": "Retailer of outdoor clothing and equipment",
    "url": "https://www.inflexion.com/portfolio/mountain-warehouse",
    "img": "https://www.inflexion.com/media/2skjidas/mountain-warehouse-400x400.png?width=526&height=422&v=133586220588830000&format=webp",
    "status": "Status: Current",
    "sector": "Consumer",
    "investmentPeriod": "Jul 2018",
    "headquarters": "London, UK",
    "contacts": [
      "Carl Wormald",
      "Elizabeth Grinnell",
      "Carl Wormald",
      "Elizabeth Grinnell"
    ],
    "quote": "Inflexion truly understand our business and their investment is helping turbo-charge our expansion plans, particularly overseas and online.",
    "quoteAuthor": "Mark Neale",
    "aboutText": "About \n\nInflexion has been part of outdoor clothing specialist Mountain Warehouse since a minority investment in 2018 to help it grow online and overseas. \n\nMountain Warehouse has grown from a single store in 1997 into a multi-channel business employing more than 2,000 people with over 380 stores in the UK, UK, across Europe, the US, New Zealand and recently Australia.",
    "valueAcceleration": "Value acceleration \n\nSince the investment, Inflexion has helped the company enhance its digital offering and e-commerce strategy, with the launch of Mountain Warehouse Marketplace selling third-party products and brand expansion boosting online revenue significantly. Inflexion’s network has supported the opening of a warehouse and distribution centre in New Zealand as well as the appointment of an experienced NED.",
    "stats": []
  },
  {
    "title": "Movera",
    "category": "Business Services",
    "description": "Property conveyancing services",
    "url": "https://www.inflexion.com/portfolio/movera",
    "img": "https://www.inflexion.com/media/gt5jfrqg/moverav1.png?width=526&height=422&v=133845406406330000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Jul 2019",
    "headquarters": "Stockport, UK",
    "contacts": [
      "Andrew Neville",
      "Catherine Richards",
      "Tushaar Nadkarni",
      "Andrew Neville",
      "Catherine Richards",
      "Tushaar Nadkarni"
    ],
    "quote": "Working with Inflexion closely has given us deep insight that is additive to our ambition. Together we are leading the market  on merit, with home moving experiences that are digital when they can be and personal when they need to be.",
    "quoteAuthor": "Nick Hale",
    "aboutText": "About \n\nMovera’s focus on digital, data and M&A have helped it become the UK’s leading B2B tech‐enabled provider of property and remortgage conveyancing services with Inflexion’s support since 2019 (then ONP Group).  \n\nMovera markets its services through its strong relationships with panel managers, mortgage brokers and banks, whose referrals make up around 90% of Movera’s >100k annual transactions. The firm utilises a sophisticated case management technology which allows it to offer market‐leading service and efficiency.",
    "valueAcceleration": "Value acceleration \n\nInflexion is helping Movera grow through M&A and supported the acquisitions of Grindeys and Cavendish, adding new build and estate agent channels. Inflexion has also supported four acquisitions adding panel management capabilities in transactions and remortgage. Our in-house digital team are working with Movera to accelerate innovation in its existing technology platforms to deliver service improvement for clients and we have invested into client-facing software.",
    "stats": []
  },
  {
    "title": "Mycom",
    "category": "Technology",
    "description": "Specialist software provider",
    "url": "https://www.inflexion.com/portfolio/mycom",
    "img": "https://www.inflexion.com/media/2qygvd1d/mycom-rgb-web.png?width=526&height=422&v=133854711895270000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Nov 2018",
    "headquarters": "London",
    "contacts": [
      "Roddy Green",
      "Carl Wormald",
      "Manolis Katsouris",
      "Will Southgate",
      "Roddy Green",
      "Carl Wormald",
      "Manolis Katsouris",
      "Will Southgate"
    ],
    "quote": "Inflexion have a huge amount of experience in the sector, and strong digital skills that have supported us as our customers have adopted our cloud-native platform. Under Inflexion’s ownership we have migrated to a fully subscription-based operating model with strong growth in our recurring revenue.",
    "quoteAuthor": "Andrew Coll",
    "aboutText": "About \n\nInflexion has supported the transition of telco assurance specialist Mycom into a subscription-based operating model since investing in 2018. \n\nMycom provides its software solutions to more than 40 top-tier telcos worldwide, assuring the experiences of two billion-plus subscribers. In addition to its London headquarters, Mycom has offices in the US, France, UAE, India, and Singapore. It provides the first service assurance solution run from the cloud and uses a subscription model that has been commercially deployed at scale to a loyal client base.",
    "valueAcceleration": "Value acceleration \n\nInflexion's experience in supporting businesses at a transitional point has been crucial as Mycom’s market transformed to offer new digital, IoT and 5G services whilst adopting automated solutions to reduce operational costs. With Inflexion’s digital support, Mycom’s cloud-based automated assurance solution has been enhanced with AI capability which has won multiple industry awards, while our talent team has built out the leadership team to drive the accelerated growth.",
    "stats": []
  },
  {
    "title": "National Accident Helpline",
    "category": "Business Services",
    "description": "Accident helpline",
    "url": "https://www.inflexion.com/portfolio/national-accident-helpline",
    "img": "https://www.inflexion.com/media/2c0flz2a/nationalaccidenthelplinev1.jpg?width=526&height=422&v=133845406406170000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Oct 2009 - May 2014",
    "headquarters": "Kettering, UK",
    "contacts": [
      "David Whileman",
      "David Whileman"
    ],
    "quote": "NAHL Group is a well-recognised and trusted brand with a highly cash generative business model and we are delighted that investors recognised the potential that exists for further growth in our market.",
    "quoteAuthor": "Russell Atkinson,",
    "aboutText": "About \n\nInflexion supported the growth of National Accident Helpline Group for five years, boosting earnings by 30% through organic and acquisitive growth before listing it on LSE’s AIM. \n\nNAHL (previously Consumer Champion Group) is the UK’s leading consumer marketing business focused on the personal injury market, providing solicitor firms, helping to connect people with appropriate solicitor firms and other associated services.",
    "valueAcceleration": "Value acceleration \n\nInflexion worked closely with NAHL’s ambitious management team to implement strategic changes that drove the company’s impressive growth over their partnership. Together they created ‘The Underdog’, an animated marketing campaign which drove a 50% increase in enquiry volumes in 2013 compared to pre-Underdog levels. During the period of our investment, NAHL’s earnings grew by around 30%.",
    "stats": [
      {
        "label": "earnings growth",
        "value": "30%"
      },
      {
        "label": "return on investment",
        "value": "3.9x"
      }
    ]
  },
  {
    "title": "Nomentia",
    "category": "Technology",
    "description": "Cash and treasury management software",
    "url": "https://www.inflexion.com/portfolio/nomentia",
    "img": "https://www.inflexion.com/media/drbhjgv1/nomentia.png?width=526&height=422&v=133632866071070000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Mar 2023",
    "headquarters": "Helsinki, Finland",
    "contacts": [
      "Sergio Ferrarini",
      "Henrik Nordman",
      "Kristina Miettinen",
      "Sergio Ferrarini",
      "Henrik Nordman",
      "Kristina Miettinen"
    ],
    "quote": "Going forward, Nomentia plans to be even better at serving customers in its current markets and new ones by bringing new and innovative features to a growing client base. Management is very excited to work with Inflexion to accelerate the company’s growth further.",
    "quoteAuthor": "Jukka Sallinen",
    "aboutText": "About \n\nNomentia is a leading cash & treasury management software provider headquartered in Finland.\n\nNomentia delivers a comprehensive portfolio of solutions to 1,300+ customers in 80 countries processing more than €1.4 trillion of payments through its bank connections annually.",
    "valueAcceleration": "Value acceleration \n\nInflexion has been supporting Nomentia since 2023 to accelerate its growth across Europe both organically and through further acquisitions, while continuing to maintain its high level of customer service. Inflexion’s commercial team is supporting the company on its commercial strategy including sales & marketing effectiveness, go-to-market approach and pricing initiatives.",
    "stats": []
  },
  {
    "title": "Ocorian",
    "category": "Financial Services",
    "description": "Fund and Corporate Services",
    "url": "https://www.inflexion.com/portfolio/ocorian",
    "img": "https://www.inflexion.com/media/tgmhqmob/ocorianv1.png?width=526&height=422&v=133845406406000000&format=webp",
    "status": "Status: Current",
    "sector": "Financial Services",
    "investmentPeriod": "Sep 2016",
    "headquarters": "Jersey, UK",
    "contacts": [
      "Flor Kassai",
      "George Collier",
      "Marcus Ward",
      "Heng Schiltges",
      "Jack Pearson",
      "Flor Kassai",
      "George Collier",
      "Marcus Ward",
      "Heng Schiltges",
      "Jack Pearson"
    ],
    "quote": "Inflexion’s partnership has helped us secure multiple acquisitions, scale internationally, broaden our services, and invest in technology and people. Together, we’ve transformed the business into a leading global asset servicing firm for our clients.",
    "quoteAuthor": "Chantal Free",
    "aboutText": "About \n\nOcorian is a provider of corporate, fund and fiduciary administration services headquartered in the Channel Islands.\n\nSince independence, the business has grown rapidly to operate from 20 key global jurisdictions and serves over 6,000+ clients.",
    "valueAcceleration": "Value acceleration  \n\nOcorian has transformed into a global fund administration and corporate services leader of significant scale through substantial M&A, supported by Inflexion which led its carve out in 2016. \n\nInflexion’s relevant experience with a business similar to Ocorian, Sanne, means we truly understand how to drive growth in this market. Following the carve-out of Ocorian from Bedell Cristin in 2016, Inflexion supported an ambitious global M&A programme with over a dozen acquisitions undertaken across the UK, US, Luxembourg, the Netherlands and Mauritius. The transformational acquisition of Estera in 2020 made Ocorian the seventh largest player globally by revenue, while the acquisition of Nordic Trustee in 2021 gave Ocorian access to the Nordic bond and direct lending markets. The M&A journey has been supported by significant investment into technology.  Inflexion continues to work with the company to evaluate further acquisitions.",
    "stats": []
  },
  {
    "title": "On the Beach",
    "category": "Consumer",
    "description": "Dynamic package holidays",
    "url": "https://www.inflexion.com/portfolio/on-the-beach",
    "img": "https://www.inflexion.com/media/cicbnrx3/onthebeachv1.png?width=526&height=422&v=133845406406570000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Oct 2013 - Sep 2015",
    "headquarters": "Cheadle, UK",
    "contacts": [],
    "quote": "With the support of Inflexion we accelerated our technology capabilities, brought in-house direct contracting of bed supply, invested in brand building through investment into television advertising and expanded our geographic reach.",
    "quoteAuthor": "Simon Cooper,",
    "aboutText": "About \n\nOn The Beach’s journey with Inflexion led to impressive digital enhancement and international growth and a doubling of headcount to generate 5x money when it floated on the London Stock Exchange. \n\nOn the Beach was founded in 2004 and rapidly became the UK market leader for short-haul packaged beach holidays. The firm attracts over one million customer bookings per year.",
    "valueAcceleration": "Value acceleration \n\nWe invested heavily in R&D and digital enhancement to help On the Beach exploit the structural shift to online holiday bookings. Capitalising on strategic partnerships with world-class digital leaders such as Google, Inflexion worked with On the Beach to optimise search, helping to significantly increase customer conversion rates and sales. The business launched its first iOS mobile app in 2014, and launched in Sweden in 2015. \n\nDuring our partnership, employee numbers doubled whilst EBITDA grew 50%. At the time of flotation, the investment generated a return of 5x money and an IRR of 84%.",
    "stats": [
      {
        "label": "IRR",
        "value": "84%"
      },
      {
        "label": "EBITDA growth",
        "value": "50%"
      },
      {
        "label": "return on investment",
        "value": "5x"
      }
    ]
  },
  {
    "title": "Optionis",
    "category": "Business Services",
    "description": "Employment services",
    "url": "https://www.inflexion.com/portfolio/optionis",
    "img": "https://www.inflexion.com/media/eq4c5kc0/optionis.png?width=526&height=422&v=133631193647070000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Oct 2006 - Dec 2013",
    "headquarters": "Warrington, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion were a proactive investor, fully supporting the management team’s ambition in developing the business so effectively over our seven years together.",
    "quoteAuthor": "Rob Crossland,",
    "aboutText": "About \n\nEmployment services company Optionis saw profits increase by 100% during its partnership with Inflexion, during which time it grew acquisitively into a full-range employment services business for flexible workers. \n\nEstablished in 2000, Optionis (the parent brand of Parasol, Clearsky and Silverline) is one of the UK’s leading employment services companies. As an employment umbrella company, Parasol provides tax and billing payroll to its flexible employees whose services are contracted to end-clients, typically large blue-chip organisations, whilst Clearsky provides a full range of accounting services for SMEs. It was sold to MML Group in 2013.",
    "valueAcceleration": "Value acceleration \n\nInflexion led the buyout of the business to support the company in its organic and acquisitive growth. We initially supported the major acquisition of Clearsky, which provided complementary product streams. This was followed by three value-enhancing add-ons which expanded its service offering to include accountancy and HR services. Overall, the number of workers under management grew from 5,500 to over 12,000 during the hold period.",
    "stats": [
      {
        "label": "profit growth",
        "value": "100%"
      },
      {
        "label": "return on investment",
        "value": "3.2x"
      }
    ]
  },
  {
    "title": "Outdoor Plus",
    "category": "Technology",
    "description": "Out-of-home advertising",
    "url": "https://www.inflexion.com/portfolio/outdoor-plus",
    "img": "https://www.inflexion.com/media/fzamdesk/outdoor-400x400.png?width=526&height=422&v=133631193638970000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Nov 2016 - Sep 2018",
    "headquarters": "London, UK",
    "contacts": [
      "Richard Swann",
      "David Whileman",
      "Richard Swann",
      "David Whileman"
    ],
    "quote": "Inflexion was an extremely supportive partner as we grew and digitalised our portfolio and strengthened the business more generally. Initially wary of taking on private equity funding, we were convinced by the merits of Inflexion’s Partnership Capital offering.",
    "quoteAuthor": "Jonathan Lewis",
    "aboutText": "About \n\nOut-of-home advertising specialist Outdoor Plus grew into a grew into a market leader with a portfolio of over 40 screens in 27 locations at the time of exit to Global Radio, marking the first Partnership Capital exit for Inflexion and a strong result for management. \n\nOutdoor Plus provides premium digital advertising screens at iconic London locations including the Hyde Park Underpass, The Hammersmith Towers, Euston Underpass and City of London Gateway. The company reaches an audience of over 77.7 million per fortnight for customers including Samsung, Google, Jaguar and Jimmy Choo.",
    "valueAcceleration": "Value acceleration \n\nOutdoor Plus weren’t looking for an investor, but were convinced by the prospect of a Partnership Capital deal to accelerate new site development. Additionally, our extensive technology experience through our investments in Group IMD, Mobica, and CloserStill Media, among others, made us a natural partner. During our ownership, the senior management team was enhanced and the sales team built out to support accelerated growth. Overall 12 new premium digital sites opened in conjunction with Transport for London with three further digital sites secured; and over 30 traditional sites converted to digital to create the market leader.",
    "stats": [
      {
        "label": "EBITDA growth",
        "value": "321876%"
      },
      {
        "label": "IRR",
        "value": "432765%"
      }
    ]
  },
  {
    "title": "PD&MS",
    "category": "Business Services",
    "description": "Technical engineering consultancy",
    "url": "https://www.inflexion.com/portfolio/pdms",
    "img": "https://www.inflexion.com/media/sj5mi1lh/pdmsgroup.png?width=526&height=422&v=133631193650070000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Jul 2014 - Jul 2023",
    "headquarters": "Aberdeen, Scotland",
    "contacts": [
      "Catherine Richards",
      "Catherine Richards"
    ],
    "quote": "We are grateful for Inflexion’s ongoing commitment to our business as we continually adopted to a changing environment and repositioned the business to take advantage of the global energy transition.",
    "quoteAuthor": "Simon Rio",
    "aboutText": "About \n\nInflexion supported engineering specialist PD&MS to diversify its operations and enter the emerging renewables and energy transition market before its sale to RSK Group. \n\nPD&MS is a specialist provider of Engineering, Procurement and Construction (EPC) services for the global energy markets. Its core capability is brownfield design engineering services, utilising sophisticated project planning and design software tools to service drilling and production operators throughout the oil, gas and renewable energy markets. PD&MS’s established operations in the North Sea and Azerbaijan and strong customer relationships meant it works with major blue-chip operators such as BP and Apache enabling them to design more energy efficient operations. Inflexion sold its investment to RSK Group, a global leader in the delivery of sustainable solutions.",
    "valueAcceleration": "Value acceleration \n\nDuring the investment period, Inflexion supported PD&MS as it successfully navigated a challenging oil and gas market and diversified its operations, including entering the emerging renewables and energy transition market.  Inflexion supported PD&MS to complete two complementary acquisitions which added technical capability and accelerated PD&MS' position in the highly attractive energy sustainability market. PD&MS’s customer base was broadened through these initiatives enabling the securing of significant long-term framework agreements.",
    "stats": [
      {
        "label": "acquisitions",
        "value": "2"
      }
    ]
  },
  {
    "title": "Peach",
    "category": "Technology",
    "description": "Video advertising platform",
    "url": "https://www.inflexion.com/portfolio/peach",
    "img": "https://www.inflexion.com/media/cijl2brr/peach-logo-400x400.png?width=526&height=422&v=133586222613470000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Sep 2016",
    "headquarters": "London, UK",
    "contacts": [
      "Tom Green",
      "Ravi Shah",
      "Tom Green",
      "Ravi Shah"
    ],
    "quote": "Our ambition is to be the leader in our space, and it is fantastic to find a partner in Inflexion that matches our vision. Their in-country experts have been incredibly helpful with the growth of our international business and their experience with M&A has helped us to complete some transformational acquisitions",
    "quoteAuthor": "Ben Regensburger",
    "aboutText": "About \n\nPeach has become the leading advertising workflow automation suite with Inflexion’s support in M&A and internationalisation since 2016.  \n\nPeach checks, transcodes and sends video ads to TV, on-demand, online, social channels and agencies in over 110 countries. Peach’s proprietary platform provides the only global, integrated view of video advertising that is distributed to online, social, linear broadcasters and advanced TV platforms. Its 200+ team in 42 global offices serves 7,000 clients.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s international offices and M&A experience have helped Peach transform into the global SaaS leader it is today, including acquisitions in Europe and Latin America extending Peach’s geographical reach and offering. Inflexion has also assisted the management team to develop their proposition and to explore expansion opportunities in other market segments and geographies.  Most recently, Peach has enhanced its digital, social creative and workflow capabilities through acquisition.",
    "stats": []
  },
  {
    "title": "Pharmaspectra",
    "category": "Healthcare",
    "description": "Medical affairs data",
    "url": "https://www.inflexion.com/portfolio/pharmaspectra",
    "img": "https://www.inflexion.com/media/jzemyix5/logoforwebsite.png?width=526&height=422&v=133586226742030000&format=webp",
    "status": "Status: Realised",
    "sector": "Healthcare",
    "investmentPeriod": "Oct 2019 - Jul 2022",
    "headquarters": "London, UK",
    "contacts": [
      "Andrea Johnson",
      "Andrea Johnson"
    ],
    "quote": "Pharmaspectra has seen significant growth with the support of Inflexion. The business has invested in both its digital platform as well as its international operations, helping to attract a number of major new global clients.",
    "quoteAuthor": "Jez Moulding",
    "aboutText": "About \n\nMedical data leader Pharmaspectra grew substantially under Inflexion’s ownership, including a new digital platform and entry into China before its sale to a NYSE-listed trade buyer. \n\nPharmaspectra is a global provider of medical affairs data to the pharmaceutical and biotech industry and hosts the world’s largest, continuously updated and integrated online repository of disseminated medical science information. This includes 16 million meeting presentations, 28 million publication abstracts and 417,000 clinical trials results. This data is used across the pharmaceutical sector where Pharmaspectra has an expansive and diverse customer base including 13 of the top 20 pharma companies. The firm has offices in the UK, US, and India.",
    "valueAcceleration": "Value acceleration \n\nInflexion used its extensive experience in scaling and professionalising companies to support Pharmaspectra, with the digital team supporting the creation of a new medical affairs data and insights platform and substantial investment into its sales team, marketing and client services. Inflexion also supported the international expansion of the business including the build-out of the team in India and developing Pharmaspectra’s entry strategy into China.",
    "stats": [
      {
        "label": "Customer growth",
        "value": "160%"
      },
      {
        "label": "IRR",
        "value": "25%"
      }
    ]
  },
  {
    "title": "Phenna Group",
    "category": "Business Services",
    "description": "Testing and inspection services",
    "url": "https://www.inflexion.com/portfolio/phenna-group",
    "img": "https://www.inflexion.com/media/ihtp50ig/phenna-logo.png?width=526&height=422&v=133637192403200000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Feb 2021 - Dec 2022",
    "headquarters": "Nottingham, UK",
    "contacts": [
      "Sam McPhail",
      "Heng Schiltges",
      "Sam McPhail",
      "Heng Schiltges"
    ],
    "quote": "Inflexion’s minority offering combined with the firm’s impressive experience in similar businesses made them the perfect partner. Their knowledge of our sector and support in accelerating our M&A journey exceeded my expectations.",
    "quoteAuthor": "Paul Barry",
    "aboutText": "About \n\nInflexion’s 18-month minority partnership with TICC specialist Phenna saw EBITDA more than double with 23 acquisitions as an international platform of scale was created, valued at over £1bn when it was sold. \n\nPhenna Group is a global business focused on the Testing, Inspection, Certification and Compliance (TICC) sector and consists of a broad range of TICC businesses currently serving the industrial manufacturing and built environment markets. The company continues is consolidating the highly fragmented TICC industry by acquiring select niche, independent TICC businesses that serve critical end-markets in the UK and internationally.",
    "valueAcceleration": "Value acceleration \n\nInflexion was well positioned to help Phenna achieve its ambitious growth plans due to its substantial experience in the sector following investments in Alcumus, British Engineering Services and Cawood Scientific. Inflexion’s significant M&A experience enabled Phenna to undertake 23 acquisitions in six countries as the firm accelerated its internationalisation, adding significant revenues in Asia and the Middle East and expanding into new end-market sectors. Inflexion also supported the build-out of the central leadership team.",
    "stats": [
      {
        "label": "acquisitions in 6 countries",
        "value": "210321"
      },
      {
        "label": "EBITDA growth",
        "value": "210x"
      },
      {
        "label": "headcount growth",
        "value": "321x"
      }
    ]
  },
  {
    "title": "Phlexglobal",
    "category": "Healthcare",
    "description": "Clinical research documentation",
    "url": "https://www.inflexion.com/portfolio/phlexglobal",
    "img": "https://www.inflexion.com/media/f2edkbqy/phlex.png?width=526&height=422&v=133631193639470000&format=webp",
    "status": "Status: Realised",
    "sector": "Healthcare",
    "investmentPeriod": "Mar 2011 - Jul 2014",
    "headquarters": "Buckinghamshire, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion enabled management to make investments in our people and technology to grow our business. We enjoyed working with Inflexion in the UK and utilising their wider team to assess the international opportunities in India and Asia Pacific.",
    "quoteAuthor": "Stella Donoghue",
    "aboutText": "About \n\nInflexion supported planned succession and international growth of TMF services provider Phlexglobal to generate 2.8x money.   \n\nPhlexglobal is a specialist provider of tech-enabled document management solutions to the global clinical research market. The business employs around 200 people in the UK and US, and counts a significant majority of the top 20 global pharmaceutical companies among its clients. In 2014 the firm was sold to Bridgepoint Development Capital, generating a 2.8x return on investment.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s investment allowed the founder to transition out of the business and provided an opportunity to strengthen the management team. The business rapidly expanded international operations, opening a new office in Pennsylvania in the US to target North American pharma clients, and assessing the opportunity in India and Asia Pacific through Inflexion’s international experts. Phlexglobal also accelerated investment in its core technology platform and its service provision.",
    "stats": [
      {
        "label": "new office opened (US)",
        "value": "1"
      },
      {
        "label": "return on investment",
        "value": "2.8x"
      }
    ]
  },
  {
    "title": "Pims",
    "category": "Industrials",
    "description": "Waste water services",
    "url": "https://www.inflexion.com/portfolio/pims",
    "img": "https://www.inflexion.com/media/piif22pp/pimsgroup.png?width=526&height=422&v=133586225108570000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Mar 2008 - Feb 2013",
    "headquarters": "Hampshire, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "",
    "quoteAuthor": "",
    "aboutText": "About  \n\nWastewater services company Pims worked with Inflexion to create a UK leader through increasing market share and four add-on acquisitions, ultimately attracting US trade buyer Xylem. \n\nPims comprises Pims Pumps, which designs and install the pumps, and Pims Services, which manage their maintenance and ongoing service contracts. The company’s services also encompass specialist treatment systems, rainwater harvesting and environmental testing.",
    "valueAcceleration": "Value acceleration \n\nDuring our ownership we actively assisted in pursuing and negotiating a number of acquisitions, with four completed. Two were significant: Tankers (a drainage, CCTV and tanker operator) and Hydroserve (a sewage treatment and oil interceptor service provider), while two regional bolt-ons added to national coverage. \n\nThese enabled Pims to develop an integrated services model, servicing pump systems as well as the complex drainage networks on site. We also encouraged investment in R&D to create intelligent maintenance systems. All of this meant they could focus on larger clients, attract national accounts and engage with the UK water authorities.",
    "stats": [
      {
        "label": "acquisitions",
        "value": "4"
      }
    ]
  },
  {
    "title": "PMC Treasury",
    "category": "Financial Services",
    "description": "Treasury and risk management",
    "url": "https://www.inflexion.com/portfolio/pmc-treasury",
    "img": "https://www.inflexion.com/media/atocarn1/pmc-400x400.png?width=526&height=422&v=133586225873170000&format=webp",
    "status": "Status: Current",
    "sector": "Financial Services",
    "investmentPeriod": "Oct 2018",
    "headquarters": "London, UK",
    "contacts": [
      "Andrew Mainwaring",
      "Rob Dagger",
      "Josh de Wet",
      "Andrew Mainwaring",
      "Rob Dagger",
      "Josh de Wet"
    ],
    "quote": "To have attracted a firm as experienced as Inflexion is testament to the reputation, we have built in providing independent and impartial advice to financial sponsors. Inflexion’s in-country presence in key global markets combined with relevant experience in our sector makes them an excellent fit for our growth plans.",
    "quoteAuthor": "Kevin Cooke",
    "aboutText": "About \n\nPMC Treasury has been growing its operational treasury and risk management consultancy internationally with minority capital from Inflexion since 2018. \n\nPMC is an independent provider of treasury and risk management solutions globally to corporate clients, private equity and infrastructure funds and their portfolio companies. Its offices in London, New York and Singapore employ 64 people and additionally draw on a panel of independent treasury consultants.",
    "valueAcceleration": "Value acceleration \n\nInflexion is supporting the management team in their ambitions to scale the business, particularly in Asia and the US. Inflexion has supported PMC’s international development particularly in India, while our value acceleration team worked with management to refine the software value proposition and scale the software development team to support the increasing use of technology tools in PMC’s service delivery.",
    "stats": []
  },
  {
    "title": "Proteros",
    "category": "Healthcare",
    "description": "Drug discovery research platform",
    "url": "https://www.inflexion.com/portfolio/proteros",
    "img": "https://www.inflexion.com/media/5tibmojn/proteros.png?width=526&height=422&v=133631193664630000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Jan 2023",
    "headquarters": "Munich, Germany",
    "contacts": [
      "Martin Preuss",
      "Andrew Neville",
      "Jonathan Battye",
      "Martin Preuss",
      "Andrew Neville",
      "Jonathan Battye"
    ],
    "quote": "I am thrilled to have Inflexion on board as a partner. Their track record in backing high-growth businesses combined with their life sciences experience gives me great conviction that they are well placed to support Proteros in its further growth trajectory.",
    "quoteAuthor": "Dr Torsten Neuefeind",
    "aboutText": "About \n\nProteros Biostructures GmbH is a contract research organisation focused on early-stage drug discovery and growing in the US with Inflexion Partnership Capital since 2023.  \n\nProteros is a leading Munich-based contract research organisation specialising in structural biology. Its cutting-edge platform enables users to map the shape of a drug target with a high degree of precision as it supports over 200 pharma and biotech partners in the US, Europe and Japan to reach the right results and accelerate their overall research timelines, helping them to lead optimisation and clinical programmes.",
    "valueAcceleration": "Value acceleration \n\nInflexion is supporting Proteros to scale globally, both organically and through acquisition, particularly in the US. Inflexion’s expertise in healthcare, M&A and commercial strategy is strengthening Proteros’ overall value proposition for its blue-chip customer base, supporting with M&A strategy & opportunities and refining its finance and marketing approach.",
    "stats": []
  },
  {
    "title": "Radius",
    "category": "Technology",
    "description": "Fleet payment processing and telematics",
    "url": "https://www.inflexion.com/portfolio/radius-payment-solutions",
    "img": "https://www.inflexion.com/media/eb3d4fre/radius-sq-for-website.png?width=526&height=422&v=133631193646200000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Jan 2018",
    "headquarters": "Crewe, UK",
    "contacts": [
      "David Whileman",
      "Jack Weller",
      "David Whileman",
      "Jack Weller"
    ],
    "quote": "Even those who do minority investing tended to have a majority mindset in terms of our discussions, but we felt Inflexion thought in a different way and it felt like a genuine partnership.",
    "quoteAuthor": "Bill Holmes",
    "aboutText": "About \n\nInflexion has been helping fleet and connectivity services specialist Radius to expand its offering organically and through M&A since 2017.  \n\nRadius is a leading fleet and connectivity services provider helping 400,000+ business customers with their mobility needs as well, as helping them navigate the energy transition. The business offers fuel cards, telematics, vehicle leasing, EV charge points, telecoms from its operations spanning five continents.",
    "valueAcceleration": "Value acceleration \n\nInflexion is supporting Radius to broaden its offering to SMEs with the entry into new market segments such as telematics, insurance and telecoms.  During Inflexion’s investment the company has completed over 25 acquisitions across five countries. The company has also enhanced its commercial and digital propositions. Inflexion’s teams in India and Asia Pacific are driving international expansion by building relationships with international stakeholders.",
    "stats": []
  },
  {
    "title": "Red Commerce",
    "category": "Business Services",
    "description": "Specialist resourcing",
    "url": "https://www.inflexion.com/portfolio/red-commerce",
    "img": "https://www.inflexion.com/media/inwnohrq/redcommerce.png?width=526&height=422&v=133631193647500000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Dec 2005 - Jul 2011",
    "headquarters": "London, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion were an ambitious and proactive investor and fully supported the management team in developing the business so effectively over our five-year partnership.",
    "quoteAuthor": "Richard Vercesi",
    "aboutText": "About \n\nIT resourcing specialist Red Commerce partnered with Inflexion to open new international offices and grew profits 125% to generate 4.4x money. \n\nRed is a global IT resourcing specialist supplying SAP consultants to multinational corporations on mid- and long-term consulting contracts and permanent placements. Red saw demand for its specialised consultants double under Inflexion’s ownership. The team’s multinational and multilingual nature gave it a competitive edge in the global SAP market, and the business was sold in a £44m deal to financial buyer Dunedin.",
    "valueAcceleration": "Value acceleration \n\nWe helped to set up offices in Munich, Zurich, Sao Paulo and Stockholm, and developed the strategic market entry and operational plan to enter the US. Together we invested heavily in Red’s business development function and corporate infrastructure as well as developing a unique consultancy service line called RedSolutions. \n\nThe investment period saw Red’s profits grew by 125% and staff numbers increased by 85%. At exit the company had the depth of skills and capabilities to realise its further growth ambitions.",
    "stats": [
      {
        "label": "profit growth",
        "value": "125%"
      },
      {
        "label": "return on investment",
        "value": "4.4x"
      },
      {
        "label": "headcount growth",
        "value": "85%"
      }
    ]
  },
  {
    "title": "Reed & Mackay",
    "category": "Business Services",
    "description": "Travel management",
    "url": "https://www.inflexion.com/portfolio/reed-mackay",
    "img": "https://www.inflexion.com/media/2ubbfxvz/r_m_logo_strap_pos-v2.png?width=526&height=422&v=133631193654770000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Aug 2016 - May 2021",
    "headquarters": "London, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion’s experience in international growth was a real boost to our development. Their unwavering support as business stalled in 2020 was crucial; they kept us looking ahead so we were well placed for the return of travel.",
    "quoteAuthor": "Fred Stratford",
    "aboutText": "About \n\nInflexion supported the UK and international growth of premium corporate travel management business Reed & Mackay both organically and through six acquisitions before its sale to TripActions. \n\nReed & Mackay delivers a personalised service through cutting-edge technology. Its strategic travel management services focus on law firms, insurance companies, finance houses and the energy sector. Reed & Mackay also provides an industry-leading event management service.",
    "valueAcceleration": "Value acceleration \n\nInflexion is very experienced in supporting the expansion travel companies through investments in On the Beach, Scott Dunn and Griffin Global Group. Reed & Mackay’s India office was supported by Inflexion’s expert in Bangalore, while our digital team supported the development of Reed & Mackay’s digital customer-facing offering, which provided an enhanced user experience and drove online sales and higher margins.  \n\nSix acquisitions were supported by Inflexion in the UK, Germany, France, Australia and the US, including Hillgate Travel and the Business Travel Direct division of Ickenham Travel Group. The firm also opened six new international offices in New York, California, Toronto, Singapore, Amsterdam and India.    \n\nInflexion provided significant support to Reed & Mackay to adapt to the Covid pandemic, positioning the business for recovery.",
    "stats": [
      {
        "label": "acquisitions",
        "value": "6"
      },
      {
        "label": "international offices opened",
        "value": "6"
      }
    ]
  },
  {
    "title": "Reward Gateway",
    "category": "Technology",
    "description": "Employee benefit programme",
    "url": "https://www.inflexion.com/portfolio/reward-gateway",
    "img": "https://www.inflexion.com/media/yydmychl/reward-cateway.png?width=526&height=422&v=133651919294070000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Dec 2010 - Jul 2015",
    "headquarters": "London, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "We had an amazing four years with Inflexion and became a stronger and more successful company. Their backing enabled us to invest heavily in expanding the services we provide to HR and scale the business internationally.",
    "quoteAuthor": "Glenn Elliott",
    "aboutText": "About \n\nEmployee engagement business Reward Gateway saw substantial UK and international growth with EBITDA and headcount quadruple during its Inflexion investment before its sale to a US buyer generated 7.7x money. \n\nReward Gateway was founded in 2006 and went on to become a leading provider of mobile-optimised SaaS employee engagement software used by corporate HR departments to attract, engage and retain their talent. The company’s services power employee benefits, recognition and communications on behalf of more than 1,100 of the world’s top employers, including American Express, Discovery, AOL and IBM. The business was sold to Great Hill Partners in the US.",
    "valueAcceleration": "Value acceleration \n\nThroughout our four-year stewardship of Reward Gateway, we worked closely with the management team to enhance the company’s product suite and expand its international reach. Reward Gateway acquired two businesses, one of which doubled the size of the company in Australia. Further international expansion saw the company open a US office in 2014 while continuing to grow market share in the UK through client retention and new client wins.",
    "stats": [
      {
        "label": "EBITDA growth",
        "value": "4x"
      },
      {
        "label": "return on investment",
        "value": "7.7x"
      },
      {
        "label": "headcount growth",
        "value": "4x"
      }
    ]
  },
  {
    "title": "Rhead",
    "category": "Business Services",
    "description": "Technical engineering consultancy",
    "url": "https://www.inflexion.com/portfolio/rhead",
    "img": "https://www.inflexion.com/media/lzsnqxi4/rhead-group-400x400.png?width=526&height=422&v=133631193639800000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Jun 2011 - Aug 2015",
    "headquarters": "Coventry, UK",
    "contacts": [
      "David Whileman",
      "David Whileman"
    ],
    "quote": "Our partnership with Inflexion supported Rhead in acquiring four complementary businesses, diversify our service and sector offering, and broaden our reach. Rhead’s highly skilled and committed team now work across a wide range of sectors and markets.",
    "quoteAuthor": "Nigel Curry",
    "aboutText": "About \n\nProfessional services firm Rhead Group made four acquisitions during its minority partnership with Inflexion before its sale to UK listed Costain Group plc. \n\nInternational professional services consultancy Rhead built a strong track record delivering large infrastructure programmes for the energy, power generation, defence, transport and utilities sectors. Managing a portfolio of major capital projects, the company serves clients all over the world.",
    "valueAcceleration": "Value acceleration \n\nDuring our partnership with Rhead we worked closely with the management team to build out the team further and support four transformational acquisitions. These helped to increase Rhead’s geographic reach and broaden its offering and customer base. Two of these acquisitions were in the Australian market, creating a strong presence in this key region. At the time of exit, Rhead had offices in the UK, Australia, Singapore and the UAE.  Inflexion also undertook a digital audit to identify areas of improvement in systems and processes, which ultimately assisted in the appointment of a new Information Technology Director.",
    "stats": []
  },
  {
    "title": "Rosemont Pharmaceuticals",
    "category": "Healthcare",
    "description": "Liquid pharmaceuticals",
    "url": "https://www.inflexion.com/portfolio/rosemont-pharmaceuticals",
    "img": "https://www.inflexion.com/media/3jddxr4n/4-colour-cmyk-rl-no-strap-line-high-res-sq-transaprent.png?width=526&height=422&v=133631193662300000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Jun 2020",
    "headquarters": "Leeds, UK",
    "contacts": [
      "Andrew Neville",
      "Christian Fellowes",
      "Martin Thrane Pedersen",
      "Catherine Richards",
      "Will Southgate",
      "Andrew Neville",
      "Christian Fellowes",
      "Martin Thrane Pedersen",
      "Catherine Richards",
      "Will Southgate"
    ],
    "quote": "Inflexion brings a number of strengths to our business, firstly a challenging mindset stimulating management to think about being more ambitious. They are agile but approachable. There is access to additional funding and to their network which is important in identifying opportunities on the M&A front.",
    "quoteAuthor": "Howard Taylor",
    "aboutText": "About  \n\nRosemont Pharmaceuticals’ impressive organic and acquisitive growth has seen annual turnover more than double and EBITDA triple since the Inflexion-led carve-out from a US-listed parent in 2020.  \n\nRosemont is the UK’s leading liquid generic pharmaceutical platform, selling life-saving oral liquid medicines to those with swallowing difficulties (primarily geriatric and paediatric patients). The company commands more than half of the UK market and is the sole supplier of a total of 27 unique molecules in the UK, with a portfolio of over 130 oral liquid medicines into the UK as well as the US, Continental Europe and the Middle East.",
    "valueAcceleration": "Value acceleration  \n\nWith substantial experience in successfully executing carve-outs, we have drawn on our healthcare expertise to establish Rosemont as a fully standalone business. We leveraged our digital experience to assist with the IT carve-out and invested further in innovation and new product development, driving a pipeline of c.70 new products expected to launch by 2029. The c-suite build out was supported by Inflexion’s talent team and with four completed bolt-ons in the UK, US and Greece. Inflexion continues to support with international growth, including the hiring of a US Vice President to drive our US business.",
    "stats": []
  },
  {
    "title": "Sanne",
    "category": "Business Services",
    "description": "Trust and fund administration",
    "url": "https://www.inflexion.com/portfolio/sanne",
    "img": "https://www.inflexion.com/media/1zfkhpps/sanne-logo.png?width=526&height=422&v=133651919299700000&format=webp",
    "status": "Status: Realised",
    "sector": "Business Services",
    "investmentPeriod": "Oct 2012 - Mar 2015",
    "headquarters": "Jersey, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion enabled us to create a step change in the business. Their guidance during both acquisitions was invaluable and helping us strengthen the senior team with high quality appointments and leaves our business very well placed for the future.",
    "quoteAuthor": "Dean Godwin",
    "aboutText": "About \n\nFund administrator Sanne received minority investment from Inflexion to fund consolidation and global growth, achieving 45% EBITDA CAGR. The business listed on the London Stock Exchange in 2015, generating a 4.0x return.   \n\nJersey-headquartered Sanne delivers effective corporate governance, high quality financial reporting and responsive administration services to a broad institutional customer base. Sanne delivers services to its international customer base through its office network in the Channel Islands, Luxembourg, London, Dublin, Dubai, Hong Kong, Singapore and Shanghai. It employs around 300 people globally and has over €40bn in assets under administration.",
    "valueAcceleration": "Value acceleration \n\nDuring our investment we supported two acquisitions from State Street, both of which added considerable scale, international reach and profit growth to Sanne. \n\nInflexion encouraged management to invest in highly skilled people, and during our partnership headcount in the business grew by over 80%. Sanne drew support from Inflexion’s international teams in India and China to explore growth opportunities within those local markets; the business also expanded its footprint by opening an office in Singapore. Between 2012 and 2014 the company generated 38% revenue CAGR and 45% EBITDA CAGR.",
    "stats": [
      {
        "label": "headcount growth",
        "value": "80%"
      },
      {
        "label": "return on investment",
        "value": "4x"
      }
    ]
  },
  {
    "title": "Scott Dunn",
    "category": "Consumer",
    "description": "Luxury travel",
    "url": "https://www.inflexion.com/portfolio/scott-dunn",
    "img": "https://www.inflexion.com/media/twybkysc/scott-dunn-company-logo.png?width=526&height=422&v=133634404912270000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Dec 2014 - Feb 2023",
    "headquarters": "London, UK",
    "contacts": [
      "Catherine Richards",
      "Andreas Constantinides",
      "Catherine Richards",
      "Andreas Constantinides"
    ],
    "quote": "Inflexion’s M&A and operational experience has been invaluable. We are proud of our brand strength in the UK and now the US and Singapore, and of our commitments to being a responsible business. Inflexion were particularly supportive during Covid as we transformed our business model.",
    "quoteAuthor": "Sonia Davies",
    "aboutText": "About \n\nInflexion supported luxury travel operator Scott Dunn’s organic and acquisitive expansion into the US and Asia as well as navigating the challenging pandemic period before its sale to Australian listed Flight Centre Travel Group. \n\nScott Dunn provides a broad range of luxury holidays from skiing and Mediterranean resorts to tailor-made journeys and bespoke honeymoons. Scott Dunn is recognised as a premium brand in the sector and is distinguished by delivering very high levels of service to its guests.",
    "valueAcceleration": "Value acceleration \n\nInflexion was well positioned to help Scott Dunn achieve its ambitious growth plans due to its substantial experience in the travel space following successful investments in On the Beach and Griffin Global.  \n\nInflexion supported the continued development of Scott Dunn’s strong brand, with the business voted top Travel Specialist by Condé Nast Traveller for ten years in a row. Inflexion’s support and geographic expansion enabled a 24-hour guest service as well as Scott Dunn’s Responsible Business strategy covering community, protecting and empowering people and protecting the environment and wildlife. \n\nInflexion provided strong support to Scott Dunn during the COVID pandemic and the business traded resiliently, using the time to strengthen the business model and prepare for the return of the travel market.",
    "stats": []
  },
  {
    "title": "SMD",
    "category": "Industrials",
    "description": "Subsea vehicle systems",
    "url": "https://www.inflexion.com/portfolio/smd",
    "img": "https://www.inflexion.com/media/af3o1g4c/smd-800x800.png?width=526&height=422&v=133631193634770000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Apr 2008 - Apr 2015",
    "headquarters": "Wallsend, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "Inflexion were an active and supportive investor with whose help we diversified our customer base and the markets which we serve.",
    "quoteAuthor": "Andrew Hodgson",
    "aboutText": "About \n\nInflexion backed subsea vehicle maker SMD to support its international growth and digital enhancement. The business was subsequently purchased by a Hong Kong-listed business, generating 2.2x money.  \n\nSMD’s unmanned submarines, Remotely Operated Vehicles (ROVs), and engineering trenching equipment provide subsea intervention work in depths and conditions that are inaccessible for human divers. The company dominates the market for subsea vehicles, supplying the oil and gas sector as well as the telecoms, renewable energy, mining and defence industries by delivering bespoke equipment.",
    "valueAcceleration": "Value acceleration \n\nShortly after the investment, we bolstered the management team to allow the founder to step back and focus more on cutting-edge product development. We then worked closely with them to open a second UK factory and boost manufacturing capacity. We leveraged our experience in internationalising businesses to open sales offices in Singapore, the US and Brazil, and created a Digital Service Platform to provide an intelligent spare parts and servicing model to optimise the operational effectiveness of ROVs. This facilitated future ancillary earnings through monetising the data they captured.  \n\nThe business was sold to Hong Kong-listed Zhuzhou CSR Times Electric Company and valued at £120m.",
    "stats": [
      {
        "label": "headcount growth",
        "value": "3x"
      },
      {
        "label": "return on investment",
        "value": "2.2x"
      }
    ]
  },
  {
    "title": "Sparta Global",
    "category": "Business Services",
    "description": "Technology and training services",
    "url": "https://www.inflexion.com/portfolio/sparta-global",
    "img": "https://www.inflexion.com/media/tv0ick4v/sparta-website.png?width=526&height=422&v=133586227123630000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Oct 2020",
    "headquarters": "London, UK",
    "contacts": [
      "Robin Senivassen",
      "Molly Hindhaugh",
      "Robin Senivassen",
      "Molly Hindhaugh"
    ],
    "quote": "Our unique business model has allowed us to grow quickly and helped to place thousands of students from a variety of backgrounds in full-time employment. We were drawn to Inflexion’s incredibly relevant experience and proven success in the sector and are leveraging this to expand our business.",
    "quoteAuthor": "David Rai",
    "aboutText": "About \n\nSparta Global is a B Corp certified technology training provider, with diversity and inclusion at the core of its offering to clients. \n\nSparta trains graduates in a range of technology skills and then deploys “Spartans” in relevant roles with its clients, plugging the skills gap between school and university education and a professional career. Sparta’s graduates come from a diverse range of backgrounds before being trained in one of the firm’s programmes, which cover in-demand technology areas such as data engineering, software engineering, DevOps and business analysis.",
    "valueAcceleration": "Value acceleration \n\nSparta has built further on its impressive growth profile since Inflexion invested in 2020. Inflexion is drawing on its deep experience in the technology training market to help Sparta – including its investment in FDM, which saw profits grow five-fold during the partnership before successfully floating on the LSE. Inflexion is also currently working with Netherlands-based online IT recruitment and training services business Calco, as well as global resourcing specialist K2 Partnering Solutions, both of which operate in similar markets. Inflexion’s commercial team has helped management define and shape the company’s commercial function.",
    "stats": []
  },
  {
    "title": "Ster Century",
    "category": "Consumer",
    "description": "Cinema operator",
    "url": "https://www.inflexion.com/portfolio/ster-century",
    "img": "https://www.inflexion.com/media/vtbfpvme/ster-century-400x400.png?width=526&height=422&v=133586225694000000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Jul 2003 - Jul 2004",
    "headquarters": "Surrey, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "",
    "quoteAuthor": "",
    "aboutText": "About \n\nInflexion’s 12-month stewardship with cinema operator Ster Century saw profits grow by 37% before its sale to a financial buyer generated a 244% IRR for investors. \n\nMultiplex cinema operator Ster had 87 screens across seven sites in the UK and Ireland at the time of our buyout. The cinemas were then brand new and the previous owners, a joint venture between two South African companies, had invested over £30m on the chain’s sites which were very modern, attractive, well located and featured ultra-wide screens.",
    "valueAcceleration": "Value acceleration\n\nInflexion won over the leadership team for the 2003 buyout and the year that followed saw a strong focus on renegotiating film costs, holding rent reviews and introducing a bonus scheme to incentivise cinema managers. Inflexion’s active role supported Ster to ultimately secure one of the highest rates of box office revenue per screen in the UK and as a result, a number of investors approached the business. Management chose to re-invest to be part of its continued success when we exited in 2004.",
    "stats": [
      {
        "label": "profit growth",
        "value": "37%"
      },
      {
        "label": "IRR",
        "value": "224%"
      },
      {
        "label": "return on investment",
        "value": "3.2x"
      }
    ]
  },
  {
    "title": "SteriPack",
    "category": "Healthcare",
    "description": "Medical device CMDO",
    "url": "https://www.inflexion.com/portfolio/steripack",
    "img": "https://www.inflexion.com/media/t42bxx4s/steripack-new-website-logo.jpg?width=526&height=422&v=133845406435370000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Jul 2022",
    "headquarters": "Mullingar, Ireland",
    "contacts": [
      "Catherine Richards",
      "Christian Fellowes",
      "Tushaar Nadkarni",
      "Catherine Richards",
      "Christian Fellowes",
      "Tushaar Nadkarni"
    ],
    "quote": "Inflexion clearly understands our vision, and their experience in growing healthcare businesses makes them a great backer for this stage of our journey.",
    "quoteAuthor": "Jason Anderson",
    "aboutText": "About \n\nIn 2022 Inflexion led the buyout of SteriPack, a leading global contract manufacturer serving the medical device, pharmaceutical and diagnostic sectors.   \n\nSteriPack provides outsourced design, development, manufacturing, assembly, packaging, sterilisation and supply chain services, producing a range of products. The company employs over 650 people from its locations in Ireland, Poland, Malaysia, UK and the US, and has over 100 global clients.",
    "valueAcceleration": "Value acceleration  \n\nInflexion is helping SteriPack to scale further, with the acquisition of Kinneir Dufort helping to expand its capabilities globally and creating a European Design & Development Centre of Excellence.  \n\nInflexion is supporting SteriPack to evaluate further acquisitions opportunities, while Inflexion’s Healthcare Advisory Board is also supporting SteriPack on its growth journey.   \n\nInflexion brings its extensive experience across commercial topics to support SteriPack’s go to market strategy.",
    "stats": []
  },
  {
    "title": "Succession",
    "category": "Financial Services",
    "description": "Wealth management",
    "url": "https://www.inflexion.com/portfolio/succession",
    "img": "https://www.inflexion.com/media/z2pjq51i/new-succession.jpg?width=526&height=422&v=133631193640530000&format=webp",
    "status": "Status: Realised",
    "sector": "Financial Services",
    "investmentPeriod": "Jan 2014 - Aug 2022",
    "headquarters": "Birmingham, UK",
    "contacts": [
      "Andrew Mainwaring",
      "Toby Lane",
      "Andrew Mainwaring",
      "Toby Lane"
    ],
    "quote": "We are very grateful for the incredible support Inflexion have been in helping us to consolidate the domestic market and achieve the scale we have.",
    "quoteAuthor": "James Stevenson",
    "aboutText": "About \n\nUnder Inflexion’s stewardship, Succession pursued an ambitious acquisition programme with 60 businesses acquired, making it the UK’s largest independent wealth manager on its sale to FTSE 100 business Aviva plc. \n\nFounded in 2009, Succession is the UK’s largest independent wealth management businesses with 200 planners advising c19,000 clients on £9.5 billion of assets. Succession provides wealth management and financial planning services to individual and corporate clients.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s extensive M&A experience made us the perfect partner for the Succession team, whose ambitions were largely based on a focused acquisitive-growth programme. We supported a strengthening of the leadership team and central functions to support the growth of the business, which consolidated its market through its 60 acquisitions. This made it the UK’s largest independent financial adviser with 200 planners advising c19,000 clients on £9.5 billion of assets, up from £1.7 billion when we invested. We also helped the firm to develop a vertically integrated wealth management proposition, ultimately making Succession the only independent financial adviser consolidator with its own platform. It was sold to FTSE 100 business Aviva plc for £385m.",
    "stats": [
      {
        "label": "acquisitions",
        "value": "60"
      },
      {
        "label": "increase in assets under advice and management",
        "value": "5x"
      }
    ]
  },
  {
    "title": "Systal",
    "category": "Technology",
    "description": "Managed network services",
    "url": "https://www.inflexion.com/portfolio/systal",
    "img": "https://www.inflexion.com/media/fmkbo4b2/systal-for-website.png?width=526&height=422&v=133631193635070000&format=webp",
    "status": "Status: Current",
    "sector": "Technology, Business Services",
    "investmentPeriod": "Mar 2021",
    "headquarters": "Glasgow, UK",
    "contacts": [
      "Andrew Mainwaring",
      "Sebastian Sørensen",
      "Andrew Mainwaring",
      "Sebastian Sørensen"
    ],
    "quote": "Inflexion’s presence in our key markets combined with their deep technology understanding make them the ideal partner for Systal as we look to grow our business at home and internationally.",
    "quoteAuthor": "Neil Nicolson",
    "aboutText": "About \n\nManaged network specialist Systal Technology Solutions has been growing across the globe with minority equity from Inflexion since 2021.  \n\nSystal’s high-quality, mission-critical managed network service operates 24/7 to service blue-chip clients’ IT networks globally.",
    "valueAcceleration": "Value acceleration  \n\nInflexion is working with Systal to further enhance its offering in the UK, Europe and the US. There is a large and growing market for managed network and cyber security providers, and Inflexion’s deep knowledge of the technology is supporting the Systal team with their rapid growth plans.",
    "stats": []
  },
  {
    "title": "TC Group",
    "category": "Business Services",
    "description": "Accountancy and taxation service provider",
    "url": "https://www.inflexion.com/portfolio/tc-group",
    "img": "https://www.inflexion.com/media/xs2fkboo/tc-group-crop.png?width=526&height=422&v=133637822196800000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Jun 2023",
    "headquarters": "Sussex, UK",
    "contacts": [
      "Andrew Mainwaring",
      "Toby Lane",
      "Andrew Mainwaring",
      "Toby Lane"
    ],
    "quote": "Our primary goal is to keep providing a fantastic service to our partners and customers, and with the extra resources that Inflexion provides we can ensure this happens. Inflexion immediately impressed us with the way that they understood our business and our aspirations.",
    "quoteAuthor": "Richard Keyes",
    "aboutText": "About  \n\nTC Group offers accountancy, taxation services and broader professional advice to UK SMEs. Inflexion is supporting its ambitious market consolidation.  \n\nTC Group provides bespoke, high-quality accounting, bookkeeping, tax, audit and payroll services along with broader business and personal advice. It operates through 35+ local offices throughout the UK with over 1,000 employees servicing over 30,000 clients. TC focuses on enabling partners to retain their autonomy and grow their income whilst providing industry-leading infrastructure and support.",
    "valueAcceleration": "Value acceleration  \n\nInflexion has extensive experience in the professional services sector, with successful partnerships alongside firms such as  Succession Wealth, Lane Clark & Peacock, Ocorian, PMC Treasury and Sparta Global  illustrating what can be achieved by combining Inflexion’s support with ambitious management teams. TC has a strong track record of organic growth and through acquisition, with four acquisitions made in its first year of Inflexion partnership.",
    "stats": []
  },
  {
    "title": "Tekton",
    "category": "Technology",
    "description": "Software for the construction industry",
    "url": "https://www.inflexion.com/portfolio/tekton",
    "img": "https://www.inflexion.com/media/0xioy4h5/tekton.png?width=526&height=422&v=133586225506770000&format=webp",
    "status": "Status: Realised",
    "sector": "Technology",
    "investmentPeriod": "Dec 2006 - Mar 2008",
    "headquarters": "Manchester, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "I was delighted to work with Inflexion in positioning Tekton for its next stage of growth. We had a rewarding and fruitful working relationship over a 15-month partnership, which was reflected in the company’s success.",
    "quoteAuthor": "Richard Beaton",
    "aboutText": "About \n\nInflexion led the buyout of construction software business Tekton and support organic and acquisitive growth to see profits grow 50%. The firm was bought by Sage (UK) Limited, generating a 2x return and an IRR of 65%. \n\nTekton Group is an Enterprise Resource Planning (ERP) software provider to the UK construction industry. Its products, used by customers such as Carillion, Skanska and Eric Wright Group, include integrated accounting, resource application and planning tools that are specific to this industry.",
    "valueAcceleration": "Value acceleration  \n\nOur initial investment included the simultaneous complementary acquisition of SiteStream Software, a software supplier to construction companies based in Surrey, UK and Missouri, US. \n\nDuring our partnership, we invested heavily in Tekton’s infrastructure, consolidated its operations and expanded its sales force. We also supported the company’s acquisition of New York-based Wilcomp, enabling Tekton’s objective of expanding its footprint in the US. \n\nAs a result of our investment and strategic guidance, the business saw its profits increase by 50%, while employee numbers grew by over 16%.",
    "stats": [
      {
        "label": "profit growth",
        "value": "50%"
      },
      {
        "label": "IRR",
        "value": "65%"
      },
      {
        "label": "headcount growth",
        "value": "15%"
      }
    ]
  },
  {
    "title": "THE",
    "category": "Business Services",
    "description": "Higher education rankings and data provider",
    "url": "https://www.inflexion.com/portfolio/times-higher-education",
    "img": "https://www.inflexion.com/media/sloh3cmq/timeshighereducationv1.png?width=526&height=422&v=133845406405830000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Feb 2019",
    "headquarters": "London, UK",
    "contacts": [
      "Cameron Lenton",
      "Catherine Richards",
      "Will Southgate",
      "Cameron Lenton",
      "Catherine Richards",
      "Will Southgate"
    ],
    "quote": "Inflexion’s strong history of driving international growth and digital transformation makes them an ideal partner for Times Higher Education. As we enter an exciting phase of our development, it’s reassuring to have access to Inflexion’s valuable resources and expertise.",
    "quoteAuthor": "John Gill",
    "aboutText": "About \n\nTimes Higher Education (THE) is a leading provider of data, rankings, content and services to the higher education market. The business has considerably grown its global footprint under the stewardship of Inflexion. \n\nTHE is the largest provider of university rankings globally, publishing it’s  World University Rankings annually. Its 3,000+ clients globally use the information to gain insight, inform strategic priorities, benchmark, assess and select higher education institutions. \n\nThe company employs over 325 people across its offices in the UK, US, Australia and Singapore.",
    "valueAcceleration": "Value acceleration \n\nInflexion have supported the business acquire six businesses during our hold period making us the acquirer of choice in our sector. Our in-house digital team are assisting with enhancing the company’s digital presence and our commercial team have supported the refinement of the go-to-market strategy. The firm’s acquisition of Inside Higher Ed in the US, its second under Inflexion ownership, made it the largest global platform for academics.",
    "stats": []
  },
  {
    "title": "TPP",
    "category": "Healthcare",
    "description": "Veterinary platform",
    "url": "https://www.inflexion.com/portfolio/tpp",
    "img": "https://www.inflexion.com/media/kiwbjmoa/tppv1.png?width=526&height=422&v=133845406406900000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Sep 2024",
    "headquarters": "Berlin, Germany",
    "contacts": [
      "Martin Preuss",
      "Andrew Neville",
      "Michael Hammer",
      "Henry Awit",
      "Martin Preuss",
      "Andrew Neville",
      "Michael Hammer",
      "Henry Awit"
    ],
    "quote": "We look forward to partnering with Inflexion to continue to invest in the growth of our business and development of our network. Our founding and senior management team will stay on board and we remain fully committed to our mission of creating the best experience for animals and people every day.",
    "quoteAuthor": "Fabian Kröll",
    "aboutText": "About \n\nTierarzt Plus Partner (“TPP”) is Germany’s largest group of veterinary practices. In 2024, Inflexion’s Buyout Fund VI invested in the business, partnering with the founders to further grow and expand the company.\n\nFounded in 2018, TPP has close to 100 vet practices across Germany and c. 1,700 employees. The company partners with local veterinarians to offer leading animal healthcare services, mainly for small animals, and supports them with comprehensive training, best industry practices and significant technology investments.",
    "valueAcceleration": "Value acceleration \n\nThe veterinary care market in Germany remains fragmented with considerable scope for further consolidation and growth. Inflexion plans to utilise its significant industry experience to partner with the founding management and shareholders of TPP to accelerate the growth of the business. In particular, Inflexion will support further investment in digitisation of the business, training and the expansion of its vet practice network across Germany both through acquisitions and the opening of new greenfield sites.",
    "stats": []
  },
  {
    "title": "UK Power Reserve",
    "category": "Industrials",
    "description": "Flexible power generation",
    "url": "https://www.inflexion.com/portfolio/uk-power-reserve",
    "img": "https://www.inflexion.com/media/adznf3hb/ukpowerv1.jpg?width=526&height=422&v=133845406405370000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Nov 2015 - May 2018",
    "headquarters": "Solihull, UK",
    "contacts": [
      "Richard Swann",
      "Malcolm Coffin",
      "Richard Swann",
      "Malcolm Coffin"
    ],
    "quote": "Inflexion were a pleasure to work with, and their strategic direction was instrumental in supporting the significant growth of UK Power Reserve which is now very well positioned for future growth.",
    "quoteAuthor": "Tim Emrich",
    "aboutText": "About \n\nUK Power Reserve’s 2.5-year partnership with Inflexion saw its portfolio treble to over 500MW, revenues quadruple to c.£80m and headcount more than double to 150 before it was bought by Singaporean trade buyer Sembcorp.   \n\nUK Power Reserve (UKPR) is a leading developer, owner and operator of smart, flexible power generation assets. The company generates reserve power in times of critical need via its 500MW+ portfolio from 32 sites in England and Wales. These sites are all maintained by UKPR’s highly skilled workforce and are closely monitored from its Virtual Power Station control centre in the West Midlands.",
    "valueAcceleration": "Value acceleration  \n\nHaving secured a significant number of 15-year Capacity Market generation contracts to nearly triple its existing capacity, the management team sought investors to help optimise performance from existing operations and build new sites to significantly grow its generating capacity.  \n\nOur investment alongside co-investors Equistone supported the acceleration of the business’s growth, trebling capacity to over 500MW – enough to power 375,000 homes in local communities – delivered from 32 rapid-response power stations across England and Wales. During the hold period, UKPR grew its revenues from c.£20m to over £80m and its employee headcount more than doubled from 70 to 150. Singaporean trade buyer Sembcorp acquired the business for £216m plus assumed debt.",
    "stats": [
      {
        "label": "revenue growth",
        "value": "432x"
      },
      {
        "label": "headcount growth",
        "value": "210x"
      }
    ]
  },
  {
    "title": "Ultimate Performance",
    "category": "Consumer",
    "description": "Premium health and fitness platform",
    "url": "https://www.inflexion.com/portfolio/ultimate-performance",
    "img": "https://www.inflexion.com/media/ynqdwavi/ultimateperformance-logo.png?width=526&height=422&v=133845406344870000&format=webp",
    "status": "Status: Current",
    "sector": "Consumer",
    "investmentPeriod": "Apr 2024",
    "headquarters": "Manchester, UK",
    "contacts": [
      "James Stevens",
      "David Collins",
      "Josh de Wet",
      "James Stevens",
      "David Collins",
      "Josh de Wet"
    ],
    "quote": "From day one, the investment by Inflexion has given Ultimate Performance access to skills and experience to help the business professionalise, as we prepare for further expansion. Having the support of Inflexion to manage the transition from Founder-led has proven key, as we strengthen the leadership team.",
    "quoteAuthor": "Simon McMurtrie",
    "aboutText": "About \n\nInflexion’s Enterprise Fund V invested in the business to drive its growth in the UK, US and internationally.  \n\nUltimate Performance is the world’s leading personal training business.\n\nFounded in 2009, it was created to bring professional standards to personal training and provide clients with a proven fitness solution that delivers tangible results and return on investment. \n\nUltimate Performance’s results-focused model is unique in the fitness industry - helping clients make lasting lifestyle changes through personalised training and nutrition, data-led progress tracking, and expert one-to-one coaching that supports clients beyond the gym.\n\nToday, the business operates 27 private training facilities across the UK, Europe, North America, Asia, and the Middle East. Its network of over 350 elite personal trainers is supported by a central team, based in Manchester, providing the scalable infrastructure and operational excellence to support continued global growth.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s investment will support Ultimate Performance’s strategy to double down on the strength of the core personal training proposition and continue rolling it out globally.",
    "stats": []
  },
  {
    "title": "Upperton Pharma",
    "category": "Healthcare",
    "description": "Pharmaceutical particle engineering",
    "url": "https://www.inflexion.com/portfolio/upperton-pharma-solutions",
    "img": "https://www.inflexion.com/media/qgtnqnd4/upperton-for-website.png?width=526&height=422&v=133631193664200000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Apr 2022",
    "headquarters": "Nottingham UK",
    "contacts": [
      "Andrew Neville",
      "Christian Fellowes",
      "Andrea Johnson",
      "Jacqueline Phillips",
      "Andrew Neville",
      "Christian Fellowes",
      "Andrea Johnson",
      "Jacqueline Phillips"
    ],
    "quote": "The Inflexion team share our commitment to recruiting the right people for the business and investing in the current employees to strengthen the culture that is so critical to our success. The business has grown significantly since the investment.",
    "quoteAuthor": "Nikki Whitfield",
    "aboutText": "About \n\nUpperton Pharma Solutions is a UK-based specialist contract development and manufacturing organisation. The business has doubled its headcount and boosted its manufacturing capacity within 18 months of the Inflexion investment. \n\nUpperton’s particle engineering expertise has enabled it to develop a wide range of finished dosage formats for its pharmaceutical clients, typically during early phase clinical trials. It is known for its spray drying expertise, a particle engineering technology used to ensure targeted delivery of drugs to the lungs and nasal cavity or provide solutions to pharma clients who have challenges with poorly soluble molecules. \n\nThe business received the Kings Award for International Trade in 2023.",
    "valueAcceleration": "Value acceleration \n\nInflexion is supporting Upperton to expand its scale and capabilities, with investment into a new purpose built 50k sq. Ft. facility increasing manufacturing space ten-fold and analytical space four-fold. This is allowing Upperton to support drug manufacture into later stages of clinical trials and niche-scale commercial manufacturing. We have supported additions to the c-suite and are also evaluating M&A targets with strong strategic rationale.",
    "stats": []
  },
  {
    "title": "Viking Moorings",
    "category": "Industrials",
    "description": "Mooring equipment supplier",
    "url": "https://www.inflexion.com/portfolio/viking-moorings",
    "img": "https://www.inflexion.com/media/xudbb5al/vikingmoorings.png?width=526&height=422&v=133586225436700000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Jan 2006 - Jul 2009",
    "headquarters": "Aberdeen, UK",
    "contacts": [
      "Richard Swann",
      "Richard Swann"
    ],
    "quote": "",
    "quoteAuthor": "",
    "aboutText": "About \n\nViking Moorings transformed from being a European focused North Sea operator to a global moorings equipment supplier following Inflexion’s buyout, which saw headcount double and EBITDA grow 5x, generating a 10.2x return. \n\nViking, formerly Balmoral Marine, was founded in 1985 and went on to become a market leader in the provision of mission critical mooring solutions to the oil and gas sector for key assets such as semi-submersible drilling rigs, drill ships and floating accommodation platforms.",
    "valueAcceleration": "Value acceleration \n\nTo enable Viking to expand, we first helped to strengthen the management team, ensuring the right skills were in place to lead the company. We then supported an ambitious capex programme to accelerate growth at home and abroad, overseeing the development of design and advisory packages and helping Viking to build a strong global presence capable of serving the growing markets in Asia, Australia and China Pacific regions. \n\nDuring the stewardship, the higher margin Norwegian market became Viking’s major revenue driver, while the allure of the Asia Pacific market inspired the establishment of a Singapore office. \n\nHeadcount doubled to more than 100 during our partnership before it was sold to HSBC Private Equity.",
    "stats": [
      {
        "label": "return on investment",
        "value": "10.2x"
      },
      {
        "label": "headcount increase",
        "value": "2x"
      }
    ]
  },
  {
    "title": "Village Vets",
    "category": "Healthcare",
    "description": "Veterinary services",
    "url": "https://www.inflexion.com/portfolio/village-vets",
    "img": "https://www.inflexion.com/media/njpl5m2c/vv-website.png?width=526&height=422&v=133651919014570000&format=webp",
    "status": "Status: Current",
    "sector": "Healthcare",
    "investmentPeriod": "Jan 2024",
    "headquarters": "Dublin, Ireland",
    "contacts": [
      "Michael Baster",
      "David Collins",
      "Kate Washington",
      "Michael Baster",
      "David Collins",
      "Kate Washington"
    ],
    "quote": "Investment from a partner with experience in our sector and who shares our vision will enable us to achieve our growth plans as we expand our locations to bring our renowned pet-care and expertise to more customers and their pets.",
    "quoteAuthor": "Charles Cosgrave",
    "aboutText": "About \n\nIn 2024, Inflexion’s Enterprise Fund invested in Village Vets, the largest independent group of veterinary practices in the Republic of Ireland.  \n\nFounded in 1980, Village Vets is a family-run business employing c. 260 employees across 19 sites. Village Vets is regarded as a premium operator with best-in-class facilities and general veterinary services for small animals across the Greater Dublin Area.",
    "valueAcceleration": "Value acceleration \n\nInflexion has deep experience in scaling pet care businesses having previously invested in Medivet, a veterinary group that doubled its footprint and headcount during the five-year partnership.  \n\nInflexion is now supporting Village Vets’ ambitions to deliver an enhanced offering to its customers across a wider geography. A dedicated capital pot will facilitate the expansion of existing sites and new location openings, as well as the development of specialist practices.",
    "stats": []
  },
  {
    "title": "Virgin Experience Days",
    "category": "Consumer",
    "description": "Leisure experiences",
    "url": "https://www.inflexion.com/portfolio/virgin-experience-days",
    "img": "https://www.inflexion.com/media/350dvij1/virginv1.jpg?width=526&height=422&v=133845406405230000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Sep 2017 - Jul 2022",
    "headquarters": "Buckinghamshire, UK",
    "contacts": [
      "Alex Read",
      "Alex Read"
    ],
    "quote": "We have seen significant growth with the support of Inflexion, including more than doubling our team and launching the Virgin Experience Gifts brand into the US market.",
    "quoteAuthor": "Richard Hurd-Wood",
    "aboutText": "About \n\nExperience gifting business VED grew significantly during its partnership with Inflexion as it transformed from a single-country business to an international player, doubling revenues and entering the US market.  \n\nVirgin Experience Days (VED) is a leading provider of curated experiences, inspiring gift ideas for customers across the UK and US. The company offers an extensive range of 5,000 experiences, from skydiving to luxury breaks, derived from its network of longstanding relationships with suppliers including Fortnum & Mason, Red Bull Racing and Bletchley Park.",
    "valueAcceleration": "Value acceleration \n\nInflexion backed the buyout of the experience gifting business in 2017, and supported the company’s growth and expansion into new markets, both organically and by acquisition. \n\nWe invested in the company’s tech platform significantly, improving the consumer proposition and attracting new customers. The acquisition of US experience gifting business Cloud 9 Living established a platform in the US (Virgin Experience Gifts). Inflexion also backed the relaunch of the B2B division of the business (Virgin Incentives), substantially expanding its client base. The successful partnership saw revenues double.  \n\nWe sold a majority stake to Equistone, retaining a minority stake to be part of its exciting growth journey ahead.",
    "stats": [
      {
        "label": "revenue increase",
        "value": "2x"
      },
      {
        "label": "market entry",
        "value": "US"
      }
    ]
  },
  {
    "title": "Vivona Brands",
    "category": "Consumer",
    "description": "Brand creation and management",
    "url": "https://www.inflexion.com/portfolio/vivona-brands",
    "img": "https://www.inflexion.com/media/sszfjl5j/vivonav1.png?width=526&height=422&v=133845406404900000&format=webp",
    "status": "Status: Realised",
    "sector": "Consumer",
    "investmentPeriod": "Feb 2012 - May 2019",
    "headquarters": "London, UK",
    "contacts": [
      "Catherine Richards",
      "Catherine Richards"
    ],
    "quote": "We’ve had an incredible journey of growth and transformation with Inflexion at our side. Their support as we built our global infrastructure and entered new markets was instrumental in helping us grow the business.",
    "quoteAuthor": "Simon Russell",
    "aboutText": "About \n\nInflexion led the buyout of brand creation and management company Vivona in 2012, merging the US partner into the business and allowing for succession. We helped accelerate growth by expanding in the UK and abroad.  \n\nVivona Brands (formerly NPW) delivers on-trend beauty, wellbeing and lifestyle brands to global fast-fashion and beauty-savvy consumers. Vivona’s products are sold internationally through partnerships with major tier 1 retailers including Ulta Beauty, CVS, Walgreens and Target in the US and Sephora, Superdrug and Boots in EMEA.",
    "valueAcceleration": "Value acceleration \n\nInflexion’s international experts made us a good fit for management’s plans as we worked together to reposition the business for growth, mainly in the US, and introduced new products with a focus on the high growth wellness and beauty categories. Inflexion supported the development of the global infrastructure to grow the business internationally, including investment into internal systems, and we drew on our digital expertise to make improvements to Vivona’s digital infrastructure and operations. Sales increased, particularly in the US, and we continued to invest heavily into both front-office (sales and product development) as well as back-office resource. Our China presence was instrumental in helping recruit a local sales manager and then driving the international sourcing capability of the group.",
    "stats": [
      {
        "label": "brands launched",
        "value": "8"
      },
      {
        "label": "US stores selling products",
        "value": "20,000"
      }
    ]
  },
  {
    "title": "Wise",
    "category": "Technology",
    "description": "Software provider for logistics delivery firms",
    "url": "https://www.inflexion.com/portfolio/wise",
    "img": "https://www.inflexion.com/media/j1ym2cya/wisev1.png?width=526&height=422&v=133845406404970000&format=webp",
    "status": "Status: Current",
    "sector": "Technology",
    "investmentPeriod": "Nov 2021",
    "headquarters": "Solihull, UK",
    "contacts": [
      "Cameron Lenton",
      "Cameron Lenton"
    ],
    "quote": "The investment from Inflexion is supporting us to continue to improve the technology for our existing clients while we roll out our intuitive platform to a variety of new sectors.",
    "quoteAuthor": "Simon Hills",
    "aboutText": "About \n\nInflexion invested in Wise, a software provider for logistics delivery firms serving the e-commerce sector, in 2021. \n\nWise provides software to support a network of last-mile delivery providers who work with carriers such as Amazon and DPD. The Wise platform is used by over 250 UK logistics firms and 14,000 self-employed drivers to manage everything from onboarding to document storage and compliance.",
    "valueAcceleration": "Value acceleration  \n\nThe investment and expertise from Inflexion is supporting Wise to offer more services to existing customers and expand into new sectors. \n\nInflexion’s digital team is working closely with the company’s CTO to scale up and professionalise its technology and product development functions and closely define the product roadmap. Inflexion’s commercial team worked with the company on product bundling initiatives to support a large-scale product roll-out.",
    "stats": []
  },
  {
    "title": "Wood Thilsted",
    "category": "Business Services",
    "description": "Global offshore wind engineering consultancy",
    "url": "https://www.inflexion.com/portfolio/wood-thilsted",
    "img": "https://www.inflexion.com/media/a0cfx0ia/wtfexlogo-transparent.png?width=526&height=422&v=133631193653070000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Jan 2022",
    "headquarters": "London, UK",
    "contacts": [
      "Molly Hindhaugh",
      "Molly Hindhaugh"
    ],
    "quote": "The collaboration with Inflexion helps us continue to deliver the very best engineering solutions for offshore wind. Inflexion’s investment and advice is helping us achieve our global goals but leave us firmly in charge of our own destiny.",
    "quoteAuthor": "Christian LeBlanc Thilsted",
    "aboutText": "About \n\nInflexion has been helping specialist offshore wind farm consultancy Wood Thilsted to support the global transition to renewable clean energy since 2022. \n\nWood Thilsted designs the foundations for some of the world's largest offshore wind farms, operating in all the major wind energy markets of the world and working on the most significant wind development projects globally. The firm employs over 170 employees in seven countries.",
    "valueAcceleration": "Value acceleration  \n\nThe funding from Inflexion is supporting Wood Thilsted to scale and grow internationally as the firm offers an increasing range of services to a growing client base. Key to this is investment in business development to win new clients and optimise the value of current customers; creation of a scalable platform through evolving their organisational structure; and targeted entry into new markets with large pipelines of future offshore wind developments.",
    "stats": []
  },
  {
    "title": "Xtrac",
    "category": "Industrials",
    "description": "Specialist engineering manufacturer",
    "url": "https://www.inflexion.com/portfolio/xtrac",
    "img": "https://www.inflexion.com/media/a2lgms3x/xtrac-400x400.png?width=526&height=422&v=133620687652730000&format=webp",
    "status": "Status: Realised",
    "sector": "Industrials",
    "investmentPeriod": "Oct 2017 - Jul 2023",
    "headquarters": "Berkshire, UK",
    "contacts": [
      "Richard Booth",
      "Ravi Shah",
      "Richard Booth",
      "Ravi Shah"
    ],
    "quote": "Inflexion were an incredible support over the last few years, backing our investment in leadership, people and facilities whilst accelerating our expansion into the high-performance hybrid and EV market.",
    "quoteAuthor": "Adrian Moore",
    "aboutText": "About \n\nInflexion’s investment into Xtrac enabled the motorsport transmissions specialist to expand its manufacturing capacity through a state-of-the-art facility extension and strengthen its EV capabilities before the sale to MiddleGround Capital. \n\nXtrac is the world leader in the design and manufacture of high-performance transmissions for the motorsport, hypercar and supercar industry. The business supplies most of the world’s top motorsport teams in both two- and four-wheeled racing categories across the globe, including Sportscar racing, NASCAR and Formula 1™. Xtrac is also at the forefront of hybrid and electric vehicles developments.",
    "valueAcceleration": "Value acceleration\n\nFollowing the investment by Inflexion, Xtrac broadened its product offering and significantly strengthened its electric vehicle transmission capabilities, with the overall revenue contribution of hybrid and electric vehicle transmissions systems more than tripling. In addition, the product offering and customer base was strengthened to include new hypercar models. \n\nThe investment enabled Xtrac to expand its manufacturing capacity with the opening of a significant state-of-the-art manufacturing facility extension, opening of the in-house Xtrac Academy apprentice training centre, and expansion of its US operation, whilst investing in its workforce with the number of highly skilled high-value manufacturing staff and engineers increasing by close to 50% to over 450 staff.",
    "stats": [
      {
        "label": "increase in staff",
        "value": "5430%"
      },
      {
        "label": "ESG accreditations",
        "value": "321"
      }
    ]
  },
  {
    "title": "YER",
    "category": "Business Services",
    "description": "Specialist secondment agency",
    "url": "https://www.inflexion.com/portfolio/yer",
    "img": "https://www.inflexion.com/media/pcjnytsh/website-logo-template.png?width=526&height=422&v=133917996303870000&format=webp",
    "status": "Status: Current",
    "sector": "Business Services",
    "investmentPeriod": "Feb 2023",
    "headquarters": "Amsterdam, Netherlands",
    "contacts": [
      "Sander Ruijter",
      "Daan Gankema",
      "Vincent Wilhelm",
      "Sander Ruijter",
      "Daan Gankema",
      "Vincent Wilhelm"
    ],
    "quote": "We are confident that Inflexion is the right partner for the next stage of our growth and have been impressed with their global presence and sector knowledge, whilst benefiting from a local presence in the Dutch market.",
    "quoteAuthor": "Johan Overgaauw",
    "aboutText": "About \n\nYER is a leading Netherlands-based specialist secondment and recruiting agency. In 2023, Inflexion’s dedicated minority fund Partnership Capital II invested in YER to support the business's growth journey. \n\nFounded in 1987, YER offers high scarcity talent in undersupplied fields such as engineering, IT, public sector and finance to a range of specialist end market verticals. The business has over 1,000 clients including ASML, Bosch, KLM, VDL, Tennet and Rabobank, and operates internationally from ten local offices in the Netherlands, three in the USA, three in Germany and one in Belgium.",
    "valueAcceleration": "Value acceleration \n\nWorking closely with the founder and management team, Inflexion is supporting the growth of YER’s domestic business, US operation and expansion into new European geographies, both organically as well as via M&A. Since the start of the partnership with Inflexion, YER has already completed two strategic acquisitions in Germany.  \n\nInflexion is well placed to support the growth of YER and will leverage its deep sector experience, following successful investments in FDM, K2 Partnering Solutions, Red Commerce, Sparta and Calco.",
    "stats": []
  }
]